{
  "generatedAt": "2025-10-22T09:06:04.703Z",
  "count": 89,
  "items": [
    {
      "id": "http://arxiv.org/abs/2510.18845v1",
      "title": "MADR: MPC-guided Adversarial DeepReach",
      "url": "http://arxiv.org/abs/2510.18845v1",
      "publishedAt": "2025-10-21T17:36:52Z",
      "summary": "Hamilton-Jacobi (HJ) Reachability offers a framework for generating safe value functions and policies in the face of adversarial disturbance, but is limited by the curse of dimensionality. Physics-informed deep learning is able to overcome this infeasibility, but itself suffers from slow and inaccurate convergence, primarily due to weak PDE gradients and the complexity of self-supervised learning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585695",
      "title": "Draganfly and Palladyne partner to develop drone swarms for defense",
      "url": "https://www.therobotreport.com/draganfly-palladyne-partner-develop-drone-swarms-defense/",
      "publishedAt": "Tue, 21 Oct 2025 16:44:38 +0000",
      "summary": "Draganfly will integrate Palladyne AI's Pilot edge-based software to give drones the ability to collaborate with an operator in the loop. The post Draganfly and Palladyne partner to develop drone swarms for defense appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18776v1",
      "title": "Online Object-Level Semantic Mapping for Quadrupeds in Real-World\n  Environments",
      "url": "http://arxiv.org/abs/2510.18776v1",
      "publishedAt": "2025-10-21T16:24:43Z",
      "summary": "We present an online semantic object mapping system for a quadruped robot operating in real indoor environments, turning sensor detections into named objects in a global map. During a run, the mapper integrates range geometry with camera detections, merges co-located detections within a frame, and associates repeated detections into persistent object instances across frames.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18766v1",
      "title": "Sharing the Load: Distributed Model-Predictive Control for Precise\n  Multi-Rover Cargo Transport",
      "url": "http://arxiv.org/abs/2510.18766v1",
      "publishedAt": "2025-10-21T16:14:03Z",
      "summary": "For autonomous cargo transportation, teams of mobile robots can provide more operational flexibility than a single large robot. In these scenarios, precision in both inter-vehicle distance and path tracking is key. With this motivation, we develop a distributed model-predictive controller (MPC) for multi-vehicle cargo operations that builds on the precise path-tracking of lidar teach and repeat.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585684",
      "title": "How to overcome the hidden holdup of the battery revolution",
      "url": "https://www.therobotreport.com/how-to-overcome-hidden-holdup-battery-revolution/",
      "publishedAt": "Tue, 21 Oct 2025 15:42:08 +0000",
      "summary": "If electrification and automation are so important, why have battery makers gone bust? Proper Voltage's CEO points to integration. The post How to overcome the hidden holdup of the battery revolution appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18697v1",
      "title": "Event-Grounding Graph: Unified Spatio-Temporal Scene Graph from Robotic\n  Observations",
      "url": "http://arxiv.org/abs/2510.18697v1",
      "publishedAt": "2025-10-21T14:53:42Z",
      "summary": "A fundamental aspect for building intelligent autonomous robots that can assist humans in their daily lives is the construction of rich environmental representations. While advances in semantic scene representations have enriched robotic scene understanding, current approaches lack a connection between spatial features and dynamic events; e.g., connecting the blue mug to the event washing a mug.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.18678v1",
      "title": "Towards An Adaptive Locomotion Strategy For Quadruped Rovers:\n  Quantifying When To Slide Or Walk On Planetary Slopes",
      "url": "http://arxiv.org/abs/2510.18678v1",
      "publishedAt": "2025-10-21T14:34:53Z",
      "summary": "Legged rovers provide enhanced mobility compared to wheeled platforms, enabling navigation on steep and irregular planetary terrains. However, traditional legged locomotion might be energetically inefficient and potentially dangerous to the rover on loose and inclined surfaces, such as crater walls and cave slopes.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.18658v1",
      "title": "MorphModes: Non-rigid Registration via Adaptive Skinning Eigenmodes",
      "url": "http://arxiv.org/abs/2510.18658v1",
      "publishedAt": "2025-10-21T14:08:19Z",
      "summary": "Non-rigid registration is a crucial task with applications in medical imaging, industrial robotics, computer vision, and entertainment. Standard approaches accomplish this task using variations on the Non-Rigid Iterative Closest Point (NRICP) algorithms, which are prone to local minima and sensitive to initial conditions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18643v1",
      "title": "Least Restrictive Hyperplane Control Barrier Functions",
      "url": "http://arxiv.org/abs/2510.18643v1",
      "publishedAt": "2025-10-21T13:48:21Z",
      "summary": "Control Barrier Functions (CBFs) can provide provable safety guarantees for dynamic systems. However, finding a valid CBF for a system of interest is often non-trivial, especially if the shape of the unsafe region is complex and the CBFs are of higher order.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.18636v1",
      "title": "C-SWAP: Explainability-Aware Structured Pruning for Efficient Neural\n  Networks Compression",
      "url": "http://arxiv.org/abs/2510.18636v1",
      "publishedAt": "2025-10-21T13:40:11Z",
      "summary": "Neural network compression has gained increasing attention in recent years, particularly in computer vision applications, where the need for model reduction is crucial for overcoming deployment constraints. Pruning is a widely used technique that prompts sparsity in model structures, e.g. weights, neurons, and layers, reducing size and inference costs.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18608v1",
      "title": "A Compositional Paradigm for Foundation Models: Towards Smarter Robotic\n  Agents",
      "url": "http://arxiv.org/abs/2510.18608v1",
      "publishedAt": "2025-10-21T13:06:52Z",
      "summary": "The birth of Foundation Models brought unprecedented results in a wide range of tasks, from language to vision, to robotic control. These models are able to process huge quantities of data, and can extract and develop rich representations, which can be employed across different domains and modalities.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18600v1",
      "title": "Quadrupeds for Planetary Exploration: Field Testing Control Algorithms\n  on an Active Volcano",
      "url": "http://arxiv.org/abs/2510.18600v1",
      "publishedAt": "2025-10-21T12:59:36Z",
      "summary": "Missions such as the Ingenuity helicopter have shown the advantages of using novel locomotion modes to increase the scientific return of planetary exploration missions. Legged robots can further expand the reach and capability of future planetary missions by traversing more difficult terrain than wheeled rovers, such as jumping over cracks on the ground or traversing rugged terrain with boulders.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.18558v1",
      "title": "Flexbee: A Grasping and Perching UAV Based on Soft Vector-Propulsion\n  Nozzle",
      "url": "http://arxiv.org/abs/2510.18558v1",
      "publishedAt": "2025-10-21T12:11:12Z",
      "summary": "The aim of this paper is to design a new type of grasping and perching unmanned aerial vehicle (UAV), called Flexbee, which features a soft vector-propulsion nozzle (SVPN). Compared to previous UAVs, Flexbee integrates flight, grasping, and perching functionalities into the four SVPNs.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.18552v1",
      "title": "Descriptor: Occluded nuScenes: A Multi-Sensor Dataset for Evaluating\n  Perception Robustness in Automated Driving",
      "url": "http://arxiv.org/abs/2510.18552v1",
      "publishedAt": "2025-10-21T12:02:26Z",
      "summary": "Robust perception in automated driving requires reliable performance under adverse conditions, where sensors may be affected by partial failures or environmental occlusions. Although existing autonomous driving datasets inherently contain sensor noise and environmental variability, very few enable controlled, parameterised, and reproducible degradations across multiple sensing modalities.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18546v1",
      "title": "EfficientNav: Towards On-Device Object-Goal Navigation with Navigation\n  Map Caching and Retrieval",
      "url": "http://arxiv.org/abs/2510.18546v1",
      "publishedAt": "2025-10-21T11:52:44Z",
      "summary": "Object-goal navigation (ObjNav) tasks an agent with navigating to the location of a specific object in an unseen environment. Embodied agents equipped with large language models (LLMs) and online constructed navigation maps can perform ObjNav in a zero-shot manner.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18544v1",
      "title": "SLICE: SLO-Driven Scheduling for LLM Inference on Edge Computing Devices",
      "url": "http://arxiv.org/abs/2510.18544v1",
      "publishedAt": "2025-10-21T11:47:42Z",
      "summary": "Large Language Models (LLMs), as the foundational architecture for next-generation interactive AI applications, not only power intelligent dialogue systems but also drive the evolution of embodied intelligence on edge devices, including humanoid robots, smart vehicles, and other scenarios.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18518v1",
      "title": "Efficient Model-Based Reinforcement Learning for Robot Control via\n  Online Learning",
      "url": "http://arxiv.org/abs/2510.18518v1",
      "publishedAt": "2025-10-21T10:59:27Z",
      "summary": "We present an online model-based reinforcement learning algorithm suitable for controlling complex robotic systems directly in the real world. Unlike prevailing sim-to-real pipelines that rely on extensive offline simulation and model-free policy optimization, our method builds a dynamics model from real-time interaction data and performs policy updates guided by the learned dynamics model.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18402v1",
      "title": "MPC-based motion planning for non-holonomic systems in non-convex\n  domains",
      "url": "http://arxiv.org/abs/2510.18402v1",
      "publishedAt": "2025-10-21T08:22:56Z",
      "summary": "Motivated by the application of using model predictive control (MPC) for motion planning of autonomous mobile robots, a form of output tracking MPC for non-holonomic systems and with non-convex constraints is studied.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18373v1",
      "title": "Biomechanically consistent real-time action recognition for human-robot\n  interaction",
      "url": "http://arxiv.org/abs/2510.18373v1",
      "publishedAt": "2025-10-21T07:44:26Z",
      "summary": "This paper presents a novel framework for real-time human action recognition in industrial contexts, using standard 2D cameras. We introduce a complete pipeline for robust and real-time estimation of human joint kinematics, input to a temporally smoothed Transformer-based network, for action recognition. We rely on a new dataset including 11 subjects performing various actions, to evaluate our approach.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18371v1",
      "title": "MMRHP: A Miniature Mixed-Reality HIL Platform for Auditable Closed-Loop\n  Evaluation",
      "url": "http://arxiv.org/abs/2510.18371v1",
      "publishedAt": "2025-10-21T07:42:42Z",
      "summary": "Validation of autonomous driving systems requires a trade-off between test fidelity, cost, and scalability. While miniaturized hardware-in-the-loop (HIL) platforms have emerged as a promising solution, a systematic framework supporting rigorous quantitative analysis is generally lacking, limiting their value as scientific evaluation tools.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585685",
      "title": "Waymo plans to bring driverless robotaxis to London in 2026",
      "url": "https://www.therobotreport.com/waymo-plans-to-bring-driverless-robotaxis-london-2026/",
      "publishedAt": "Mon, 20 Oct 2025 22:12:06 +0000",
      "summary": "Over the coming months, Waymo plans to lay the groundwork for U.K. service in collaboration with its fleet partner Moove. The post Waymo plans to bring driverless robotaxis to London in 2026 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585680",
      "title": "Amazon, CMU partner on new AI Innovation Hub",
      "url": "https://www.therobotreport.com/amazon-cmu-partner-on-new-ai-innovation-hub/",
      "publishedAt": "Mon, 20 Oct 2025 17:47:45 +0000",
      "summary": "The Hub's initial focus areas leverage both institutions' strengths in artificial intelligence and robotics, Amazon and CMU said. The post Amazon, CMU partner on new AI Innovation Hub appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.16931v2",
      "title": "RAPID Hand Prototype: Design of an Affordable, Fully-Actuated Biomimetic\n  Hand for Dexterous Teleoperation",
      "url": "http://arxiv.org/abs/2510.16931v2",
      "publishedAt": "2025-10-19T17:03:26Z",
      "summary": "This paper addresses the scarcity of affordable, fully-actuated five-fingered hands for dexterous teleoperation, which is crucial for collecting large-scale real-robot data within the \"Learning from Demonstrations\" paradigm.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585672",
      "title": "Your guide to Day 2 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-day-2-robobusiness-2025/",
      "publishedAt": "Thu, 16 Oct 2025 12:00:30 +0000",
      "summary": "Day 2 of RoboBusiness 2025 is another packed day full of interesting talks, unique networking opportunities, and big-name keynotes. The post Your guide to Day 2 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585662",
      "title": "Your guide to Day 1 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-to-day-1-of-robobusiness-2025/",
      "publishedAt": "Wed, 15 Oct 2025 12:00:30 +0000",
      "summary": "This is a comprehensive guide to everything happening on the first day of RoboBusiness 2025, include a full session schedule. The post Your guide to Day 1 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585617",
      "title": "A guide to everything happening at RoboBusiness 2025",
      "url": "https://www.therobotreport.com/a-guide-to-everything-happening-at-robobusiness-2025/",
      "publishedAt": "Tue, 14 Oct 2025 12:00:26 +0000",
      "summary": "To help you keep track of everything going on at RoboBusiness, we’ve compiled a summary of all of the activities at the event. The post A guide to everything happening at RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585678",
      "title": "Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program",
      "url": "https://www.therobotreport.com/diligent-robotics-joins-agetech-collaborative-aarp-accelerator-program/",
      "publishedAt": "Tue, 14 Oct 2025 11:30:06 +0000",
      "summary": "After providing mobile manipulators to hospitals, Diligent Robotics is working with AARP to bring robots to senior care communities. The post Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585671",
      "title": "HavocAI obtains $85M to scale autonomous marine systems",
      "url": "https://www.therobotreport.com/havocai-obtains-85m-to-scale-autonomous-marine-systems/",
      "publishedAt": "Mon, 13 Oct 2025 14:38:55 +0000",
      "summary": "HavocAI plans to use the funding to grow its autonomous fleet and enable military vessels in allied navies. The post HavocAI obtains $85M to scale autonomous marine systems appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585669",
      "title": "Surgical robots take center stage at DeviceTalks West, RoboBusiness",
      "url": "https://www.therobotreport.com/surgical-robots-take-center-stage-devicetalks-west-robobusiness/",
      "publishedAt": "Mon, 13 Oct 2025 12:54:33 +0000",
      "summary": "Attendees at RoboBusiness 2025 and DeviceTalks West this week can learn about the latest developments in surgical robotics. The post Surgical robots take center stage at DeviceTalks West, RoboBusiness appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585666",
      "title": "Humanoids need orchestration to be useful in manufacturing, notes Flexxbotics CEO",
      "url": "https://www.therobotreport.com/humanoids-need-orchestration-useful-manufacturing-notes-flexxbotics-ceo/",
      "publishedAt": "Sun, 12 Oct 2025 12:30:12 +0000",
      "summary": "Before humanoids can take their place in factories, developers need to consider coordination and context, writes Tyler Bouchard. The post Humanoids need orchestration to be useful in manufacturing, notes Flexxbotics CEO appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585655",
      "title": "How machine vision is enhancing automation safety and efficiency",
      "url": "https://www.therobotreport.com/how-machine-vision-is-enhancing-automation-safety-efficiency/",
      "publishedAt": "Sat, 11 Oct 2025 12:30:23 +0000",
      "summary": "The most sophisticated machine vision systems have enabled new and emerging designs far more sophisticated than bin picking. The post How machine vision is enhancing automation safety and efficiency appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585652",
      "title": "Edge computing and AI: A conversation with Palladyne AI&#8217;s Ben Wolff",
      "url": "https://www.therobotreport.com/edge-computing-ai-conversation-ben-wolff/",
      "publishedAt": "Fri, 10 Oct 2025 19:48:45 +0000",
      "summary": "Palladyne AI focuses on simplifying robot programming, advancing swarming technology, and developing hardware-agnostic AI for diverse applications. The post Edge computing and AI: A conversation with Palladyne AI&#8217;s Ben Wolff appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585646",
      "title": "Intel expands Panther Lake processor edge applications to robotics",
      "url": "https://www.therobotreport.com/intel-expands-panther-lake-processor-edge-applications-to-robotics/",
      "publishedAt": "Fri, 10 Oct 2025 19:04:42 +0000",
      "summary": "Intel has the first Panther Lake SKU slated to ship before the end of the year, with broad market availability starting January 2026. The post Intel expands Panther Lake processor edge applications to robotics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585335",
      "title": "Robotics Summit 2026 call for speakers ends today",
      "url": "https://www.therobotreport.com/robotics-summit-2026-opens-call-for-speakers/",
      "publishedAt": "Fri, 10 Oct 2025 15:37:53 +0000",
      "summary": "The Robotics Summit &#038; Expo, the industry’s must-attend technical development event, returns to Boston in 2026 with deepened coverage, an expanded expo floor, and more. The post Robotics Summit 2026 call for speakers ends today appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.08049v2",
      "title": "A Survey of Process Reward Models: From Outcome Signals to Process\n  Supervisions for Large Language Models",
      "url": "http://arxiv.org/abs/2510.08049v2",
      "publishedAt": "2025-10-09T10:35:31Z",
      "summary": "Although Large Language Models (LLMs) exhibit advanced reasoning ability, conventional alignment remains largely dominated by outcome reward models (ORMs) that judge only final answers. Process Reward Models(PRMs) address this gap by evaluating and guiding reasoning at the step or trajectory level.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.00441v3",
      "title": "Seeing through Uncertainty: Robust Task-Oriented Optimization in Visual\n  Navigation",
      "url": "http://arxiv.org/abs/2510.00441v3",
      "publishedAt": "2025-10-01T02:48:28Z",
      "summary": "Visual navigation is a fundamental problem in embodied AI, yet practical deployments demand long-horizon planning capabilities to address multi-objective tasks. A major bottleneck is data scarcity: policies learned from limited data often overfit and fail to generalize OOD.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.22205v2",
      "title": "From Watch to Imagine: Steering Long-horizon Manipulation via Human\n  Demonstration and Future Envisionment",
      "url": "http://arxiv.org/abs/2509.22205v2",
      "publishedAt": "2025-09-26T11:16:56Z",
      "summary": "Generalizing to long-horizon manipulation tasks in a zero-shot setting remains a central challenge in robotics. Current multimodal foundation based approaches, despite their capabilities, typically fail to decompose high-level commands into executable action sequences from static visual input alone.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.21690v2",
      "title": "Towards Versatile Humanoid Table Tennis: Unified Reinforcement Learning\n  with Prediction Augmentation",
      "url": "http://arxiv.org/abs/2509.21690v2",
      "publishedAt": "2025-09-25T23:26:07Z",
      "summary": "Humanoid table tennis (TT) demands rapid perception, proactive whole-body motion, and agile footwork under strict timing -- capabilities that remain difficult for unified controllers. We propose a reinforcement learning framework that maps ball-position observations directly to whole-body joint commands for both arm striking and leg locomotion, strengthened by predictive signals and dense, physics-guided rewards.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.20648v2",
      "title": "Wonder Wins Ways: Curiosity-Driven Exploration through Multi-Agent\n  Contextual Calibration",
      "url": "http://arxiv.org/abs/2509.20648v2",
      "publishedAt": "2025-09-25T01:07:08Z",
      "summary": "Autonomous exploration in complex multi-agent reinforcement learning (MARL) with sparse rewards critically depends on providing agents with effective intrinsic motivation. While artificial curiosity offers a powerful self-supervised signal, it often confuses environmental stochasticity with meaningful novelty.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.12458v2",
      "title": "Neural 3D Object Reconstruction with Small-Scale Unmanned Aerial\n  Vehicles",
      "url": "http://arxiv.org/abs/2509.12458v2",
      "publishedAt": "2025-09-15T21:08:32Z",
      "summary": "Small Unmanned Aerial Vehicles (UAVs) exhibit immense potential for navigating indoor and hard-to-reach areas, yet their significant constraints in payload and autonomy have largely prevented their use for complex tasks like high-quality 3-Dimensional (3D) reconstruction.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2508.18898v3",
      "title": "Interpretable Decision-Making for End-to-End Autonomous Driving",
      "url": "http://arxiv.org/abs/2508.18898v3",
      "publishedAt": "2025-08-26T10:14:16Z",
      "summary": "Trustworthy AI is mandatory for the broad deployment of autonomous vehicles. Although end-to-end approaches derive control commands directly from raw data, interpreting these decisions remains challenging, especially in complex urban scenarios. This is mainly attributed to very deep neural networks with non-linear decision boundaries, making it challenging to grasp the logic behind AI-driven decisions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIA’s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI — the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world — is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.05186v2",
      "title": "Learning to See and Act: Task-Aware View Planning for Robotic\n  Manipulation",
      "url": "http://arxiv.org/abs/2508.05186v2",
      "publishedAt": "2025-08-07T09:21:20Z",
      "summary": "Recent vision-language-action (VLA) models for multi-task robotic manipulation commonly rely on static viewpoints and shared visual encoders, which limit 3D perception and cause task interference, hindering robustness and generalization.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82559",
      "title": "NVIDIA and Partners Highlight Next-Generation Robotics, Automation and AI Technologies at Automatica",
      "url": "https://blogs.nvidia.com/blog/automatica-robotics-2025/",
      "publishedAt": "Tue, 24 Jun 2025 09:00:30 +0000",
      "summary": "From the heart of Germany’s automotive sector to manufacturing hubs across France and Italy, Europe is embracing industrial AI and advanced AI-powered robotics to address labor shortages, boost productivity and fuel sustainable economic growth. Robotics companies are developing humanoid robots and collaborative systems that integrate AI into real-world manufacturing applications.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82396",
      "title": "Hexagon Taps NVIDIA Robotics and AI Software to Build and Deploy AEON, a New Humanoid",
      "url": "https://blogs.nvidia.com/blog/hexagon-robotics-ai-software-aeon-humanoid/",
      "publishedAt": "Tue, 17 Jun 2025 15:10:55 +0000",
      "summary": "As a global labor shortage leaves 50 million positions unfilled across industries like manufacturing and logistics, Hexagon — a global leader in measurement technologies — is developing humanoid robots that can lend a helping hand. Industrial sectors depend on skilled workers to perform a variety of error-prone tasks, including operating high-precision scanners for reality capture Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=82037",
      "title": "European Robot Makers Adopt NVIDIA Isaac, Omniverse and Halos to Develop Safe, Physical AI-Driven Robot Fleets",
      "url": "https://blogs.nvidia.com/blog/european-robot-makers-isaac-omniverse-halos-safe-physical-ai/",
      "publishedAt": "Wed, 11 Jun 2025 11:00:23 +0000",
      "summary": "In the face of growing labor shortages and need for sustainability, European manufacturers are racing to reinvent their processes to become software-defined and AI-driven. To achieve this, robot developers and industrial digitalization solution providers are working with NVIDIA to build safe, AI-driven robots and industrial technologies to drive modern, sustainable manufacturing. At NVIDIA GTC Paris Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82173",
      "title": "Germany Builds Its AI Autobahn With NVIDIA",
      "url": "https://blogs.nvidia.com/blog/germany-ai-factories/",
      "publishedAt": "Wed, 11 Jun 2025 10:25:33 +0000",
      "summary": "Germany is building on a long history of engineering innovation with new AI investments poised to transform the country’s economy — including the automotive, banking, manufacturing and robotics industries. The country is deploying tens of thousands of NVIDIA GPUs to power AI factories that generate intelligence for businesses and researchers, optimized AI software to run Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2506.09049v2",
      "title": "VIKI-R: Coordinating Embodied Multi-Agent Cooperation via Reinforcement\n  Learning",
      "url": "http://arxiv.org/abs/2506.09049v2",
      "publishedAt": "2025-06-10T17:59:44Z",
      "summary": "Coordinating multiple embodied agents in dynamic environments remains a core challenge in artificial intelligence, requiring both perception-driven reasoning and scalable cooperation strategies. While recent works have leveraged large language models (LLMs) for multi-agent planning, a few have begun to explore vision-language models (VLMs) for visual reasoning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM",
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=81193",
      "title": "Researchers and Students in Türkiye Build AI, Robotics Tools to Boost Disaster Readiness",
      "url": "https://blogs.nvidia.com/blog/turkiye-disaster-readiness-ai-robotics/",
      "publishedAt": "Mon, 02 Jun 2025 15:00:11 +0000",
      "summary": "Since a 7.8-magnitude earthquake hit Syria and Türkiye two years ago — leaving 55,000 people dead, 130,000 injured and millions displaced from their homes — students, researchers and developers have been harnessing the latest AI robotics technologies to increase disaster preparedness in the region. The work is part of a Disaster Response Innovation and Education Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3013274",
      "title": "Hugging Face unveils two new humanoid robots",
      "url": "https://techcrunch.com/2025/05/29/hugging-face-unveils-two-new-humanoid-robots/",
      "publishedAt": "Thu, 29 May 2025 19:28:24 +0000",
      "summary": "AI dev platform Hugging Face continued its push into robotics on Thursday with the release of two new humanoid robots.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.20749v2",
      "title": "Can Agents Fix Agent Issues?",
      "url": "http://arxiv.org/abs/2505.20749v2",
      "publishedAt": "2025-05-27T05:45:03Z",
      "summary": "LLM-based agent systems are emerging as a new software paradigm and have been widely adopted across diverse domains such as medicine, robotics, and programming. However, maintaining these systems requires substantial effort, as they are inevitably prone to bugs and continually evolve to meet changing external requirements.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "LLM"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3011215",
      "title": "Why Intempus thinks robots should have a human physiological state",
      "url": "https://techcrunch.com/2025/05/25/why-intempus-thinks-robots-should-have-a-human-physiological-state/",
      "publishedAt": "Sun, 25 May 2025 14:00:00 +0000",
      "summary": "Teddy Warner, 19, has always been interested in robotics. His family was in the industry, and he says he &#8220;grew up&#8221; working in a machinist shop while in high school. Now Warner is building a robotics company of his own, Intempus, that looks to make robots a bit more human. Intempus is building tech to [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3010629",
      "title": "Serve is betting that food delivery and access to public markets are the keys to scaling robotics",
      "url": "https://techcrunch.com/podcast/serve-is-betting-that-food-delivery-and-access-to-public-markets-are-the-keys-to-scaling-robotics/",
      "publishedAt": "Wed, 21 May 2025 20:20:53 +0000",
      "summary": "“The only thing worse than being a public company CEO is being a private company CEO right now,” says Ali Kashani, co-founder and CEO of Serve Robotics. Access to capital, he argues, is everything in robotics. And in today’s “FOMO-driven” venture climate, securing funds is far from guaranteed. Backed by Nvidia and Uber, Serve recently [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.13925v2",
      "title": "Time Reversal Symmetry for Efficient Robotic Manipulations in Deep\n  Reinforcement Learning",
      "url": "http://arxiv.org/abs/2505.13925v2",
      "publishedAt": "2025-05-20T04:40:49Z",
      "summary": "Symmetry is pervasive in robotics and has been widely exploited to improve sample efficiency in deep reinforcement learning (DRL). However, existing approaches primarily focus on spatial symmetries, such as reflection, rotation, and translation, while largely neglecting temporal symmetries.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80963",
      "title": "NVIDIA Research Breakthroughs Put Advanced Robots in Motion",
      "url": "https://blogs.nvidia.com/blog/nvidia-research-robotics-icra-2025/",
      "publishedAt": "Mon, 19 May 2025 15:00:53 +0000",
      "summary": "Across robot training and development, NVIDIA Research is uncovering breakthroughs in areas such as multimodal generative AI and synthetic data generation. The team’s latest innovations will be spotlighted at the International Conference on Robotics and Automation (ICRA), running May 19-23 in Atlanta. “ICRA has played a pivotal role in shaping the direction of robotics and Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80675",
      "title": "Foxconn Taps NVIDIA to Accelerate Physical and Digital Robotics for Global Healthcare Industry",
      "url": "https://blogs.nvidia.com/blog/foxconn-smart-hospital-robot/",
      "publishedAt": "Mon, 19 May 2025 04:50:42 +0000",
      "summary": "The world’s largest electronics manufacturer is building smart hospital solutions using NVIDIA technologies from the data center to the edge.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80740",
      "title": "That’s One Smart Hospital! Taiwan Medical Centers Deploy Life-Saving Innovations With NVIDIA System-Builder Partners",
      "url": "https://blogs.nvidia.com/blog/taiwan-medical-centers-system-builder-partners/",
      "publishedAt": "Mon, 19 May 2025 04:50:09 +0000",
      "summary": "Leading healthcare organizations across the globe are using agentic AI, robotics and digital twins of medical environments to enhance surgical precision, boost workflow efficiency, improve medical diagnoses and more. Physical AI and humanoid robots in hospitals have the potential to automate routine tasks, assist with patient care and address workforce shortages. This is especially crucial Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80491",
      "title": "NVIDIA Omniverse Digital Twins Help Taiwan Manufacturers Drive Golden Age of Industrial AI",
      "url": "https://blogs.nvidia.com/blog/omniverse-digital-twins-taiwan-manufacturers-physical-ai/",
      "publishedAt": "Mon, 19 May 2025 04:30:03 +0000",
      "summary": "NVIDIA and Taiwan’s manufacturing ecosystem, including Delta Electronics, Foxconn, TSMC and Wistron, are showcasing this week at COMPUTEX in Taipei the crucial role digital twins play in accelerating industrial AI. These electronics, semiconductor and robotics manufacturing leaders are using Universal Scene Description (OpenUSD) and NVIDIA Omniverse libraries and blueprints to develop physically based digital twins.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80499",
      "title": "NVIDIA Partners Showcase Cutting-Edge Robotic and Industrial AI Solutions at Automate 2025",
      "url": "https://blogs.nvidia.com/blog/robotics-industrial-ai-automate/",
      "publishedAt": "Tue, 13 May 2025 13:45:00 +0000",
      "summary": "As the manufacturing industry faces challenges — such as labor shortages, reshoring and inconsistent operational strategies — AI-powered robots present a significant opportunity to accelerate industrial automation. At Automate, the largest robotics and automation event in North America, robotics leaders KUKA, Standard Bots, Universal Robots (UR) and Vention are showcasing hardware and robots powered by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.08216v3",
      "title": "Rethink Repeatable Measures of Robot Performance with Statistical Query",
      "url": "http://arxiv.org/abs/2505.08216v3",
      "publishedAt": "2025-05-13T04:14:48Z",
      "summary": "For a general standardized testing algorithm designed to evaluate a specific aspect of a robot's performance, several key expectations are commonly imposed. Beyond accuracy (i.e., closeness to a typically unknown ground-truth reference) and efficiency (i.e., feasibility within acceptable testing costs and equipment constraints), one particularly important attribute is repeatability.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3004901",
      "title": "Amazon offers peek at new human jobs in an AI bot world",
      "url": "https://techcrunch.com/2025/05/11/amazon-offers-peek-at-new-human-jobs-in-an-ai-bot-world/",
      "publishedAt": "Sun, 11 May 2025 14:00:00 +0000",
      "summary": "The tech industry seems to have two thoughts when it comes to where human workers fit into the AI-powered world they are creating: Either they think that all the jobs, except perhaps their own, will be done by bots. (VC Marc Andreessen seems to think that his work as an investor could never be automated). [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=80269",
      "title": "Wandercraft Begins Clinical Trials for Physical AI-Powered Personal Exoskeleton",
      "url": "https://blogs.nvidia.com/blog/physical-ai-exoskeleton/",
      "publishedAt": "Thu, 01 May 2025 13:00:30 +0000",
      "summary": "For Nicolas Simon, advancing the field of robotics is a personal mission that could change his siblings’ lives. Two-thirds of Simon’s family members use wheelchairs due to mobility challenges related to Charcot-Marie-Tooth disease, an inherited genetic condition. As an engineering student and robotics club chair at France’s École Polytechnique, he saw the opportunity to build Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=79551",
      "title": "National Robotics Week — Latest Physical AI Research, Breakthroughs and Resources",
      "url": "https://blogs.nvidia.com/blog/national-robotics-week-2025/",
      "publishedAt": "Sat, 12 Apr 2025 16:00:05 +0000",
      "summary": "This National Robotics Week, NVIDIA highlighted the pioneering technologies that are shaping the future of intelligent machines and driving progress across manufacturing, healthcare, logistics and more. Advancements in robotics simulation and robot learning are driving this fundamental shift in the industry. Plus, the emergence of world foundation models is accelerating the evolution of AI-enabled robots Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2502.02175v2",
      "title": "VLA-Cache: Efficient Vision-Language-Action Manipulation via Adaptive\n  Token Caching",
      "url": "http://arxiv.org/abs/2502.02175v2",
      "publishedAt": "2025-02-04T09:48:14Z",
      "summary": "Vision-Language-Action (VLA) models have demonstrated strong multi-modal reasoning capabilities, enabling direct action generation from visual perception and language instructions in an end-to-end manner. However, their substantial computational cost poses a challenge for real-time robotic control, where rapid decision-making is essential.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2502.01546v2",
      "title": "Dynamic object goal pushing with mobile manipulators through model-free\n  constrained reinforcement learning",
      "url": "http://arxiv.org/abs/2502.01546v2",
      "publishedAt": "2025-02-03T17:28:35Z",
      "summary": "Non-prehensile pushing to move and reorient objects to a goal is a versatile loco-manipulation skill. In the real world, the object's physical properties and friction with the floor contain significant uncertainties, which makes the task challenging for a mobile manipulator.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2409.11972v2",
      "title": "Generation of Uncertainty-Aware Emergent Concepts in Factorized 3D Scene\n  Graphs via Graph Neural Networks",
      "url": "http://arxiv.org/abs/2409.11972v2",
      "publishedAt": "2024-09-18T13:24:44Z",
      "summary": "Enabling robots to autonomously discover emergent spatial concepts (e.g., rooms) from primitive geometric observations (e.g., planar surfaces) within 3D Scene Graphs is essential for robust indoor navigation and mapping. These graphs provide a hierarchical metric-semantic representation in which such concepts are organized.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2408.06843v4",
      "title": "Learn2Decompose: Learning Problem Decomposition for Efficient Sequential\n  Multi-object Manipulation Planning",
      "url": "http://arxiv.org/abs/2408.06843v4",
      "publishedAt": "2024-08-13T12:06:28Z",
      "summary": "We present an efficient task and motion replanning approach for sequential multi-object manipulation in dynamic environments. Conventional Task And Motion Planning (TAMP) solvers experience an exponential increase in planning time as the planning horizon and number of objects grow, limiting their applicability in real-world scenarios.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    }
  ]
}