{
  "generatedAt": "2025-12-17T06:07:47.522Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=586362",
      "title": "A look at iRobot’s 35-year robotics journey",
      "url": "https://www.therobotreport.com/a-look-at-irobot-35-year-robotics-journey/",
      "publishedAt": "Tue, 16 Dec 2025 22:14:45 +0000",
      "summary": "From disaster zones, to oil spills, to the Great Pyramids of Giza, iRobot has taken its robot everywhere in its 35 years. The post A look at iRobot’s 35-year robotics journey appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14696v1",
      "title": "CRISP: Contact-Guided Real2Sim from Monocular Video with Planar Scene Primitives",
      "url": "https://arxiv.org/abs/2512.14696v1",
      "publishedAt": "2025-12-16T18:59:50Z",
      "summary": "We introduce CRISP, a method that recovers simulatable human motion and scene geometry from monocular video. Prior work on joint human-scene reconstruction relies on data-driven priors and joint optimization with no physics in the loop, or recovers noisy geometry with artifacts that cause motion tracking policies with scene interactions to fail.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.14689v1",
      "title": "CHIP: Adaptive Compliance for Humanoid Control through Hindsight Perturbation",
      "url": "https://arxiv.org/abs/2512.14689v1",
      "publishedAt": "2025-12-16T18:56:04Z",
      "summary": "Recent progress in humanoid robots has unlocked agile locomotion skills, including backflipping, running, and crawling. Yet it remains challenging for a humanoid robot to perform forceful manipulation tasks such as moving objects, wiping, and pushing a cart.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14666v1",
      "title": "EVOLVE-VLA: Test-Time Training from Environment Feedback for Vision-Language-Action Models",
      "url": "https://arxiv.org/abs/2512.14666v1",
      "publishedAt": "2025-12-16T18:26:38Z",
      "summary": "Achieving truly adaptive embodied intelligence requires agents that learn not just by imitating static demonstrations, but by continuously improving through environmental interaction, which is akin to how humans master skills through practice.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586361",
      "title": "Lidar maker Luminar declares bankruptcy; Quantum Computing to buy subsidiary",
      "url": "https://www.therobotreport.com/lidar-maker-luminar-declares-bankruptcy-quantum-computing-buy-subsidiary/",
      "publishedAt": "Tue, 16 Dec 2025 17:05:08 +0000",
      "summary": "Lidar maker Luminar has filed for Chapter 11 and plans to sell off its assets after Volvo terminated a key contract. The post Lidar maker Luminar declares bankruptcy; Quantum Computing to buy subsidiary appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586360",
      "title": "Robotics industry reacts to iRobot&#8217;s bankruptcy",
      "url": "https://www.therobotreport.com/robotics-industry-reacts-to-irobot-bankruptcy/",
      "publishedAt": "Tue, 16 Dec 2025 17:02:51 +0000",
      "summary": "iRobot’s Chapter 11 bankruptcy has sparked intense reactions across the robotics industry, with opinions on the roles of regulation, innovation speed, manufacturing scale, and global competition. The post Robotics industry reacts to iRobot&#8217;s bankruptcy appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14450v1",
      "title": "Nonlinear System Identification Nano-drone Benchmark",
      "url": "https://arxiv.org/abs/2512.14450v1",
      "publishedAt": "2025-12-16T14:37:33Z",
      "summary": "We introduce a benchmark for system identification based on 75k real-world samples from the Crazyflie 2.1 Brushless nano-quadrotor, a sub-50g aerial vehicle widely adopted in robotics research. The platform presents a challenging testbed due to its multi-input, multi-output nature, open-loop instability, and nonlinear dynamics under agile maneuvers.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14442v1",
      "title": "A4-Agent: An Agentic Framework for Zero-Shot Affordance Reasoning",
      "url": "https://arxiv.org/abs/2512.14442v1",
      "publishedAt": "2025-12-16T14:27:47Z",
      "summary": "Affordance prediction, which identifies interaction regions on objects based on language instructions, is critical for embodied AI. Prevailing end-to-end models couple high-level reasoning and low-level grounding into a single monolithic pipeline and rely on training over annotated datasets, which leads to poor generalization on novel objects and unseen environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14434v1",
      "title": "Geometric Parameter Optimization of a Novel 3-(PP(2-(UPS))) Redundant Parallel Mechanism based on Workspace Determination",
      "url": "https://arxiv.org/abs/2512.14434v1",
      "publishedAt": "2025-12-16T14:22:13Z",
      "summary": "Redundant parallel robots are normally employed in scenarios requiring good precision, high load capability, and large workspace compared to traditional parallel mechanisms. However, the elementary robotic configuration and geometric parameter optimization are still quite challenging.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.14428v1",
      "title": "Odyssey: An Automotive Lidar-Inertial Odometry Dataset for GNSS-denied situations",
      "url": "https://arxiv.org/abs/2512.14428v1",
      "publishedAt": "2025-12-16T14:17:00Z",
      "summary": "The development and evaluation of Lidar-Inertial Odometry (LIO) and Simultaneous Localization and Mapping (SLAM) systems requires a precise ground truth. The Global Navigation Satellite System (GNSS) is often used as a foundation for this, but its signals can be unreliable in obstructed environments due to multi-path effects or loss-of-signal.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14426v1",
      "title": "Quadratic Kalman Filter for Elliptical Extended Object Tracking based on Decoupling State Components",
      "url": "https://arxiv.org/abs/2512.14426v1",
      "publishedAt": "2025-12-16T14:15:40Z",
      "summary": "Extended object tracking involves estimating both the physical extent and kinematic parameters of a target object, where typically multiple measurements are observed per time step. In this article, we propose a deterministic closed-form elliptical extended object tracker, based on decoupling of the kinematics, orientation, and axis lengths.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.14411v1",
      "title": "Synthetic Data Pipelines for Adaptive, Mission-Ready Militarized Humanoids",
      "url": "https://arxiv.org/abs/2512.14411v1",
      "publishedAt": "2025-12-16T13:54:34Z",
      "summary": "Omnia presents a synthetic data driven pipeline to accelerate the training, validation, and deployment readiness of militarized humanoids. The approach converts first-person spatial observations captured from point-of-view recordings, smart glasses, augmented reality headsets, and spatial browsing workflows into scalable, mission-specific synthetic datasets for humanoid autonomy.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586352",
      "title": "Serve Robotics has deployed 2,000+ delivery robots across the U.S.",
      "url": "https://www.therobotreport.com/serve-robotics-has-deployed-2000-delivery-robots-across-u-s/",
      "publishedAt": "Tue, 16 Dec 2025 13:30:54 +0000",
      "summary": "Since the start of the year, Serve Robotics has expanded its fleet of sidewalk delivery robots twentyfold. The post Serve Robotics has deployed 2,000+ delivery robots across the U.S. appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586353",
      "title": "BARA, the Bay Area Robotics Association, launches to accelerate embodied AI",
      "url": "https://www.therobotreport.com/bay-area-robotics-association-bara-launches-accelerate-embodied-ai/",
      "publishedAt": "Tue, 16 Dec 2025 13:15:45 +0000",
      "summary": "BARA said it intends to connect San Francisco Bay Area investors and startups to shape robotics and embodied AI. The post BARA, the Bay Area Robotics Association, launches to accelerate embodied AI appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14367v1",
      "title": "A Comprehensive Safety Metric to Evaluate Perception in Autonomous Systems",
      "url": "https://arxiv.org/abs/2512.14367v1",
      "publishedAt": "2025-12-16T12:53:00Z",
      "summary": "Complete perception of the environment and its correct interpretation is crucial for autonomous vehicles. Object perception is the main component of automotive surround sensing. Various metrics already exist for the evaluation of object perception.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14355v1",
      "title": "CoLD Fusion: A Real-time Capable Spline-based Fusion Algorithm for Collective Lane Detection",
      "url": "https://arxiv.org/abs/2512.14355v1",
      "publishedAt": "2025-12-16T12:34:17Z",
      "summary": "Comprehensive environment perception is essential for autonomous vehicles to operate safely. It is crucial to detect both dynamic road users and static objects like traffic signs or lanes as these are required for safe motion planning. However, in many circumstances a complete perception of other objects or lanes is not achievable due to limited sensor ranges, occlusions, and curves.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14350v1",
      "title": "Fine-Tuning of Neural Network Approximate MPC without Retraining via Bayesian Optimization",
      "url": "https://arxiv.org/abs/2512.14350v1",
      "publishedAt": "2025-12-16T12:24:08Z",
      "summary": "Approximate model-predictive control (AMPC) aims to imitate an MPC's behavior with a neural network, removing the need to solve an expensive optimization problem at runtime. However, during deployment, the parameters of the underlying MPC must usually be fine-tuned. This often renders AMPC impractical as it requires repeatedly generating a new dataset and retraining the neural network.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14349v1",
      "title": "A Geometric Task-Space Port-Hamiltonian Formulation for Redundant Manipulators",
      "url": "https://arxiv.org/abs/2512.14349v1",
      "publishedAt": "2025-12-16T12:24:07Z",
      "summary": "We present a novel geometric port-Hamiltonian formulation of redundant manipulators performing a differential kinematic task $η=J(q)\\dot{q}$, where $q$ is a point on the configuration manifold, $η$ is a velocity-like task space variable, and $J(q)$ is a linear map representing the task, for example the classical analytic or geometric manipulator Jacobian matrix.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.14340v1",
      "title": "Field evaluation and optimization of a lightweight lidar-based UAV navigation system for dense boreal forest environments",
      "url": "https://arxiv.org/abs/2512.14340v1",
      "publishedAt": "2025-12-16T12:08:12Z",
      "summary": "The interest in the usage of uncrewed aerial vehicles (UAVs) for forest applications has increased in recent years. While above-canopy flight has reached a high level of autonomy, navigating under-canopy remains a significant challenge. The use of autonomous UAVs could reduce the burden of data collection, which has motivated the development of numerous solutions for under-canopy autonomous flight.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.14331v1",
      "title": "ARCADE: Adaptive Robot Control with Online Changepoint-Aware Bayesian Dynamics Learning",
      "url": "https://arxiv.org/abs/2512.14331v1",
      "publishedAt": "2025-12-16T11:57:42Z",
      "summary": "Real-world robots must operate under evolving dynamics caused by changing operating conditions, external disturbances, and unmodeled effects. These may appear as gradual drifts, transient fluctuations, or abrupt shifts, demanding real-time adaptation that is robust to short-term variation yet responsive to lasting change.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14270v1",
      "title": "CaFe-TeleVision: A Coarse-to-Fine Teleoperation System with Immersive Situated Visualization for Enhanced Ergonomics",
      "url": "https://arxiv.org/abs/2512.14270v1",
      "publishedAt": "2025-12-16T10:25:58Z",
      "summary": "Teleoperation presents a promising paradigm for remote control and robot proprioceptive data collection. Despite recent progress, current teleoperation systems still suffer from limitations in efficiency and ergonomics, particularly in challenging scenarios. In this paper, we propose CaFe-TeleVision, a coarse-to-fine teleoperation system with immersive situated visualization for enhanced ergonomics.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14266v1",
      "title": "DriverGaze360: OmniDirectional Driver Attention with Object-Level Guidance",
      "url": "https://arxiv.org/abs/2512.14266v1",
      "publishedAt": "2025-12-16T10:23:00Z",
      "summary": "Predicting driver attention is a critical problem for developing explainable autonomous driving systems and understanding driver behavior in mixed human-autonomous vehicle traffic scenarios. Although significant progress has been made through large-scale driver attention datasets and deep learning architectures, existing works are constrained by narrow frontal field-of-view and limited driving diversity.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14225v1",
      "title": "OmniGen: Unified Multimodal Sensor Generation for Autonomous Driving",
      "url": "https://arxiv.org/abs/2512.14225v1",
      "publishedAt": "2025-12-16T09:18:15Z",
      "summary": "Autonomous driving has seen remarkable advancements, largely driven by extensive real-world data collection. However, acquiring diverse and corner-case data remains costly and inefficient. Generative models have emerged as a promising solution by synthesizing realistic sensor data.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14222v1",
      "title": "History-Enhanced Two-Stage Transformer for Aerial Vision-and-Language Navigation",
      "url": "https://arxiv.org/abs/2512.14222v1",
      "publishedAt": "2025-12-16T09:16:07Z",
      "summary": "Aerial Vision-and-Language Navigation (AVLN) requires Unmanned Aerial Vehicle (UAV) agents to localize targets in large-scale urban environments based on linguistic instructions. While successful navigation demands both global environmental reasoning and local scene comprehension, existing UAV agents typically adopt mono-granularity frameworks that struggle to balance these two aspects.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14217v1",
      "title": "DRAW2ACT: Turning Depth-Encoded Trajectories into Robotic Demonstration Videos",
      "url": "https://arxiv.org/abs/2512.14217v1",
      "publishedAt": "2025-12-16T09:11:36Z",
      "summary": "Video diffusion models provide powerful real-world simulators for embodied AI but remain limited in controllability for robotic manipulation. Recent works on trajectory-conditioned video generation address this gap but often rely on 2D trajectories or single modality conditioning, which restricts their ability to produce controllable and consistent robotic demonstrations.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14206v1",
      "title": "Trajectory Tracking for Multi-Manipulator Systems in Constrained Environments",
      "url": "https://arxiv.org/abs/2512.14206v1",
      "publishedAt": "2025-12-16T09:01:49Z",
      "summary": "We consider the problem of cooperative manipulation by a mobile multi-manipulator system operating in obstacle-cluttered and highly constrained environments under spatio-temporal task specifications. The task requires transporting a grasped object while respecting both continuous robot dynamics and discrete geometric constraints arising from obstacles and narrow passages.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14189v1",
      "title": "SUPER -- A Framework for Sensitivity-based Uncertainty-aware Performance and Risk Assessment in Visual Inertial Odometry",
      "url": "https://arxiv.org/abs/2512.14189v1",
      "publishedAt": "2025-12-16T08:35:47Z",
      "summary": "While many visual odometry (VO), visual-inertial odometry (VIO), and SLAM systems achieve high accuracy, the majority of existing methods miss to assess risks at runtime. This paper presents SUPER (Sensitivity-based Uncertainty-aware PErformance and Risk assessment) that is a generic and explainable framework that propagates uncertainties via sensitivities for real-time risk assessment in VIO.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14158v1",
      "title": "CIS-BA: Continuous Interaction Space Based Backdoor Attack for Object Detection in the Real-World",
      "url": "https://arxiv.org/abs/2512.14158v1",
      "publishedAt": "2025-12-16T07:37:46Z",
      "summary": "Object detection models deployed in real-world applications such as autonomous driving face serious threats from backdoor attacks. Despite their practical effectiveness,existing methods are inherently limited in both capability and robustness due to their dependence on single-trigger-single-object mappings and fragile pixel-level cues.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.14112v1",
      "title": "Optimizing Multi-Tier Supply Chain Ordering with a Hybrid Liquid Neural Network and Extreme Gradient Boosting Model",
      "url": "https://arxiv.org/abs/2512.14112v1",
      "publishedAt": "2025-12-16T05:54:06Z",
      "summary": "Supply chain management (SCM) faces significant challenges like demand fluctuations and the bullwhip effect. Traditional methods and even state-of-the-art LLMs struggle with benchmarks like the Vending Machine Test, failing to handle SCM's complex continuous time-series data. While ML approaches like LSTM and XGBoost offer solutions, they are often limited by computational inefficiency.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.14111v1",
      "title": "Interactive Motion Planning for Human-Robot Collaboration Based on Human-Centric Configuration Space Ergonomic Field",
      "url": "https://arxiv.org/abs/2512.14111v1",
      "publishedAt": "2025-12-16T05:46:38Z",
      "summary": "Industrial human-robot collaboration requires motion planning that is collision-free, responsive, and ergonomically safe to reduce fatigue and musculoskeletal risk. We propose the Configuration Space Ergonomic Field (CSEF), a continuous and differentiable field over the human joint space that quantifies ergonomic quality and provides gradients for real-time ergonomics-aware planning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.13636v2",
      "title": "MindDrive: A Vision-Language-Action Model for Autonomous Driving via Online Reinforcement Learning",
      "url": "https://arxiv.org/abs/2512.13636v2",
      "publishedAt": "2025-12-15T18:31:32Z",
      "summary": "Current Vision-Language-Action (VLA) paradigms in autonomous driving primarily rely on Imitation Learning (IL), which introduces inherent challenges such as distribution shift and causal confusion. Online Reinforcement Learning offers a promising pathway to address these issues through trial-and-error learning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "RL",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586347",
      "title": "iREX 2025: From programmed to perceptive",
      "url": "https://www.therobotreport.com/irex-2025-from-programmed-perceptive/",
      "publishedAt": "Mon, 15 Dec 2025 15:59:26 +0000",
      "summary": "iREX 2025 included Japanese and Chinese innovations and partnerships, as well as physical AI advances, says this strategic analysis. The post iREX 2025: From programmed to perceptive appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586344",
      "title": "iRobot to enter Chapter 11 and be acquired by Chinese creditor",
      "url": "https://www.therobotreport.com/irobot-to-enter-chapter-11-acquired-chinese-creditor/",
      "publishedAt": "Mon, 15 Dec 2025 13:40:40 +0000",
      "summary": "iRobot has begun bankruptcy proceedings under which its Chinese creditors will acquire the consumer robot company and continue the brand. The post iRobot to enter Chapter 11 and be acquired by Chinese creditor appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.13177v2",
      "title": "MMDrive: Interactive Scene Understanding Beyond Vision with Multi-representational Fusion",
      "url": "https://arxiv.org/abs/2512.13177v2",
      "publishedAt": "2025-12-15T10:37:59Z",
      "summary": "Vision-language models enable the understanding and reasoning of complex traffic scenarios through multi-source information fusion, establishing it as a core technology for autonomous driving.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586327",
      "title": "With AI, MIT researchers teach a robot to build furniture by just asking",
      "url": "https://www.therobotreport.com/mit-researchers-use-ai-teach-a-robot-build-furniture-just-asking/",
      "publishedAt": "Sun, 14 Dec 2025 13:30:05 +0000",
      "summary": "A team of MIT researchers created a speech-to-reality system that enables a robot to build furniture with just a simple request. The post With AI, MIT researchers teach a robot to build furniture by just asking appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586320",
      "title": "1X partners with EQT to roll out humanoids across its portfolio companies",
      "url": "https://www.therobotreport.com/1x-partners-with-eqt-to-roll-out-humanoids-across-its-portfolio-companies/",
      "publishedAt": "Sat, 13 Dec 2025 13:35:57 +0000",
      "summary": "The companies intend to roll out up to 10,000 of 1X's humanoid robots across EQT's global portfolio of companies between 2026 and 2030. The post 1X partners with EQT to roll out humanoids across its portfolio companies appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.12012v2",
      "title": "Semantic-Drive: Democratizing Long-Tail Data Curation via Open-Vocabulary Grounding and Neuro-Symbolic VLM Consensus",
      "url": "https://arxiv.org/abs/2512.12012v2",
      "publishedAt": "2025-12-12T20:07:04Z",
      "summary": "The development of robust Autonomous Vehicles (AVs) is bottlenecked by the scarcity of \"Long-Tail\" training data. While fleets collect petabytes of video logs, identifying rare safety-critical events (e.g., erratic jaywalking, construction diversions) remains a manual, cost-prohibitive process.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586338",
      "title": "Union Park acquires GAM, launches precision motion control platform",
      "url": "https://www.therobotreport.com/union-park-acquires-gam-launches-precision-motion-control-platform/",
      "publishedAt": "Fri, 12 Dec 2025 19:53:20 +0000",
      "summary": "This acquisition marks the launch of Union Park’s new precision motion control platform, positioning the firm to capitalize on growth in industrial automation and robotics. The post Union Park acquires GAM, launches precision motion control platform appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586311",
      "title": "Teradyne Robotics leaning into U.S. manufacturing reboot",
      "url": "https://www.therobotreport.com/teradyne-robotics-leaning-into-u-s-manufacturing-reboot/",
      "publishedAt": "Fri, 12 Dec 2025 19:26:06 +0000",
      "summary": "Teradyne Robotics plans to open its U.S. headquarters near Detroit in 2026 to boost manufacturing for UR and MiR and better serve customers. The post Teradyne Robotics leaning into U.S. manufacturing reboot appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586315",
      "title": "A national robotics strategy is necessary to reshore manufacturing, says the Congressional Robotics Caucus",
      "url": "https://www.therobotreport.com/national-robotics-strategy-needed-reshore-manufacturing-says-congressional-robotics-caucus/",
      "publishedAt": "Fri, 12 Dec 2025 18:39:37 +0000",
      "summary": "The Congressional Robotics Caucus says a unified strategy is needed for U.S. economic and military competitiveness. The post A national robotics strategy is necessary to reshore manufacturing, says the Congressional Robotics Caucus appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88276",
      "title": "Cheers to AI: ADAM Robot Bartender Makes Drinks at Vegas Golden Knights Game",
      "url": "https://blogs.nvidia.com/blog/adam-robot-vegas-golden-knights-thor/",
      "publishedAt": "Fri, 12 Dec 2025 16:00:04 +0000",
      "summary": "In Las Vegas’s T-Mobile Arena, fans of the Golden Knights are getting more than just hockey — they’re getting a taste of the future. ADAM, a robot developed with NVIDIA Isaac libraries, is pouring drinks and turning heads in one of the NHL’s most exciting venues. ADAM, short for Automated Dual Arm Mixologist, was developed Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586321",
      "title": "Zebra Technologies winding down Fetch-based mobile robot group",
      "url": "https://www.therobotreport.com/zebra-technologies-winding-down-fetch-based-mobile-robot-group/",
      "publishedAt": "Fri, 12 Dec 2025 14:19:34 +0000",
      "summary": "Zebra said the move allows it to 'further sharpen our strategic focus on digitizing and automating frontline workflows and on our investments in key growth areas.' The post Zebra Technologies winding down Fetch-based mobile robot group appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.11472v2",
      "title": "Mirror Skin: In Situ Visualization of Robot Touch Intent on Robotic Skin",
      "url": "https://arxiv.org/abs/2512.11472v2",
      "publishedAt": "2025-12-12T11:16:26Z",
      "summary": "Effective communication of robotic touch intent is a key factor in promoting safe and predictable physical human-robot interaction (pHRI). While intent communication has been widely studied, existing approaches lack the spatial specificity and semantic depth necessary to convey robot touch actions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3075424",
      "title": "1X struck a deal to send its &#8216;home&#8217; humanoids to factories and warehouses",
      "url": "https://techcrunch.com/2025/12/11/1x-struck-a-deal-to-send-its-home-humanoids-to-factories-and-warehouses/",
      "publishedAt": "Thu, 11 Dec 2025 22:03:36 +0000",
      "summary": "Despite launching as a humanoid robot designed to help consumers around the house, 1X's Neo robots are heading to industrial use cases.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586317",
      "title": "Helm.ai releases new architectural framework for autonomous vehicles",
      "url": "https://www.therobotreport.com/helm-ai-releases-new-architectural-framework-for-autonomous-vehicles/",
      "publishedAt": "Thu, 11 Dec 2025 20:35:03 +0000",
      "summary": "Helm.ai said the architecture enables automakers to deploy ADAS through L4 capabilities using their existing development fleets. The post Helm.ai releases new architectural framework for autonomous vehicles appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586242",
      "title": "Transforming solar farms: AI, robotics, and industry partnerships at AES",
      "url": "https://www.therobotreport.com/transforming-solar-farms-ai-robotics-and-industry-partnerships-at-aes/",
      "publishedAt": "Thu, 11 Dec 2025 17:00:59 +0000",
      "summary": "AES discusses deploying Maximo robotics to automate solar farm construction, enhancing efficiency, safety, and scalability in clean energy projects. The post Transforming solar farms: AI, robotics, and industry partnerships at AES appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88078",
      "title": "Robots’ Holiday Wishes Come True: NVIDIA Jetson Platform Offers High-Performance Edge AI at Festive Prices",
      "url": "https://blogs.nvidia.com/blog/jetson-edge-ai-holiday-2025/",
      "publishedAt": "Thu, 04 Dec 2025 16:00:07 +0000",
      "summary": "Editor’s note: This blog has been updated to showcase additional recent innovations tapping into the NVIDIA Jetson platform. Developers, researchers, hobbyists and students can take a byte out of holiday shopping this season as NVIDIA has unwrapped special discounts on the NVIDIA Jetson family of developer kits for edge AI and robotics — available through Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87946",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "publishedAt": "Tue, 02 Dec 2025 16:00:27 +0000",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87911",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "publishedAt": "Mon, 01 Dec 2025 17:00:48 +0000",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3069331",
      "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
      "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/",
      "publishedAt": "Thu, 20 Nov 2025 18:00:01 +0000",
      "summary": "Point One Navigation, now valued at $230 million, is building out well beyond automotive.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87636",
      "title": "Powering AI Superfactories, NVIDIA and Microsoft Integrate Latest Technologies for Inference, Cybersecurity, Physical AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-microsoft-ai-superfactories/",
      "publishedAt": "Tue, 18 Nov 2025 20:00:22 +0000",
      "summary": "Timed with the Microsoft Ignite conference running this week, NVIDIA is expanding its collaboration with Microsoft, including through the adoption of next-generation NVIDIA Spectrum-X Ethernet switches for the new Microsoft Fairwater AI superfactory, powered by the NVIDIA Blackwell platform. The collaboration brings new integrations across Microsoft 365 Copilot, as well as the public preview of Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87325",
      "title": "AI On: 3 Ways to Bring Agentic AI to Computer Vision Applications",
      "url": "https://blogs.nvidia.com/blog/ways-to-bring-agentic-ai-to-computer-vision-applications/",
      "publishedAt": "Thu, 13 Nov 2025 18:50:06 +0000",
      "summary": "Editor’s note: This post is part of the AI On blog series, which explores the latest techniques and real-world applications of agentic AI, chatbots and copilots. The series also highlights the NVIDIA software and hardware powering advanced AI agents, which form the foundation of AI query engines that gather insights and perform tasks to transform Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3066690",
      "title": "Why a researcher is building robots that look and act like bats",
      "url": "https://techcrunch.com/2025/11/12/why-a-researcher-is-building-robots-that-look-and-act-like-bats/",
      "publishedAt": "Wed, 12 Nov 2025 17:12:07 +0000",
      "summary": "These palm-sized robots use ultrasound signals to navigate harsh conditions in search and rescue missions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot – and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models — which power robots, autonomous vehicles and other intelligent machines — must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on What’s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness 🔗 A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment can’t be limited to a few urban tech hubs — it must reach every community, university and state. That’s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology — contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86265",
      "title": "NVIDIA Contributes to Open Frameworks for Next-Generation Robotics Development",
      "url": "https://blogs.nvidia.com/blog/roscon-2025-open-framework-robotics/",
      "publishedAt": "Mon, 27 Oct 2025 00:00:55 +0000",
      "summary": "This year’s ROSCon conference heads to Singapore, bringing together the global robotics developer community behind Robot Operating System (ROS) — the world’s most widely adopted open framework for building robots. At the conference, running through Wednesday, Oct. 29, NVIDIA announced collaborations with partners and the Open Source Robotics Alliance (OSRA), as well as new robotics Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.10353v4",
      "title": "Data-fused MPC with Guarantees: Application to Flying Humanoid Robots",
      "url": "https://arxiv.org/abs/2509.10353v4",
      "publishedAt": "2025-09-12T15:42:23Z",
      "summary": "This paper introduces a Data-Fused Model Predictive Control (DFMPC) framework that combines physics-based models with data-driven representations of unknown dynamics. Leveraging Willems' Fundamental Lemma and an artificial equilibrium formulation, the method enables tracking of changing, potentially unreachable setpoints while explicitly handling measurement noise through slack variables and regularization.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIA’s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI — the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world — is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2506.14831v2",
      "title": "Recent Advances in Multi-Agent Human Trajectory Prediction: A Comprehensive Review",
      "url": "https://arxiv.org/abs/2506.14831v2",
      "publishedAt": "2025-06-13T23:03:43Z",
      "summary": "With the emergence of powerful data-driven methods in human trajectory prediction (HTP), gaining a finer understanding of multi-agent interactions lies within hand's reach, with important implications in areas such as social robot navigation, autonomous navigation, and crowd modeling.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.05638v2",
      "title": "Closing the Loop: Motion Prediction Models beyond Open-Loop Benchmarks",
      "url": "https://arxiv.org/abs/2505.05638v2",
      "publishedAt": "2025-05-08T20:38:49Z",
      "summary": "Fueled by motion prediction competitions and benchmarks, recent years have seen the emergence of increasingly large learning based prediction models, many with millions of parameters, focused on improving open-loop prediction accuracy by mere centimeters. However, these benchmarks fail to assess whether such improvements translate to better performance when integrated into an autonomous driving stack.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2503.09143v2",
      "title": "Exo2Ego: Exocentric Knowledge Guided MLLM for Egocentric Video Understanding",
      "url": "https://arxiv.org/abs/2503.09143v2",
      "publishedAt": "2025-03-12T08:10:33Z",
      "summary": "AI personal assistants, deployed through robots or wearables, require embodied understanding to collaborate effectively with humans. However, current Multimodal Large Language Models (MLLMs) primarily focus on third-person (exocentric) vision, overlooking the unique challenges of first-person (egocentric) videos. Additionally, high acquisition costs limit data size, impairing MLLM performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2407.07740v2",
      "title": "LSM: A Comprehensive Metric for Assessing the Safety of Lane Detection Systems in Autonomous Driving",
      "url": "https://arxiv.org/abs/2407.07740v2",
      "publishedAt": "2024-07-10T15:11:37Z",
      "summary": "Comprehensive perception of the vehicle's environment and correct interpretation of the environment are crucial for the safe operation of autonomous vehicles. The perception of surrounding objects is the main component for further tasks such as trajectory planning. However, safe trajectory planning requires not only object detection, but also the detection of drivable areas and lane corridors.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2309.05632v3",
      "title": "MAPS$^2$: Multi-Robot Autonomous Motion Planning under Signal Temporal Logic Specifications",
      "url": "https://arxiv.org/abs/2309.05632v3",
      "publishedAt": "2023-09-11T17:25:08Z",
      "summary": "This article presents MAPS$^2$ : a distributed algorithm that allows multi-robot systems to deliver coupled tasks expressed as Signal Temporal Logic (STL) constraints.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    }
  ]
}