{
  "generatedAt": "2026-01-31T00:23:31.220Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=586827",
      "title": "First patient enrolls in clinical trial for Wandercraft Atalante X exoskeleton",
      "url": "https://www.therobotreport.com/first-patient-enrolls-clinical-trial-wandercraft-atalante-x-exoskeleton/",
      "publishedAt": "Fri, 30 Jan 2026 19:55:12 +0000",
      "summary": "Wandercraft's Atalante X robotic exoskeleton, which is already in use in rehabilitation centers worldwide, is being tested for ICU use. The post First patient enrolls in clinical trial for Wandercraft Atalante X exoskeleton appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586814",
      "title": "New York Robotics launches with 160 startups in its ecosystem",
      "url": "https://www.therobotreport.com/new-york-robotics-launches-160-startups-ecosystem/",
      "publishedAt": "Fri, 30 Jan 2026 14:53:08 +0000",
      "summary": "New York Robotics is launching with more than 80 industry partners, 20 academic partners, 40 robotics labs, and over 300 venture capital partners. The post New York Robotics launches with 160 startups in its ecosystem appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586820",
      "title": "Webinar examines evolving automated storage and retrieval systems",
      "url": "https://www.therobotreport.com/webinar-examines-evolving-automated-storage-and-retrieval-systems/",
      "publishedAt": "Fri, 30 Jan 2026 13:45:29 +0000",
      "summary": "Automated storage and retrieval systems offer efficiency, and AI and robotic shuttles are expanding their capabilities. The post Webinar examines evolving automated storage and retrieval systems appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.22153v1",
      "title": "DynamicVLA: A Vision-Language-Action Model for Dynamic Object Manipulation",
      "url": "https://arxiv.org/abs/2601.22153v1",
      "publishedAt": "2026-01-29T18:59:51Z",
      "summary": "Manipulating dynamic objects remains an open challenge for Vision-Language-Action (VLA) models, which, despite strong generalization in static manipulation, struggle in dynamic scenarios requiring rapid perception, temporal anticipation, and continuous control.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586811",
      "title": "RobCo raises Series C funding to scale industrial automation",
      "url": "https://www.therobotreport.com/robco-raises-100m-scale-industrial-automation/",
      "publishedAt": "Thu, 29 Jan 2026 18:42:52 +0000",
      "summary": "RobCo plans to use the new capital to continue developing its physical AI systems and expand enterprise deployments in the U.S. and Europe. The post RobCo raises Series C funding to scale industrial automation appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.22090v1",
      "title": "ReactEMG Stroke: Healthy-to-Stroke Few-shot Adaptation for sEMG-Based Intent Detection",
      "url": "https://arxiv.org/abs/2601.22090v1",
      "publishedAt": "2026-01-29T18:26:51Z",
      "summary": "Surface electromyography (sEMG) is a promising control signal for assist-as-needed hand rehabilitation after stroke, but detecting intent from paretic muscles often requires lengthy, subject-specific calibration and remains brittle to variability.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2601.22074v1",
      "title": "mjlab: A Lightweight Framework for GPU-Accelerated Robot Learning",
      "url": "https://arxiv.org/abs/2601.22074v1",
      "publishedAt": "2026-01-29T18:11:26Z",
      "summary": "We present mjlab, a lightweight, open-source framework for robot learning that combines GPU-accelerated simulation with composable environments and minimal setup friction. mjlab adopts the manager-based API introduced by Isaac Lab, where users compose modular building blocks for observations, rewards, and events, and pairs it with MuJoCo Warp for GPU-accelerated physics.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.22057v1",
      "title": "Unsupervised Decomposition and Recombination with Discriminator-Driven Diffusion Models",
      "url": "https://arxiv.org/abs/2601.22057v1",
      "publishedAt": "2026-01-29T17:57:06Z",
      "summary": "Decomposing complex data into factorized representations can reveal reusable components and enable synthesizing new samples via component recombination. We investigate this in the context of diffusion-based models that learn factorized latent spaces without factor-level supervision.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.22046v1",
      "title": "PLANING: A Loosely Coupled Triangle-Gaussian Framework for Streaming 3D Reconstruction",
      "url": "https://arxiv.org/abs/2601.22046v1",
      "publishedAt": "2026-01-29T17:47:26Z",
      "summary": "Streaming reconstruction from monocular image sequences remains challenging, as existing methods typically favor either high-quality rendering or accurate geometry, but rarely both.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2601.22032v1",
      "title": "Drive-JEPA: Video JEPA Meets Multimodal Trajectory Distillation for End-to-End Driving",
      "url": "https://arxiv.org/abs/2601.22032v1",
      "publishedAt": "2026-01-29T17:39:20Z",
      "summary": "End-to-end autonomous driving increasingly leverages self-supervised video pretraining to learn transferable planning representations. However, pretraining video world models for scene understanding has so far brought only limited improvements.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586808",
      "title": "NHTSA to investigate Waymo after an AV hit a child near a Santa Monica school",
      "url": "https://www.therobotreport.com/nhtsa-investigates-waymo-autonomous-vehicle-hit-child-near-santa-monica-school/",
      "publishedAt": "Thu, 29 Jan 2026 17:38:04 +0000",
      "summary": "After its autonomous vehicle struck the child, Waymo said she sustained minor injuries, stood up immediately, and walked to the sidewalk. The post NHTSA to investigate Waymo after an AV hit a child near a Santa Monica school appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.22018v1",
      "title": "PocketDP3: Efficient Pocket-Scale 3D Visuomotor Policy",
      "url": "https://arxiv.org/abs/2601.22018v1",
      "publishedAt": "2026-01-29T17:23:25Z",
      "summary": "Recently, 3D vision-based diffusion policies have shown strong capability in learning complex robotic manipulation skills. However, a common architectural mismatch exists in these models: a tiny yet efficient point-cloud encoder is often paired with a massive decoder. Given a compact scene representation, we argue that this may lead to substantial parameter waste in the decoder.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21998v1",
      "title": "Causal World Modeling for Robot Control",
      "url": "https://arxiv.org/abs/2601.21998v1",
      "publishedAt": "2026-01-29T17:07:43Z",
      "summary": "This work highlights that video world modeling, alongside vision-language pre-training, establishes a fresh and independent foundation for robot learning. Intuitively, video world models provide the ability to imagine the near future by understanding the causality between actions and visual dynamics.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21988v1",
      "title": "Generalized Information Gathering Under Dynamics Uncertainty",
      "url": "https://arxiv.org/abs/2601.21988v1",
      "publishedAt": "2026-01-29T17:00:35Z",
      "summary": "An agent operating in an unknown dynamical system must learn its dynamics from observations. Active information gathering accelerates this learning, but existing methods derive bespoke costs for specific modeling choices: dynamics models, belief update procedures, observation models, and planners.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=89488",
      "title": "Into the Omniverse: Physical AI Open Models and Frameworks Advance Robots and Autonomous Systems",
      "url": "https://blogs.nvidia.com/blog/physical-ai-open-models-robot-autonomous-systems-omniverse/",
      "publishedAt": "Thu, 29 Jan 2026 17:00:21 +0000",
      "summary": "Open source has become essential for driving innovation in robotics and autonomy. By providing access to critical infrastructure — from simulation frameworks to AI models — NVIDIA is enabling collaborative development that accelerates the path to safer, more capable autonomous systems.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21976v1",
      "title": "Macro-Scale Electrostatic Origami Motor",
      "url": "https://arxiv.org/abs/2601.21976v1",
      "publishedAt": "2026-01-29T16:53:24Z",
      "summary": "Foldable robots have been an active area of robotics research due to their high volume-to-mass ratio, easy packability, and shape adaptability. For locomotion, previously developed foldable robots have either embedded linear actuators in, or attached non-folding rotary motors to, their structure.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21971v1",
      "title": "MoE-ACT: Improving Surgical Imitation Learning Policies through Supervised Mixture-of-Experts",
      "url": "https://arxiv.org/abs/2601.21971v1",
      "publishedAt": "2026-01-29T16:50:14Z",
      "summary": "Imitation learning has achieved remarkable success in robotic manipulation, yet its application to surgical robotics remains challenging due to data scarcity, constrained workspaces, and the need for an exceptional level of safety and predictability.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21926v1",
      "title": "Information Filtering via Variational Regularization for Robot Manipulation",
      "url": "https://arxiv.org/abs/2601.21926v1",
      "publishedAt": "2026-01-29T16:17:42Z",
      "summary": "Diffusion-based visuomotor policies built on 3D visual representations have achieved strong performance in learning complex robotic skills. However, most existing methods employ an oversized denoising decoder. While increasing model capacity can improve denoising, empirical evidence suggests that it also introduces redundancy and noise in intermediate feature blocks.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21915v1",
      "title": "VideoAesBench: Benchmarking the Video Aesthetics Perception Capabilities of Large Multimodal Models",
      "url": "https://arxiv.org/abs/2601.21915v1",
      "publishedAt": "2026-01-29T16:06:30Z",
      "summary": "Large multimodal models (LMMs) have demonstrated outstanding capabilities in various visual perception tasks, which has in turn made the evaluation of LMMs significant. However, the capability of video aesthetic quality assessment, which is a fundamental ability for human, remains underexplored for LMMs.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21884v1",
      "title": "Multi-Modular MANTA-RAY: A Modular Soft Surface Platform for Distributed Multi-Object Manipulation",
      "url": "https://arxiv.org/abs/2601.21884v1",
      "publishedAt": "2026-01-29T15:46:50Z",
      "summary": "Manipulation surfaces control objects by actively deforming their shape rather than directly grasping them. While dense actuator arrays can generate complex deformations, they also introduce high degrees of freedom (DOF), increasing system complexity and limiting scalability.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2601.21876v1",
      "title": "LLM-Driven Scenario-Aware Planning for Autonomous Driving",
      "url": "https://arxiv.org/abs/2601.21876v1",
      "publishedAt": "2026-01-29T15:42:13Z",
      "summary": "Hybrid planner switching framework (HPSF) for autonomous driving needs to reconcile high-speed driving efficiency with safe maneuvering in dense traffic. Existing HPSF methods often fail to make reliable mode transitions or sustain efficient driving in congested environments, owing to heuristic scene recognition and low-frequency control updates.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21845v1",
      "title": "Constrained Meta Reinforcement Learning with Provable Test-Time Safety",
      "url": "https://arxiv.org/abs/2601.21845v1",
      "publishedAt": "2026-01-29T15:21:37Z",
      "summary": "Meta reinforcement learning (RL) allows agents to leverage experience across a distribution of tasks on which the agent can train at will, enabling faster learning of optimal policies on new test tasks. Despite its success in improving sample complexity on test tasks, many real-world applications, such as robotics and healthcare, impose safety constraints during testing.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586805",
      "title": "ABB Robotics seeks to standardize measurement of robot energy consumption",
      "url": "https://www.therobotreport.com/abb-robotics-standardizes-measurement-robot-energy-consumption/",
      "publishedAt": "Thu, 29 Jan 2026 15:16:28 +0000",
      "summary": "ABB Robotics said new energy consumption measurement will allow end users to make more informed decisions and support sustainability efforts. The post ABB Robotics seeks to standardize measurement of robot energy consumption appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21829v1",
      "title": "GAZELOAD A Multimodal Eye-Tracking Dataset for Mental Workload in Industrial Human-Robot Collaboration",
      "url": "https://arxiv.org/abs/2601.21829v1",
      "publishedAt": "2026-01-29T15:12:58Z",
      "summary": "This article describes GAZELOAD, a multimodal dataset for mental workload estimation in industrial human-robot collaboration. The data were collected in a laboratory assembly testbed where 26 participants interacted with two collaborative robots (UR5 and Franka Emika Panda) while wearing Meta ARIA smart glasses.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21772v1",
      "title": "Flocking behavior for dynamic and complex swarm structures",
      "url": "https://arxiv.org/abs/2601.21772v1",
      "publishedAt": "2026-01-29T14:22:53Z",
      "summary": "Maintaining the formation of complex structures with multiple UAVs and achieving complex trajectories remains a major challenge. This work presents an algorithm for implementing the flocking behavior of UAVs based on the concept of Virtual Centroid to easily develop a structure for the flock.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2601.21713v1",
      "title": "Disentangling perception and reasoning for improving data efficiency in learning cloth manipulation without demonstrations",
      "url": "https://arxiv.org/abs/2601.21713v1",
      "publishedAt": "2026-01-29T13:41:35Z",
      "summary": "Cloth manipulation is a ubiquitous task in everyday life, but it remains an open challenge for robotics. The difficulties in developing cloth manipulation policies are attributed to the high-dimensional state space, complex dynamics, and high propensity to self-occlusion exhibited by fabrics.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21712v1",
      "title": "CoFreeVLA: Collision-Free Dual-Arm Manipulation via Vision-Language-Action Model and Risk Estimation",
      "url": "https://arxiv.org/abs/2601.21712v1",
      "publishedAt": "2026-01-29T13:40:46Z",
      "summary": "Vision Language Action (VLA) models enable instruction following manipulation, yet dualarm deployment remains unsafe due to under modeled selfcollisions between arms and grasped objects. We introduce CoFreeVLA, which augments an endtoend VLA with a short horizon selfcollision risk estimator that predicts collision likelihood from proprioception, visual embeddings, and planned actions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586784",
      "title": "9 weeks to 9 days: How autonomous drilling is transforming data center construction",
      "url": "https://www.therobotreport.com/dewalt-drilling-robot/",
      "publishedAt": "Thu, 29 Jan 2026 13:30:36 +0000",
      "summary": "DEWALT and August Robotics launched an autonomous drilling robot to accelerate concrete floor preparation for data centers. The post 9 weeks to 9 days: How autonomous drilling is transforming data center construction appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586799",
      "title": "OnRobot to share automation roadmap advice in Dallas",
      "url": "https://www.therobotreport.com/onrobot-share-automation-roadmap-advice-in-dallas/",
      "publishedAt": "Thu, 29 Jan 2026 13:25:35 +0000",
      "summary": "OnRobot and FANUC will demonstrate common applications for automation to help manufacturers in North Texas. The post OnRobot to share automation roadmap advice in Dallas appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.21667v1",
      "title": "From Instruction to Event: Sound-Triggered Mobile Manipulation",
      "url": "https://arxiv.org/abs/2601.21667v1",
      "publishedAt": "2026-01-29T13:02:10Z",
      "summary": "Current mobile manipulation research predominantly follows an instruction-driven paradigm, where agents rely on predefined textual commands to execute tasks. However, this setting confines agents to a passive role, limiting their autonomy and ability to react to dynamic environmental events.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2601.21602v1",
      "title": "AIR-VLA: Vision-Language-Action Systems for Aerial Manipulation",
      "url": "https://arxiv.org/abs/2601.21602v1",
      "publishedAt": "2026-01-29T12:09:00Z",
      "summary": "While Vision-Language-Action (VLA) models have achieved remarkable success in ground-based embodied intelligence, their application to Aerial Manipulation Systems (AMS) remains a largely unexplored frontier.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586786",
      "title": "Gartner predicts fewer than 20 companies will deploy humanoids at scale by 2028",
      "url": "https://www.therobotreport.com/gartner-predicts-fewer-than-20-companies-will-deploy-humanoids-at-scale-by-2028/",
      "publishedAt": "Wed, 28 Jan 2026 21:31:40 +0000",
      "summary": "Gartner says that relatively few humanoid robot developers will progress proofs of concept beyond experimentation. The post Gartner predicts fewer than 20 companies will deploy humanoids at scale by 2028 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586777",
      "title": "Introducing Sprout, a new humanoid development platform",
      "url": "https://www.therobotreport.com/introducing-sprout-a-new-humanoid-development-platform/",
      "publishedAt": "Wed, 28 Jan 2026 20:06:17 +0000",
      "summary": "Fauna Robotics unveils Sprout: a safe, character-driven robot designed to live, work, and play alongside humans in everyday life. The post Introducing Sprout, a new humanoid development platform appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586785",
      "title": "Waabi raises $1B to advance autonomous trucks and robotaxis",
      "url": "https://www.therobotreport.com/waabi-raises-1b-to-advance-autonomous-trucks-and-robotaxis/",
      "publishedAt": "Wed, 28 Jan 2026 16:30:03 +0000",
      "summary": "Waabi plans to apply its Physical AI Platform developed for autonomous trucks to robotaxis with Uber. The post Waabi raises $1B to advance autonomous trucks and robotaxis appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586774",
      "title": "Robotiq brings sense of touch to physical AI with fingertips for 2F grippers",
      "url": "https://www.therobotreport.com/robotiq-brings-sense-touch-physical-ai-fingertips-2f-grippers/",
      "publishedAt": "Tue, 27 Jan 2026 15:44:03 +0000",
      "summary": "Robotiq says it has combined adaptive gripping with high-frequency tactile sensing, enabling robots to generalize across objects. The post Robotiq brings sense of touch to physical AI with fingertips for 2F grippers appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586767",
      "title": "Big robot on campus: Starship finds 97% student approval rating",
      "url": "https://www.therobotreport.com/big-robot-campus-starship-finds-97-student-approval-rating/",
      "publishedAt": "Tue, 27 Jan 2026 14:01:02 +0000",
      "summary": "As delivery robots become more common on campus, they are finding wide acceptance, found a Starship survey. The post Big robot on campus: Starship finds 97% student approval rating appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586763",
      "title": "Multiply Labs partners with AstraZeneca to automate cell therapy manufacturing",
      "url": "https://www.therobotreport.com/multiply-labs-partners-astrazeneca-automate-cell-therapy-manufacturing/",
      "publishedAt": "Tue, 27 Jan 2026 14:00:53 +0000",
      "summary": "Multiply Labs' goal is to enable scalable, high-throughput manufacturing while maintaining rigorous quality and regulatory standards. The post Multiply Labs partners with AstraZeneca to automate cell therapy manufacturing appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586771",
      "title": "Vention raises $110M to accelerate physical AI deployments in manufacturing",
      "url": "https://www.therobotreport.com/vention-raises-110m-to-accelerate-physical-ai-deployments-in-manufacturing/",
      "publishedAt": "Tue, 27 Jan 2026 12:01:41 +0000",
      "summary": "Vention has raised Series D funding to continue commercializing its robot control platform and expand into Europe. The post Vention raises $110M to accelerate physical AI deployments in manufacturing appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.18537v2",
      "title": "SKETCH: Semantic Key-Point Conditioning for Long-Horizon Vessel Trajectory Prediction",
      "url": "https://arxiv.org/abs/2601.18537v2",
      "publishedAt": "2026-01-26T14:42:31Z",
      "summary": "Accurate long-horizon vessel trajectory prediction remains challenging due to compounded uncertainty from complex navigation behaviors and environmental factors. Existing methods often struggle to maintain global directional consistency, leading to drifting or implausible trajectories when extrapolated over long time horizons.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2601.17550v2",
      "title": "AsterNav: Autonomous Aerial Robot Navigation In Darkness Using Passive Computation",
      "url": "https://arxiv.org/abs/2601.17550v2",
      "publishedAt": "2026-01-24T18:41:40Z",
      "summary": "Autonomous aerial navigation in absolute darkness is crucial for post-disaster search and rescue operations, which often occur from disaster-zone power outages. Yet, due to resource constraints, tiny aerial robots, perfectly suited for these operations, are unable to navigate in the darkness to find survivors safely.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2601.15260v2",
      "title": "DrivIng: A Large-Scale Multimodal Driving Dataset with Full Digital Twin Integration",
      "url": "https://arxiv.org/abs/2601.15260v2",
      "publishedAt": "2026-01-21T18:41:05Z",
      "summary": "Perception is a cornerstone of autonomous driving, enabling vehicles to understand their surroundings and make safe, reliable decisions. Developing robust perception algorithms requires large-scale, high-quality datasets that cover diverse driving conditions and support thorough evaluation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3083601",
      "title": "How YC-backed Bucket Robotics survived its first CES",
      "url": "https://techcrunch.com/2026/01/18/how-yc-backed-bucket-robotics-survived-its-first-ces/",
      "publishedAt": "Sun, 18 Jan 2026 16:10:00 +0000",
      "summary": "Now, the startup is turning its attention to building the business, fundraising, and striking commercial deals.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3082677",
      "title": "Oshen built the first ocean robot to collect data in a Category 5 hurricane",
      "url": "https://techcrunch.com/2026/01/17/oshen-built-the-first-ocean-robot-to-collect-data-in-a-category-5-hurricane/",
      "publishedAt": "Sat, 17 Jan 2026 16:00:00 +0000",
      "summary": "Oshen has signed contracts with multiple government agencies for its C-Star robots to collect ocean data autonomously.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88971",
      "title": "AI’s Next Revolution: Multiply Labs Is Scaling Robotics-Driven Cell Therapy Biomanufacturing Labs",
      "url": "https://blogs.nvidia.com/blog/multiply-labs-isaac-omniverse/",
      "publishedAt": "Mon, 12 Jan 2026 15:00:48 +0000",
      "summary": "Startup works with leading cell therapy companies to bring robotics manufacturing into the clean room, reducing costs by more than 70% while accelerating output compared with legacy systems.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_video&#038;p=3081489",
      "title": "Inside CES 2026&#8217;s “physical AI” takeover",
      "url": "https://techcrunch.com/video/inside-ces-2026s-physical-ai-takeover/",
      "publishedAt": "Fri, 09 Jan 2026 01:19:00 +0000",
      "summary": "After years of chatbots and image generators, AI is finally leaving the screen. At CES 2026, that shift became impossible to ignore.&#160; The annual tech showcase in Las Vegas was&#160;dominated by &#8220;physical AI&#8221;&#160;and robotics, from Boston Dynamic&#8217;s newly redesigned Atlas humanoid robot to AI-powered ice makers (yes, really). The companies in attendance clearly want consumers [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88856",
      "title": "Japan Science and Technology Agency Develops NVIDIA-Powered Moonshot Robot for Elderly Care",
      "url": "https://blogs.nvidia.com/blog/japan-science-technology-agency-develops-moonshot-robot/",
      "publishedAt": "Thu, 08 Jan 2026 16:00:29 +0000",
      "summary": "The next universal technology since the smartphone is on the horizon — and it may be a little less pocket friendly. The Moonshot research program, funded by the Japan Science and Technology Agency and accelerated by NVIDIA AI and robotics technologies, is working to create a world by 2050 where AI-powered, autonomously learning robots are Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88923",
      "title": "Steel, Sensors and Silicon: How Caterpillar Is Bringing Edge AI to the Jobsite",
      "url": "https://blogs.nvidia.com/blog/caterpillar-ces-2026/",
      "publishedAt": "Wed, 07 Jan 2026 17:15:15 +0000",
      "summary": "At CES, Caterpillar reveals how it’s integrating NVIDIA technologies, from NVIDIA Jetson Thor to speech models, to transform the world’s heavy industries.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88849",
      "title": "From Warehouse to Wallet: New State of AI in Retail and CPG Survey Uncovers How AI Is Rewiring Supply Chains and Customer Experiences",
      "url": "https://blogs.nvidia.com/blog/ai-in-retail-cpg-survey-2026/",
      "publishedAt": "Wed, 07 Jan 2026 14:00:06 +0000",
      "summary": "AI has transformed retail and consumer packaged goods (CPG) operations, enhancing customer analysis and segmentation to enable greater personalization for marketing and advertising, and boosting the speed and accuracy of demand forecasting for supply chains and logistics. Companies are also raising the bar for customer engagement through intelligent digital shopping assistants and catalog enrichment by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88652",
      "title": "NVIDIA Unveils New Open Models, Data and Tools to Advance AI Across Every Industry",
      "url": "https://blogs.nvidia.com/blog/open-models-data-tools-accelerate-ai/",
      "publishedAt": "Mon, 05 Jan 2026 21:50:50 +0000",
      "summary": "Expanding the open model universe, NVIDIA today released new open models, data and tools to advance AI across every industry. These models — spanning the NVIDIA Nemotron family for agentic AI, the NVIDIA Cosmos platform for physical AI, the new NVIDIA Alpamayo family for autonomous vehicle development, NVIDIA Isaac GR00T for robotics and NVIDIA Clara Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.20014v2",
      "title": "Bring My Cup! Personalizing Vision-Language-Action Models with Visual Attentive Prompting",
      "url": "https://arxiv.org/abs/2512.20014v2",
      "publishedAt": "2025-12-23T03:13:39Z",
      "summary": "While Vision-Language-Action (VLA) models generalize well to generic instructions, they struggle with personalized commands such as \"bring my cup,\" where the robot must act on one specific instance among visually similar objects. We study this setting of manipulating personal objects, in which a VLA must identify and control a user-specific object unseen during training using only a few reference images.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.19347v2",
      "title": "OMP: One-step Meanflow Policy with Directional Alignment",
      "url": "https://arxiv.org/abs/2512.19347v2",
      "publishedAt": "2025-12-22T12:45:35Z",
      "summary": "Robot manipulation has increasingly adopted data-driven generative policy frameworks, yet the field faces a persistent trade-off: diffusion models suffer from high inference latency, while flow-based methods often require complex architectural constraints.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3077498",
      "title": "Pickle Robot adds Tesla veteran as first CFO",
      "url": "https://techcrunch.com/2025/12/18/pickle-robot-adds-tesla-veteran-as-first-cfo/",
      "publishedAt": "Thu, 18 Dec 2025 20:01:46 +0000",
      "summary": "Jeff Evanson recently joined Pickle Robot as the company's first CFO as the startup has allegedly expanded its partnership with UPS.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88410",
      "title": "Into the Omniverse: OpenUSD and NVIDIA Halos Accelerate Safety for Robotaxis, Physical AI Systems",
      "url": "https://blogs.nvidia.com/blog/openusd-halos-safety-robotaxi-physical-ai/",
      "publishedAt": "Wed, 17 Dec 2025 17:00:49 +0000",
      "summary": "Physical AI is moving from research labs into the real world, powering intelligent robots and autonomous vehicles (AVs) — such as robotaxis — that must reliably sense, reason and act amid unpredictable conditions.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88276",
      "title": "Cheers to AI: ADAM Robot Bartender Makes Drinks at Vegas Golden Knights Game",
      "url": "https://blogs.nvidia.com/blog/adam-robot-vegas-golden-knights-thor/",
      "publishedAt": "Fri, 12 Dec 2025 16:00:04 +0000",
      "summary": "In Las Vegas’s T-Mobile Arena, fans of the Golden Knights are getting more than just hockey — they’re getting a taste of the future. ADAM, a robot developed with NVIDIA Isaac libraries, is pouring drinks and turning heads in one of the NHL’s most exciting venues. ADAM, short for Automated Dual Arm Mixologist, was developed Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3075424",
      "title": "1X struck a deal to send its &#8216;home&#8217; humanoids to factories and warehouses",
      "url": "https://techcrunch.com/2025/12/11/1x-struck-a-deal-to-send-its-home-humanoids-to-factories-and-warehouses/",
      "publishedAt": "Thu, 11 Dec 2025 22:03:36 +0000",
      "summary": "Despite launching as a humanoid robot designed to help consumers around the house, 1X's Neo robots are heading to industrial use cases.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88078",
      "title": "Robots’ Holiday Wishes Come True: NVIDIA Jetson Platform Offers High-Performance Edge AI at Festive Prices",
      "url": "https://blogs.nvidia.com/blog/jetson-edge-ai-holiday-2025/",
      "publishedAt": "Thu, 04 Dec 2025 16:00:07 +0000",
      "summary": "Editor’s note: This blog has been updated to showcase additional recent innovations tapping into the NVIDIA Jetson platform. Developers, researchers, hobbyists and students can take a byte out of holiday shopping this season as NVIDIA has unwrapped special discounts on the NVIDIA Jetson family of developer kits for edge AI and robotics — available through Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87946",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "publishedAt": "Tue, 02 Dec 2025 16:00:27 +0000",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87911",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "publishedAt": "Mon, 01 Dec 2025 17:00:48 +0000",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.20002v2",
      "title": "Semantic Router: On the Feasibility of Hijacking MLLMs via a Single Adversarial Perturbation",
      "url": "https://arxiv.org/abs/2511.20002v2",
      "publishedAt": "2025-11-25T07:13:13Z",
      "summary": "Multimodal Large Language Models (MLLMs) are increasingly deployed in stateless systems, such as autonomous driving and robotics. This paper investigates a novel threat: Semantic-Aware Hijacking. We explore the feasibility of hijacking multiple stateless decisions simultaneously using a single universal perturbation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Robotics",
        "LLM"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3069331",
      "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
      "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/",
      "publishedAt": "Thu, 20 Nov 2025 18:00:01 +0000",
      "summary": "Point One Navigation, now valued at $230 million, is building out well beyond automotive.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87636",
      "title": "Powering AI Superfactories, NVIDIA and Microsoft Integrate Latest Technologies for Inference, Cybersecurity, Physical AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-microsoft-ai-superfactories/",
      "publishedAt": "Tue, 18 Nov 2025 20:00:22 +0000",
      "summary": "Timed with the Microsoft Ignite conference running this week, NVIDIA is expanding its collaboration with Microsoft, including through the adoption of next-generation NVIDIA Spectrum-X Ethernet switches for the new Microsoft Fairwater AI superfactory, powered by the NVIDIA Blackwell platform. The collaboration brings new integrations across Microsoft 365 Copilot, as well as the public preview of Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87325",
      "title": "AI On: 3 Ways to Bring Agentic AI to Computer Vision Applications",
      "url": "https://blogs.nvidia.com/blog/ways-to-bring-agentic-ai-to-computer-vision-applications/",
      "publishedAt": "Thu, 13 Nov 2025 18:50:06 +0000",
      "summary": "Editor’s note: This post is part of the AI On blog series, which explores the latest techniques and real-world applications of agentic AI, chatbots and copilots. The series also highlights the NVIDIA software and hardware powering advanced AI agents, which form the foundation of AI query engines that gather insights and perform tasks to transform Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3066690",
      "title": "Why a researcher is building robots that look and act like bats",
      "url": "https://techcrunch.com/2025/11/12/why-a-researcher-is-building-robots-that-look-and-act-like-bats/",
      "publishedAt": "Wed, 12 Nov 2025 17:12:07 +0000",
      "summary": "These palm-sized robots use ultrasound signals to navigate harsh conditions in search and rescue missions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot – and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.25889v3",
      "title": "$π_\\texttt{RL}$: Online RL Fine-tuning for Flow-based Vision-Language-Action Models",
      "url": "https://arxiv.org/abs/2510.25889v3",
      "publishedAt": "2025-10-29T18:37:39Z",
      "summary": "Vision-Language-Action (VLA) models enable robots to understand and perform complex tasks from multimodal input.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models — which power robots, autonomous vehicles and other intelligent machines — must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on What’s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness 🔗 A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment can’t be limited to a few urban tech hubs — it must reach every community, university and state. That’s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology — contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86265",
      "title": "NVIDIA Contributes to Open Frameworks for Next-Generation Robotics Development",
      "url": "https://blogs.nvidia.com/blog/roscon-2025-open-framework-robotics/",
      "publishedAt": "Mon, 27 Oct 2025 00:00:55 +0000",
      "summary": "This year’s ROSCon conference heads to Singapore, bringing together the global robotics developer community behind Robot Operating System (ROS) — the world’s most widely adopted open framework for building robots. At the conference, running through Wednesday, Oct. 29, NVIDIA announced collaborations with partners and the Open Source Robotics Alliance (OSRA), as well as new robotics Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.02081v2",
      "title": "Fine-Tuning Flow Matching via Maximum Likelihood Estimation of Reconstructions",
      "url": "https://arxiv.org/abs/2510.02081v2",
      "publishedAt": "2025-10-02T14:49:47Z",
      "summary": "Flow Matching (FM) models achieve remarkable results in generative tasks. Building upon diffusion models, FM's simulation-free training paradigm enables simplicity and efficiency but introduces a train-inference gap: model outputs cannot be assessed during training. Moreover, the straight flow assumption suffers from some inherent limitations.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.09797v2",
      "title": "FLARE: Agile Flights for Quadrotor Cable-Suspended Payload System via Reinforcement Learning",
      "url": "https://arxiv.org/abs/2508.09797v2",
      "publishedAt": "2025-08-13T13:27:32Z",
      "summary": "Agile flight for the quadrotor cable-suspended payload system is a formidable challenge due to its underactuated, highly nonlinear, and hybrid dynamics. Traditional optimization-based methods often struggle with high computational costs and the complexities of cable mode transitions, limiting their real-time applicability and maneuverability exploitation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2506.06725v3",
      "title": "WorldLLM: Improving LLMs' world modeling using curiosity-driven theory-making",
      "url": "https://arxiv.org/abs/2506.06725v3",
      "publishedAt": "2025-06-07T09:13:34Z",
      "summary": "Large Language Models (LLMs) possess general world knowledge but often struggle to generate precise predictions in structured, domain-specific contexts such as simulations. These limitations arise from their inability to ground their broad, unstructured understanding in specific environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2504.14539v4",
      "title": "Should Benevolent Deception be Allowed in EHMI? A Mechanism Explanation Based on Game Theory",
      "url": "https://arxiv.org/abs/2504.14539v4",
      "publishedAt": "2025-04-20T09:03:28Z",
      "summary": "The application of external human-machine interface (EHMI) on autonomous vehicles (AVs) facilitates information exchange. Existing research fails to consider the impact of the sequence of actions, as well as the effects of EHMI applications and deception, raising the question of whether benevolent, well-intentioned deception should be permitted (i.e., misleading statements that are intended to benefit both parties).",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2501.14587v2",
      "title": "Visual Localization via Semantic Structures in Autonomous Photovoltaic Power Plant Inspection",
      "url": "https://arxiv.org/abs/2501.14587v2",
      "publishedAt": "2025-01-24T15:48:41Z",
      "summary": "Inspection systems utilizing unmanned aerial vehicles (UAVs) equipped with thermal cameras are increasingly popular for the maintenance of photovoltaic (PV) power plants. However, automation of the inspection task is a challenging problem as it requires precise navigation to capture images from optimal distances and viewing angles.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2411.11004v2",
      "title": "EROAM: Event-based Camera Rotational Odometry and Mapping in Real-time",
      "url": "https://arxiv.org/abs/2411.11004v2",
      "publishedAt": "2024-11-17T08:50:47Z",
      "summary": "This paper presents EROAM, a novel event-based rotational odometry and mapping system that achieves real-time, accurate camera rotation estimation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    }
  ]
}