{
  "generatedAt": "2025-11-11T09:06:56.209Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=585966",
      "title": "This time, iRobot needs help cleaning up a mess",
      "url": "https://www.therobotreport.com/this-time-irobot-needs-help-cleaning-up-a-mess/",
      "publishedAt": "Mon, 10 Nov 2025 21:26:14 +0000",
      "summary": "iRobot going out of business would be a loss far bigger than its current financial situation. Will anyone step up and save the robotics icon? The post This time, iRobot needs help cleaning up a mess appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585965",
      "title": "Partner Robotics picks up funding to deploy more construction robots",
      "url": "https://www.therobotreport.com/partner-robotics-picks-up-fresh-funding-deploy-more-building-tiling-robots/",
      "publishedAt": "Mon, 10 Nov 2025 19:27:25 +0000",
      "summary": "Since it was founded in 2023, Partner Robotics has raised around RMB 100 million for building and tiling robots. The post Partner Robotics picks up funding to deploy more construction robots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07418v1",
      "title": "Lightning Grasp: High Performance Procedural Grasp Synthesis with\n  Contact Fields",
      "url": "http://arxiv.org/abs/2511.07418v1",
      "publishedAt": "2025-11-10T18:59:44Z",
      "summary": "Despite years of research, real-time diverse grasp synthesis for dexterous hands remains an unsolved core challenge in robotics and computer graphics. We present Lightning Grasp, a novel high-performance procedural grasp synthesis algorithm that achieves orders-of-magnitude speedups over state-of-the-art approaches, while enabling unsupervised grasp generation for irregular, tool-like objects.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07416v1",
      "title": "Robot Learning from a Physical World Model",
      "url": "http://arxiv.org/abs/2511.07416v1",
      "publishedAt": "2025-11-10T18:59:07Z",
      "summary": "We introduce PhysWorld, a framework that enables robot learning from video generation through physical world modeling. Recent video generation models can synthesize photorealistic visual demonstrations from language commands and images, offering a powerful yet underexplored source of training signals for robotics.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07412v1",
      "title": "TwinOR: Photorealistic Digital Twins of Dynamic Operating Rooms for\n  Embodied AI Research",
      "url": "http://arxiv.org/abs/2511.07412v1",
      "publishedAt": "2025-11-10T18:57:09Z",
      "summary": "Developing embodied AI for intelligent surgical systems requires safe, controllable environments for continual learning and evaluation. However, safety regulations and operational constraints in operating rooms (ORs) limit embodied agents from freely perceiving and interacting in realistic settings. Digital twins provide high-fidelity, risk-free environments for exploration and training.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07410v1",
      "title": "Using Vision Language Models as Closed-Loop Symbolic Planners for\n  Robotic Applications: A Control-Theoretic Perspective",
      "url": "http://arxiv.org/abs/2511.07410v1",
      "publishedAt": "2025-11-10T18:56:56Z",
      "summary": "Large Language Models (LLMs) and Vision Language Models (VLMs) have been widely used for embodied symbolic planning. Yet, how to effectively use these models for closed-loop symbolic planning remains largely unexplored. Because they operate as black boxes, LLMs and VLMs can produce unpredictable or costly errors, making their use in high-level robotic planning especially challenging.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM",
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07407v1",
      "title": "Unified Humanoid Fall-Safety Policy from a Few Demonstrations",
      "url": "http://arxiv.org/abs/2511.07407v1",
      "publishedAt": "2025-11-10T18:56:31Z",
      "summary": "Falling is an inherent risk of humanoid mobility. Maintaining stability is thus a primary safety focus in robot control and learning, yet no existing approach fully averts loss of balance. When instability does occur, prior work addresses only isolated aspects of falling: avoiding falls, choreographing a controlled descent, or standing up afterward.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07403v1",
      "title": "SpatialThinker: Reinforcing 3D Reasoning in Multimodal LLMs via Spatial\n  Rewards",
      "url": "http://arxiv.org/abs/2511.07403v1",
      "publishedAt": "2025-11-10T18:52:47Z",
      "summary": "Multimodal large language models (MLLMs) have achieved remarkable progress in vision-language tasks, but they continue to struggle with spatial understanding. Existing spatial MLLMs often rely on explicit 3D inputs or architecture-specific modifications, and remain constrained by large-scale datasets or sparse supervision.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07401v1",
      "title": "People Perceive More Phantom Costs From Autonomous Agents When They Make\n  Unreasonably Generous Offers",
      "url": "http://arxiv.org/abs/2511.07401v1",
      "publishedAt": "2025-11-10T18:52:26Z",
      "summary": "People often reject offers that are too generous due to the perception of hidden drawbacks referred to as \"phantom costs.\" We hypothesized that this perception and the decision-making vary based on the type of agent making the offer (human vs. robot) and the degree to which the agent is perceived to be autonomous or have the capacity for self-interest.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07392v1",
      "title": "Surgical Agent Orchestration Platform for Voice-directed Patient Data\n  Interaction",
      "url": "http://arxiv.org/abs/2511.07392v1",
      "publishedAt": "2025-11-10T18:47:24Z",
      "summary": "In da Vinci robotic surgery, surgeons' hands and eyes are fully engaged in the procedure, making it difficult to access and manipulate multimodal patient data without interruption. We propose a voice-directed Surgical Agent Orchestrator Platform (SAOP) built on a hierarchical multi-agent framework, consisting of an orchestration agent and three task-specific agents driven by Large Language Models (LLMs).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07381v1",
      "title": "Residual Rotation Correction using Tactile Equivariance",
      "url": "http://arxiv.org/abs/2511.07381v1",
      "publishedAt": "2025-11-10T18:41:34Z",
      "summary": "Visuotactile policy learning augments vision-only policies with tactile input, facilitating contact-rich manipulation. However, the high cost of tactile data collection makes sample efficiency the key requirement for developing visuotactile policies.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07377v1",
      "title": "Real-Time LiDAR Super-Resolution via Frequency-Aware Multi-Scale Fusion",
      "url": "http://arxiv.org/abs/2511.07377v1",
      "publishedAt": "2025-11-10T18:38:15Z",
      "summary": "LiDAR super-resolution addresses the challenge of achieving high-quality 3D perception from cost-effective, low-resolution sensors. While recent transformer-based approaches like TULIP show promise, they remain limited to spatial-domain processing with restricted receptive fields.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07375v1",
      "title": "Exact Smooth Reformulations for Trajectory Optimization Under Signal\n  Temporal Logic Specifications",
      "url": "http://arxiv.org/abs/2511.07375v1",
      "publishedAt": "2025-11-10T18:31:15Z",
      "summary": "We study motion planning under Signal Temporal Logic (STL), a useful formalism for specifying spatial-temporal requirements. We pose STL synthesis as a trajectory optimization problem leveraging the STL robustness semantics. To obtain a differentiable problem without approximation error, we introduce an exact reformulation of the max and min operators. The resulting method is exact, smooth, and sound.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07292v1",
      "title": "PlanT 2.0: Exposing Biases and Structural Flaws in Closed-Loop Driving",
      "url": "http://arxiv.org/abs/2511.07292v1",
      "publishedAt": "2025-11-10T16:41:47Z",
      "summary": "Most recent work in autonomous driving has prioritized benchmark performance and methodological innovation over in-depth analysis of model failures, biases, and shortcut learning. This has led to incremental improvements without a deep understanding of the current failures. While it is straightforward to look at situations where the model fails, it is hard to understand the underlying reason.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07275v1",
      "title": "Robotic versus Human Teleoperation for Remote Ultrasound",
      "url": "http://arxiv.org/abs/2511.07275v1",
      "publishedAt": "2025-11-10T16:22:14Z",
      "summary": "Diagnostic medical ultrasound is widely used, safe, and relatively low cost but requires a high degree of expertise to acquire and interpret the images. Personnel with this expertise are often not available outside of larger cities, leading to difficult, costly travel and long wait times for rural populations.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.07250v1",
      "title": "MVU-Eval: Towards Multi-Video Understanding Evaluation for Multimodal\n  LLMs",
      "url": "http://arxiv.org/abs/2511.07250v1",
      "publishedAt": "2025-11-10T16:02:33Z",
      "summary": "The advent of Multimodal Large Language Models (MLLMs) has expanded AI capabilities to visual modalities, yet existing evaluation benchmarks remain limited to single-video understanding, overlooking the critical need for multi-video understanding in real-world scenarios (e.g., sports analytics and autonomous driving).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07238v1",
      "title": "Leveraging Text-Driven Semantic Variation for Robust OOD Segmentation",
      "url": "http://arxiv.org/abs/2511.07238v1",
      "publishedAt": "2025-11-10T15:54:23Z",
      "summary": "In autonomous driving and robotics, ensuring road safety and reliable decision-making critically depends on out-of-distribution (OOD) segmentation. While numerous methods have been proposed to detect anomalous objects on the road, leveraging the vision-language space-which provides rich linguistic knowledge-remains an underexplored field.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585958",
      "title": "When trust in robotics comes down to the Internet connection",
      "url": "https://www.therobotreport.com/when-trust-robotics-comes-down-internet-connectivity/",
      "publishedAt": "Mon, 10 Nov 2025 15:12:22 +0000",
      "summary": "For robotics, from surgical systems to robotaxis, to be integrated into daily life, they need reliable connectivity, writes a Cisco columnist. The post When trust in robotics comes down to the Internet connection appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07175v1",
      "title": "Automated Generation of Continuous-Space Roadmaps for Routing Mobile\n  Robot Fleets",
      "url": "http://arxiv.org/abs/2511.07175v1",
      "publishedAt": "2025-11-10T15:04:12Z",
      "summary": "Efficient routing of mobile robot fleets is crucial in intralogistics, where delays and deadlocks can substantially reduce system throughput. Roadmap design, specifying feasible transport routes, directly affects fleet coordination and computational performance. Existing approaches are either grid-based, compromising geometric precision, or continuous-space approaches that disregard practical constraints.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07155v1",
      "title": "Dynamics-Decoupled Trajectory Alignment for Sim-to-Real Transfer in\n  Reinforcement Learning for Autonomous Driving",
      "url": "http://arxiv.org/abs/2511.07155v1",
      "publishedAt": "2025-11-10T14:45:24Z",
      "summary": "Reinforcement learning (RL) has shown promise in robotics, but deploying RL on real vehicles remains challenging due to the complexity of vehicle dynamics and the mismatch between simulation and reality.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07106v1",
      "title": "HENet++: Hybrid Encoding and Multi-task Learning for 3D Perception and\n  End-to-end Autonomous Driving",
      "url": "http://arxiv.org/abs/2511.07106v1",
      "publishedAt": "2025-11-10T13:49:59Z",
      "summary": "Three-dimensional feature extraction is a critical component of autonomous driving systems, where perception tasks such as 3D object detection, bird's-eye-view (BEV) semantic segmentation, and occupancy prediction serve as important constraints on 3D features.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07081v1",
      "title": "HDCNet: A Hybrid Depth Completion Network for Grasping Transparent and\n  Reflective Objects",
      "url": "http://arxiv.org/abs/2511.07081v1",
      "publishedAt": "2025-11-10T13:11:41Z",
      "summary": "Depth perception of transparent and reflective objects has long been a critical challenge in robotic manipulation.Conventional depth sensors often fail to provide reliable measurements on such surfaces, limiting the performance of robots in perception and grasping tasks.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07071v1",
      "title": "Multi-Agent Reinforcement Learning for Deadlock Handling among\n  Autonomous Mobile Robots",
      "url": "http://arxiv.org/abs/2511.07071v1",
      "publishedAt": "2025-11-10T13:04:44Z",
      "summary": "This dissertation explores the application of multi-agent reinforcement learning (MARL) for handling deadlocks in intralogistics systems that rely on autonomous mobile robots (AMRs). AMRs enhance operational flexibility but also increase the risk of deadlocks, which degrade system throughput and reliability.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07054v1",
      "title": "Structural sign herdability of linear time-invariant systems:theory and\n  design for arbitrary network structures",
      "url": "http://arxiv.org/abs/2511.07054v1",
      "publishedAt": "2025-11-10T12:46:17Z",
      "summary": "The objective of this paper is to investigate graph-theoretic conditions for structural herdability of an LTI system. In particular, we are interested in the structural sign (SS) herdability of a system wherein the underlying digraph representing it is signed. Structural herdability finds applications in various domains like power networks, biological networks, opinion dynamics, multi-robot shepherding, etc.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.07029v1",
      "title": "Certified L2-Norm Robustness of 3D Point Cloud Recognition in the\n  Frequency Domain",
      "url": "http://arxiv.org/abs/2511.07029v1",
      "publishedAt": "2025-11-10T12:24:35Z",
      "summary": "3D point cloud classification is a fundamental task in safety-critical applications such as autonomous driving, robotics, and augmented reality. However, recent studies reveal that point cloud classifiers are vulnerable to structured adversarial perturbations and geometric corruptions, posing risks to their deployment in safety-critical scenarios.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.06998v1",
      "title": "Raspi$^2$USBL: An open-source Raspberry Pi-Based Passive Inverted\n  Ultra-Short Baseline Positioning System for Underwater Robotics",
      "url": "http://arxiv.org/abs/2511.06998v1",
      "publishedAt": "2025-11-10T11:51:22Z",
      "summary": "Precise underwater positioning remains a fundamental challenge for underwater robotics since global navigation satellite system (GNSS) signals cannot penetrate the sea surface. This paper presents Raspi$^2$USBL, an open-source, Raspberry Pi-based passive inverted ultra-short baseline (piUSBL) positioning system designed to provide a low-cost and accessible solution for underwater robotic research.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.06955v1",
      "title": "FPGA-Accelerated RISC-V ISA Extensions for Efficient Neural Network\n  Inference on Edge Devices",
      "url": "http://arxiv.org/abs/2511.06955v1",
      "publishedAt": "2025-11-10T11:04:01Z",
      "summary": "Edge AI deployment faces critical challenges balancing computational performance, energy efficiency, and resource constraints. This paper presents FPGA-accelerated RISC-V instruction set architecture (ISA) extensions for efficient neural network inference on resource-constrained edge devices.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.06919v1",
      "title": "Integration of Visual SLAM into Consumer-Grade Automotive Localization",
      "url": "http://arxiv.org/abs/2511.06919v1",
      "publishedAt": "2025-11-10T10:12:21Z",
      "summary": "Accurate ego-motion estimation in consumer-grade vehicles currently relies on proprioceptive sensors, i.e. wheel odometry and IMUs, whose performance is limited by systematic errors and calibration. While visual-inertial SLAM has become a standard in robotics, its integration into automotive ego-motion estimation remains largely unexplored.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.06892v1",
      "title": "Multi-Agent AI Framework for Road Situation Detection and C-ITS Message\n  Generation",
      "url": "http://arxiv.org/abs/2511.06892v1",
      "publishedAt": "2025-11-10T09:43:06Z",
      "summary": "Conventional road-situation detection methods achieve strong performance in predefined scenarios but fail in unseen cases and lack semantic interpretation, which is crucial for reliable traffic recommendations. This work introduces a multi-agent AI framework that combines multimodal large language models (MLLMs) with vision-based perception for road-situation monitoring.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585959",
      "title": "Is physical world AI the future of autonomous machines?",
      "url": "https://www.therobotreport.com/physical-world-ai-future-autonomous-machines/",
      "publishedAt": "Sun, 09 Nov 2025 13:30:20 +0000",
      "summary": "Physical world AI, or autonomous machines' situational awareness, is improving thanks to data and cloud-edge systems, writes Wherobots' CEO. The post Is physical world AI the future of autonomous machines? appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585950",
      "title": "Holman Robotics launches to offer automation management services",
      "url": "https://www.therobotreport.com/holman-robotics-launches-offers-automation-management-services/",
      "publishedAt": "Sat, 08 Nov 2025 13:34:43 +0000",
      "summary": "Automotive services company Holman has launched a robotics division to provide end-to-end support for industrial automation deployments. The post Holman Robotics launches to offer automation management services appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585947",
      "title": "Expert roundtable to examine the future of warehouse automation",
      "url": "https://www.therobotreport.com/experts-roundtable-examine-future-warehouse-automation/",
      "publishedAt": "Fri, 07 Nov 2025 20:10:28 +0000",
      "summary": "Experts from DHL Supply Chain, inVia Robotics, and Interact Analysis will discuss where warehouse automation is going in a free webinar. The post Expert roundtable to examine the future of warehouse automation appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585942",
      "title": "ACCES I/O Products releases PCI Express Mini Card multifunction analog I/O module",
      "url": "https://www.therobotreport.com/acces-i-o-products-releases-pci-express-mini-card-multifunction-analog-output-input-module/",
      "publishedAt": "Fri, 07 Nov 2025 15:37:24 +0000",
      "summary": "ACCES I/O Products said the module comes in a small, rugged design ideal for embedded and OEM applications. The post ACCES I/O Products releases PCI Express Mini Card multifunction analog I/O module appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585938",
      "title": "QSS partners with Humanoid to advance robotics in Saudi Arabia",
      "url": "https://www.therobotreport.com/qss-ai-robotics-partners-humanoid-advance-robotics-development-saudi-arabia/",
      "publishedAt": "Fri, 07 Nov 2025 15:07:26 +0000",
      "summary": "QSS AI &#038; Robotics and Humanoid plan to produce and deploy 10,000 robots across industries in Saudi Arabia. The post QSS partners with Humanoid to advance robotics in Saudi Arabia appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585926",
      "title": "How Carbon Robotics built the large plant model for its laser weeding robot",
      "url": "https://www.therobotreport.com/how-carbon-robotics-built-the-large-plant-model-for-its-laser-weeding-robot/",
      "publishedAt": "Fri, 07 Nov 2025 13:34:47 +0000",
      "summary": "Carbon Robotics founder and CEO Paul Mikesell explains how the agbotics company built its AI model with high-quality data. The post How Carbon Robotics built the large plant model for its laser weeding robot appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585932",
      "title": "iRobot revenue continues to drop with &#8216;no sources&#8217; of additional capital",
      "url": "https://www.therobotreport.com/irobot-revenue-drops-again-with-no-sources-of-additional-capital/",
      "publishedAt": "Fri, 07 Nov 2025 00:40:07 +0000",
      "summary": "iRobot said if it can't obtain new capital, it \"may be forced to significantly curtail or cease operations and would likely seek bankruptcy protection.\" The post iRobot revenue continues to drop with &#8216;no sources&#8217; of additional capital appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585918",
      "title": "Wandercraft earns second FDA clearance for Atalante X exoskeleton",
      "url": "https://www.therobotreport.com/wandercraft-earns-second-fda-clearance-for-atalante-x-exoskeleton/",
      "publishedAt": "Thu, 06 Nov 2025 21:44:21 +0000",
      "summary": "This clearance comes just a few short months after Wandercraft received expanded CE Mark certification for enhanced clinical features. The post Wandercraft earns second FDA clearance for Atalante X exoskeleton appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585924",
      "title": "SS Innovations completes first telesurgery with new SSi Mantra console",
      "url": "https://www.therobotreport.com/ss-innovations-international-completes-first-telesurgery-ssi-mantra-surgeon-console/",
      "publishedAt": "Thu, 06 Nov 2025 21:31:25 +0000",
      "summary": "The TSC is a compact, self-contained chair-based version of the larger SSi Mantra surgeon command center from SS Innovations. The post SS Innovations completes first telesurgery with new SSi Mantra console appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.04665v2",
      "title": "Real-to-Sim Robot Policy Evaluation with Gaussian Splatting Simulation\n  of Soft-Body Interactions",
      "url": "http://arxiv.org/abs/2511.04665v2",
      "publishedAt": "2025-11-06T18:52:08Z",
      "summary": "Robotic manipulation policies are advancing rapidly, but their direct evaluation in the real world remains costly, time-consuming, and difficult to reproduce, particularly for tasks involving deformable objects. Simulation provides a scalable and systematic alternative, yet existing simulators often fail to capture the coupled visual and physical complexity of soft-body interactions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585908",
      "title": "Sovato closes Series B funding to advance telesurgery",
      "url": "https://www.therobotreport.com/sovato-closes-series-b-funding-to-advance-telesurgery/",
      "publishedAt": "Thu, 06 Nov 2025 17:18:11 +0000",
      "summary": "Sovato has completed fundraising to scale its telesurgery platform and extend expert robotic care globally. Distant doctors, closer care. The post Sovato closes Series B funding to advance telesurgery appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585905",
      "title": "Teradyne Robotics lays off another 14% of workforce",
      "url": "https://www.therobotreport.com/teradyne-robotics-lays-off-another-14-of-workforce/",
      "publishedAt": "Thu, 06 Nov 2025 13:58:58 +0000",
      "summary": "Teradyne Robotics, which includes Mobile Industrial Robots and Universal Robots, said revenue is not meeting expectations. The post Teradyne Robotics lays off another 14% of workforce appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585904",
      "title": "PickNik expands support for Franka Research 3 robot on MoveIt Pro",
      "url": "https://www.therobotreport.com/picknik-expands-support-for-franka-research-3-robot-on-moveit-pro/",
      "publishedAt": "Wed, 05 Nov 2025 20:49:39 +0000",
      "summary": "PickNik Robotics said this collaboration will help to address one of the central bottlenecks in AI and robotics development. The post PickNik expands support for Franka Research 3 robot on MoveIt Pro appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.02402v2",
      "title": "Two-way Coupling of Fluid--Structure Interaction for Elastic\n  Magneto-Swimmers:A Finite Element ALE Approach",
      "url": "http://arxiv.org/abs/2511.02402v2",
      "publishedAt": "2025-11-04T09:32:50Z",
      "summary": "Artificial micro-swimmers actuated by external magnetic fields hold significant promise for targeted biomedical applications, including drug delivery and micro-robot-assisted therapy. However, their dynamics remain challenging to control due to the complex nonlinear coupling between magnetic actuation, elastic deformations, and fluid interactions in confined biological environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot â€“ and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models â€” which power robots, autonomous vehicles and other intelligent machines â€” must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on Whatâ€™s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness ðŸ”— A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment canâ€™t be limited to a few urban tech hubs â€” it must reach every community, university and state. Thatâ€™s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology â€” contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86265",
      "title": "NVIDIA Contributes to Open Frameworks for Next-Generation Robotics Development",
      "url": "https://blogs.nvidia.com/blog/roscon-2025-open-framework-robotics/",
      "publishedAt": "Mon, 27 Oct 2025 00:00:55 +0000",
      "summary": "This yearâ€™s ROSCon conference heads to Singapore, bringing together the global robotics developer community behind Robot Operating System (ROS) â€” the worldâ€™s most widely adopted open framework for building robots. At the conference, running through Wednesday, Oct. 29, NVIDIA announced collaborations with partners and the Open Source Robotics Alliance (OSRA), as well as new robotics Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "CocoÂ RoboticsÂ taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is justÂ not quite readyÂ for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolioÂ withÂ ABB Groupâ€™s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.17354v3",
      "title": "Multi-Scenario Highway Lane-Change Intention Prediction: A\n  Physics-Informed AI Framework for Three-Class Classification",
      "url": "http://arxiv.org/abs/2509.17354v3",
      "publishedAt": "2025-09-22T05:17:54Z",
      "summary": "Lane-change maneuvers are a leading cause of highway accidents, underscoring the need for accurate intention prediction to improve the safety and decision-making of autonomous driving systems.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunchâ€™s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans donâ€™t? Common sense: an understanding, developed through real-world experiences, that birds canâ€™t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules â€” new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "Weâ€™re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the companyâ€™s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIAâ€™s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI â€” the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world â€” is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82559",
      "title": "NVIDIA and Partners Highlight Next-Generation Robotics, Automation and AI Technologies at Automatica",
      "url": "https://blogs.nvidia.com/blog/automatica-robotics-2025/",
      "publishedAt": "Tue, 24 Jun 2025 09:00:30 +0000",
      "summary": "From the heart of Germanyâ€™s automotive sector to manufacturing hubs across France and Italy, Europe is embracing industrial AI and advanced AI-powered robotics to address labor shortages, boost productivity and fuel sustainable economic growth. Robotics companies are developing humanoid robots and collaborative systems that integrate AI into real-world manufacturing applications.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82396",
      "title": "Hexagon Taps NVIDIA Robotics and AI Software to Build and Deploy AEON, a New Humanoid",
      "url": "https://blogs.nvidia.com/blog/hexagon-robotics-ai-software-aeon-humanoid/",
      "publishedAt": "Tue, 17 Jun 2025 15:10:55 +0000",
      "summary": "As a global labor shortage leaves 50 million positions unfilled across industries like manufacturing and logistics, Hexagon â€” a global leader in measurement technologies â€” is developing humanoid robots that can lend a helping hand. Industrial sectors depend on skilled workers to perform a variety of error-prone tasks, including operating high-precision scanners for reality capture Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=82037",
      "title": "European Robot Makers Adopt NVIDIA Isaac, Omniverse and Halos to Develop Safe, Physical AI-Driven Robot Fleets",
      "url": "https://blogs.nvidia.com/blog/european-robot-makers-isaac-omniverse-halos-safe-physical-ai/",
      "publishedAt": "Wed, 11 Jun 2025 11:00:23 +0000",
      "summary": "In the face of growing labor shortages and need for sustainability, European manufacturers are racing to reinvent their processes to become software-defined and AI-driven. To achieve this, robot developers and industrial digitalization solution providers are working with NVIDIA to build safe, AI-driven robots and industrial technologies to drive modern, sustainable manufacturing. At NVIDIA GTC Paris Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82173",
      "title": "Germany Builds Its AI Autobahn With NVIDIA",
      "url": "https://blogs.nvidia.com/blog/germany-ai-factories/",
      "publishedAt": "Wed, 11 Jun 2025 10:25:33 +0000",
      "summary": "Germany is building on a long history of engineering innovation with new AI investments poised to transform the countryâ€™s economy â€” including the automotive, banking, manufacturing and robotics industries. The country is deploying tens of thousands of NVIDIA GPUs to power AI factories that generate intelligence for businesses and researchers, optimized AI software to run Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=81193",
      "title": "Researchers and Students in TÃ¼rkiye Build AI, Robotics Tools to Boost Disaster Readiness",
      "url": "https://blogs.nvidia.com/blog/turkiye-disaster-readiness-ai-robotics/",
      "publishedAt": "Mon, 02 Jun 2025 15:00:11 +0000",
      "summary": "Since a 7.8-magnitude earthquake hit Syria and TÃ¼rkiye two years ago â€” leaving 55,000 people dead, 130,000 injured and millions displaced from their homes â€” students, researchers and developers have been harnessing the latest AI robotics technologies to increase disaster preparedness in the region. The work is part of a Disaster Response Innovation and Education Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3013274",
      "title": "Hugging Face unveils two new humanoid robots",
      "url": "https://techcrunch.com/2025/05/29/hugging-face-unveils-two-new-humanoid-robots/",
      "publishedAt": "Thu, 29 May 2025 19:28:24 +0000",
      "summary": "AI dev platform Hugging Face continued its push into robotics on Thursday with the release of two new humanoid robots.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.20617v3",
      "title": "OccLE: Label-Efficient 3D Semantic Occupancy Prediction",
      "url": "http://arxiv.org/abs/2505.20617v3",
      "publishedAt": "2025-05-27T01:41:28Z",
      "summary": "3D semantic occupancy prediction offers an intuitive and efficient scene understanding and has attracted significant interest in autonomous driving perception. Existing approaches either rely on full supervision, which demands costly voxel-level annotations, or on self-supervision, which provides limited guidance and yields suboptimal performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3011215",
      "title": "Why Intempus thinks robots should have a human physiological state",
      "url": "https://techcrunch.com/2025/05/25/why-intempus-thinks-robots-should-have-a-human-physiological-state/",
      "publishedAt": "Sun, 25 May 2025 14:00:00 +0000",
      "summary": "Teddy Warner, 19, has always been interested in robotics. His family was in the industry, and he says he &#8220;grew up&#8221; working in a machinist shop while in high school. Now Warner is building a robotics company of his own, Intempus, that looks to make robots a bit more human. Intempus is building tech to [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3010629",
      "title": "Serve is betting that food delivery and access to public markets are the keys to scaling robotics",
      "url": "https://techcrunch.com/podcast/serve-is-betting-that-food-delivery-and-access-to-public-markets-are-the-keys-to-scaling-robotics/",
      "publishedAt": "Wed, 21 May 2025 20:20:53 +0000",
      "summary": "â€œThe only thing worse than being a public company CEO is being a private company CEO right now,â€ says Ali Kashani, co-founder and CEO of Serve Robotics. Access to capital, he argues, is everything in robotics. And in todayâ€™s â€œFOMO-drivenâ€ venture climate, securing funds is far from guaranteed. Backed by Nvidia and Uber, Serve recently [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80963",
      "title": "NVIDIA Research Breakthroughs Put Advanced Robots in Motion",
      "url": "https://blogs.nvidia.com/blog/nvidia-research-robotics-icra-2025/",
      "publishedAt": "Mon, 19 May 2025 15:00:53 +0000",
      "summary": "Across robot training and development, NVIDIA Research is uncovering breakthroughs in areas such as multimodal generative AI and synthetic data generation. The teamâ€™s latest innovations will be spotlighted at the International Conference on Robotics and Automation (ICRA), running May 19-23 in Atlanta. â€œICRA has played a pivotal role in shaping the direction of robotics and Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2504.09103v3",
      "title": "IMPACT: Behavioral Intention-aware Multimodal Trajectory Prediction with\n  Adaptive Context Trimming",
      "url": "http://arxiv.org/abs/2504.09103v3",
      "publishedAt": "2025-04-12T06:56:36Z",
      "summary": "While most prior research has focused on improving the precision of multimodal trajectory predictions, the explicit modeling of multimodal behavioral intentions (e.g., yielding, overtaking) remains relatively underexplored. This paper proposes a unified framework that jointly predicts both behavioral intentions and trajectories to enhance prediction accuracy, interpretability, and efficiency.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2503.15106v3",
      "title": "Distilling 3D distinctive local descriptors for 6D pose estimation",
      "url": "http://arxiv.org/abs/2503.15106v3",
      "publishedAt": "2025-03-19T11:04:37Z",
      "summary": "Three-dimensional local descriptors are crucial for encoding geometric surface properties, making them essential for various point cloud understanding tasks. Among these descriptors, GeDi has demonstrated strong zero-shot 6D pose estimation capabilities but remains computationally impractical for real-world applications due to its expensive inference process.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2503.11072v3",
      "title": "A High-Speed Time-Optimal Trajectory Generation Strategy via a Two-layer\n  Planning Model",
      "url": "http://arxiv.org/abs/2503.11072v3",
      "publishedAt": "2025-03-14T04:31:35Z",
      "summary": "MPC (Model predictive control)-based motion planning and trajectory generation are essential in applications such as unmanned aerial vehicles, robotic manipulators, and rocket control.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2501.18232v2",
      "title": "Free-T2M: Robust Text-to-Motion Generation for Humanoid Robots via\n  Frequency-Domain",
      "url": "http://arxiv.org/abs/2501.18232v2",
      "publishedAt": "2025-01-30T09:45:23Z",
      "summary": "Enabling humanoid robots to synthesize complex, physically coherent motions from natural language commands is a cornerstone of autonomous robotics and human-robot interaction. While diffusion models have shown promise in this text-to-motion (T2M) task, they often generate semantically flawed or unstable motions, limiting their applicability to real-world robots.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2411.00527v4",
      "title": "MAROON: A Dataset for the Joint Characterization of Near-Field\n  High-Resolution Radio-Frequency and Optical Depth Imaging Techniques",
      "url": "http://arxiv.org/abs/2411.00527v4",
      "publishedAt": "2024-11-01T11:53:10Z",
      "summary": "Utilizing the complementary strengths of wavelength-specific range or depth sensors is crucial for robust computer-assisted tasks such as autonomous driving. Despite this, there is still little research done at the intersection of optical depth sensors and radars operating close range, where the target is decimeters away from the sensors.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    }
  ]
}