{
  "generatedAt": "2025-10-23T15:05:15.871Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=585716",
      "title": "GrayMatter Robotics opens physical AI innovation center",
      "url": "https://www.therobotreport.com/graymatter-robotics-opens-physical-ai-innovation-center/",
      "publishedAt": "Thu, 23 Oct 2025 15:00:31 +0000",
      "summary": "GrayMatter says its new headquarters and experience center will help it expand AI robotics applications in manufacturing. The post GrayMatter Robotics opens physical AI innovation center appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19818v1",
      "title": "Semantic World Models",
      "url": "http://arxiv.org/abs/2510.19818v1",
      "publishedAt": "2025-10-22T17:53:45Z",
      "summary": "Planning with world models offers a powerful paradigm for robotic control. Conventional approaches train a model to predict future frames conditioned on current frames and actions, which can then be used for planning. However, the objective of predicting future pixels is often at odds with the actual planning objective; strong pixel reconstruction does not always correlate with good planning decisions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19766v1",
      "title": "SEA: Semantic Map Prediction for Active Exploration of Uncertain Areas",
      "url": "http://arxiv.org/abs/2510.19766v1",
      "publishedAt": "2025-10-22T16:51:36Z",
      "summary": "In this paper, we propose SEA, a novel approach for active robot exploration through semantic map prediction and a reinforcement learning-based hierarchical exploration policy. Unlike existing learning-based methods that rely on one-step waypoint prediction, our approach enhances the agent's long-term environmental understanding to facilitate more efficient exploration.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19752v1",
      "title": "Learning Affordances at Inference-Time for Vision-Language-Action Models",
      "url": "http://arxiv.org/abs/2510.19752v1",
      "publishedAt": "2025-10-22T16:43:29Z",
      "summary": "Solving complex real-world control tasks often takes multiple tries: if we fail at first, we reflect on what went wrong, and change our strategy accordingly to avoid making the same mistake. In robotics, Vision-Language-Action models (VLAs) offer a promising path towards solving complex control tasks, but lack the ability to contextually and dynamically readjust behavior when they fail to accomplish a task.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19732v1",
      "title": "Memo: Training Memory-Efficient Embodied Agents with Reinforcement\n  Learning",
      "url": "http://arxiv.org/abs/2510.19732v1",
      "publishedAt": "2025-10-22T16:24:47Z",
      "summary": "To enable embodied agents to operate effectively over extended timeframes, it is crucial to develop models that form and access memories to stay contextualized in their environment.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585335",
      "title": "Robotics Summit 2026 extends call for speakers",
      "url": "https://www.therobotreport.com/robotics-summit-2026-opens-call-for-speakers/",
      "publishedAt": "Wed, 22 Oct 2025 15:42:53 +0000",
      "summary": "The Robotics Summit &#038; Expo, the industry’s must-attend technical development event, returns to Boston in 2026 with deepened coverage, an expanded expo floor, and more. The post Robotics Summit 2026 extends call for speakers appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585704",
      "title": "Lessons from robotics successes and failures",
      "url": "https://www.therobotreport.com/lessons-from-robotics-successes-and-failures/",
      "publishedAt": "Wed, 22 Oct 2025 15:28:30 +0000",
      "summary": "Learn how to de-risk your product journey by avoiding costly mistakes that are difficult to fix once a robot is in the field. The post Lessons from robotics successes and failures appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585688",
      "title": "Oso Electric Equipment acquires Electric Sheep Robotics",
      "url": "https://www.therobotreport.com/oso-electric-equipment-acquires-electric-sheep-robotics/",
      "publishedAt": "Wed, 22 Oct 2025 15:21:09 +0000",
      "summary": "Oso Electric Equipment and Electric Sheep are deepening an already established partnership with the acquisition. The post Oso Electric Equipment acquires Electric Sheep Robotics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19663v1",
      "title": "Fast Marker Detection for UV-Based Visual Relative Localisation in Agile\n  UAV Swarms",
      "url": "http://arxiv.org/abs/2510.19663v1",
      "publishedAt": "2025-10-22T15:07:55Z",
      "summary": "A novel approach for the fast onboard detection of isolated markers for visual relative localisation of multiple teammates in agile UAV swarms is introduced in this paper. As the detection forms a key component of real-time localisation systems, a three-fold innovation is presented, consisting of an optimised procedure for CPUs, a GPU shader program, and a functionally equivalent FPGA streaming architecture.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=585700",
      "title": "Serve Robotics could bring in up to $100M from stock sale",
      "url": "https://www.therobotreport.com/serve-robotics-could-bring-in-up-to-100m-from-stock-sale/",
      "publishedAt": "Wed, 22 Oct 2025 14:59:20 +0000",
      "summary": "Serve Robotics said it will use the proceeds of the offering for general corporate purposes, including working capital. The post Serve Robotics could bring in up to $100M from stock sale appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19655v1",
      "title": "LaViRA: Language-Vision-Robot Actions Translation for Zero-Shot Vision\n  Language Navigation in Continuous Environments",
      "url": "http://arxiv.org/abs/2510.19655v1",
      "publishedAt": "2025-10-22T14:58:16Z",
      "summary": "Zero-shot Vision-and-Language Navigation in Continuous Environments (VLN-CE) requires an agent to navigate unseen environments based on natural language instructions without any prior training. Current methods face a critical trade-off: either rely on environment-specific waypoint predictors that limit scene generalization, or underutilize the reasoning capabilities of large models during navigation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19654v1",
      "title": "From Forecasting to Planning: Policy World Model for Collaborative\n  State-Action Prediction",
      "url": "http://arxiv.org/abs/2510.19654v1",
      "publishedAt": "2025-10-22T14:57:51Z",
      "summary": "Despite remarkable progress in driving world models, their potential for autonomous systems remains largely untapped: the world models are mostly learned for world simulation and decoupled from trajectory planning. While recent efforts aim to unify world modeling and planning in a single framework, the synergistic facilitation mechanism of world modeling for planning still requires further exploration.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19595v1",
      "title": "Control Barrier Functions for the Full Class of Signal Temporal Logic\n  Tasks using Spatiotemporal Tubes",
      "url": "http://arxiv.org/abs/2510.19595v1",
      "publishedAt": "2025-10-22T13:44:50Z",
      "summary": "This paper introduces a new framework for synthesizing time-varying control barrier functions (TV-CBFs) for general Signal Temporal Logic (STL) specifications using spatiotemporal tubes (STT). We first formulate the STT synthesis as a robust optimization problem (ROP) and solve it through a scenario optimization problem (SOP), providing formal guarantees that the resulting tubes capture the given STL specifications.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.19578v1",
      "title": "VGD: Visual Geometry Gaussian Splatting for Feed-Forward Surround-view\n  Driving Reconstruction",
      "url": "http://arxiv.org/abs/2510.19578v1",
      "publishedAt": "2025-10-22T13:28:49Z",
      "summary": "Feed-forward surround-view autonomous driving scene reconstruction offers fast, generalizable inference ability, which faces the core challenge of ensuring generalization while elevating novel view quality. Due to the surround-view with minimal overlap regions, existing methods typically fail to ensure geometric consistency and reconstruction quality for novel views.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19567v1",
      "title": "Polynomial-time Configuration Generator for Connected Unlabeled\n  Multi-Agent Pathfinding",
      "url": "http://arxiv.org/abs/2510.19567v1",
      "publishedAt": "2025-10-22T13:19:19Z",
      "summary": "We consider Connected Unlabeled Multi-Agent Pathfinding (CUMAPF), a variant of MAPF where the agents must maintain connectivity at all times. This problem is fundamental to swarm robotics applications like self-reconfiguration and marching, where standard MAPF is insufficient as it does not guarantee the required connectivity between agents.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19541v1",
      "title": "Optimizing Prosthetic Wrist Movement: A Model Predictive Control\n  Approach",
      "url": "http://arxiv.org/abs/2510.19541v1",
      "publishedAt": "2025-10-22T12:47:59Z",
      "summary": "The integration of advanced control strategies into prosthetic hands is essential to improve their adaptability and performance. In this study, we present an implementation of a Model Predictive Control (MPC) strategy to regulate the motions of a soft continuum wrist section attached to a tendon-driven prosthetic hand with less computational effort.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19495v1",
      "title": "Using Non-Expert Data to Robustify Imitation Learning via Offline\n  Reinforcement Learning",
      "url": "http://arxiv.org/abs/2510.19495v1",
      "publishedAt": "2025-10-22T11:43:39Z",
      "summary": "Imitation learning has proven effective for training robots to perform complex tasks from expert human demonstrations. However, it remains limited by its reliance on high-quality, task-specific data, restricting adaptability to the diverse range of real-world object configurations and scenarios.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19438v1",
      "title": "AutoMT: A Multi-Agent LLM Framework for Automated Metamorphic Testing of\n  Autonomous Driving Systems",
      "url": "http://arxiv.org/abs/2510.19438v1",
      "publishedAt": "2025-10-22T10:11:05Z",
      "summary": "Autonomous Driving Systems (ADS) are safety-critical, where failures can be severe. While Metamorphic Testing (MT) is effective for fault detection in ADS, existing methods rely heavily on manual effort and lack automation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19430v1",
      "title": "GigaBrain-0: A World Model-Powered Vision-Language-Action Model",
      "url": "http://arxiv.org/abs/2510.19430v1",
      "publishedAt": "2025-10-22T09:57:13Z",
      "summary": "Training Vision-Language-Action (VLA) models for generalist robots typically requires large-scale real-world robot data, which is expensive and time-consuming to collect. The inefficiency of physical data collection severely limits the scalability, and generalization capacity of current VLA systems.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19415v1",
      "title": "Risk Assessment of an Autonomous Underwater Snake Robot in Confined\n  Operations",
      "url": "http://arxiv.org/abs/2510.19415v1",
      "publishedAt": "2025-10-22T09:37:04Z",
      "summary": "The growing interest in ocean discovery imposes a need for inspection and intervention in confined and demanding environments. Eely's slender shape, in addition to its ability to change its body configurations, makes articulated underwater robots an adequate option for such environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19407v1",
      "title": "A Radius of Robust Feasibility Approach to Directional Sensors in\n  Uncertain Terrain",
      "url": "http://arxiv.org/abs/2510.19407v1",
      "publishedAt": "2025-10-22T09:25:01Z",
      "summary": "A sensor has the ability to probe its surroundings. However, uncertainties in its exact location can significantly compromise its sensing performance. The radius of robust feasibility defines the maximum range within which robust feasibility is ensured. This work introduces a novel approach integrating it with the directional sensor networks to enhance coverage using a distributed greedy algorithm.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.19400v1",
      "title": "Seeing Across Views: Benchmarking Spatial Reasoning of Vision-Language\n  Models in Robotic Scenes",
      "url": "http://arxiv.org/abs/2510.19400v1",
      "publishedAt": "2025-10-22T09:20:09Z",
      "summary": "Vision-language models (VLMs) are essential to Embodied AI, enabling robots to perceive, reason, and act in complex environments. They also serve as the foundation for the recent Vision-Language-Action (VLA) models. Yet most evaluations of VLMs focus on single-view settings, leaving their ability to integrate multi-view information underexplored.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19373v1",
      "title": "Using Temperature Sampling to Effectively Train Robot Learning Policies\n  on Imbalanced Datasets",
      "url": "http://arxiv.org/abs/2510.19373v1",
      "publishedAt": "2025-10-22T08:48:55Z",
      "summary": "Increasingly large datasets of robot actions and sensory observations are being collected to train ever-larger neural networks. These datasets are collected based on tasks and while these tasks may be distinct in their descriptions, many involve very similar physical action sequences (e.g., 'pick up an apple' versus 'pick up an orange').",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19364v1",
      "title": "ProTerrain: Probabilistic Physics-Informed Rough Terrain World Modeling",
      "url": "http://arxiv.org/abs/2510.19364v1",
      "publishedAt": "2025-10-22T08:36:46Z",
      "summary": "Uncertainty-aware robot motion prediction is crucial for downstream traversability estimation and safe autonomous navigation in unstructured, off-road environments, where terrain is heterogeneous and perceptual uncertainty is high.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19356v1",
      "title": "Imitation Learning Policy based on Multi-Step Consistent Integration\n  Shortcut Model",
      "url": "http://arxiv.org/abs/2510.19356v1",
      "publishedAt": "2025-10-22T08:27:07Z",
      "summary": "The wide application of flow-matching methods has greatly promoted the development of robot imitation learning. However, these methods all face the problem of high inference time. To address this issue, researchers have proposed distillation methods and consistency methods, but the performance of these methods still struggles to compete with that of the original diffusion models and flow-matching models.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.19352v1",
      "title": "ConvXformer: Differentially Private Hybrid ConvNeXt-Transformer for\n  Inertial Navigation",
      "url": "http://arxiv.org/abs/2510.19352v1",
      "publishedAt": "2025-10-22T08:20:31Z",
      "summary": "Data-driven inertial sequence learning has revolutionized navigation in GPS-denied environments, offering superior odometric resolution compared to traditional Bayesian methods. However, deep learning-based inertial tracking systems remain vulnerable to privacy breaches that can expose sensitive training data.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.19335v1",
      "title": "Segmentation and Celestial Mapping of Unobservable Regions in Nighttime\n  All-sky Images for the Mephisto Observations",
      "url": "http://arxiv.org/abs/2510.19335v1",
      "publishedAt": "2025-10-22T07:57:24Z",
      "summary": "Accurate identification of unobservable regions in nighttime is essential for autonomous scheduling and data quality control in observations.Traditional methods-such as infrared sensing or photometric extinction-provide only coarse,non-spatial estimates of sky clarity,making them insufficient for real-time decision-making.This not only wastes observing time but also introduces contamination when telescopes are directed toward cloud-covered or moonlight-affected regions.To address these limitations,we propose a deep learning-based segmentation framework that provides pixel-level masks of unobservable areas using all-sky images.Supported by a manually annotated dataset of nighttime images,our method enables precise detection of cloud- and moonlight-affected regions.The segmentation results are further mapped to celestial coordinates through Zenithal Equal-Area projection,allowing seamless integration with observation control systems (OCS) for real-time cloud-aware scheduling.While developed for the Mephisto telescope,the framework is generalizable and applicable to other wide-field robotic observatories equipped with all-sky monitoring.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585695",
      "title": "Draganfly and Palladyne partner to develop drone swarms for defense",
      "url": "https://www.therobotreport.com/draganfly-palladyne-partner-develop-drone-swarms-defense/",
      "publishedAt": "Tue, 21 Oct 2025 16:44:38 +0000",
      "summary": "Draganfly will integrate Palladyne AI's Pilot edge-based software to give drones the ability to collaborate with an operator in the loop. The post Draganfly and Palladyne partner to develop drone swarms for defense appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585684",
      "title": "How to overcome the hidden holdup of the battery revolution",
      "url": "https://www.therobotreport.com/how-to-overcome-hidden-holdup-battery-revolution/",
      "publishedAt": "Tue, 21 Oct 2025 15:42:08 +0000",
      "summary": "If electrification and automation are so important, why have battery makers gone bust? Proper Voltage's CEO points to integration. The post How to overcome the hidden holdup of the battery revolution appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.18313v2",
      "title": "OmniNWM: Omniscient Driving Navigation World Models",
      "url": "http://arxiv.org/abs/2510.18313v2",
      "publishedAt": "2025-10-21T05:49:01Z",
      "summary": "Autonomous driving world models are expected to work effectively across three core dimensions: state, action, and reward. Existing models, however, are typically restricted to limited state modalities, short video sequences, imprecise action control, and a lack of reward awareness.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585685",
      "title": "Waymo plans to bring driverless robotaxis to London in 2026",
      "url": "https://www.therobotreport.com/waymo-plans-to-bring-driverless-robotaxis-london-2026/",
      "publishedAt": "Mon, 20 Oct 2025 22:12:06 +0000",
      "summary": "Over the coming months, Waymo plans to lay the groundwork for U.K. service in collaboration with its fleet partner Moove. The post Waymo plans to bring driverless robotaxis to London in 2026 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585680",
      "title": "Amazon, CMU partner on new AI Innovation Hub",
      "url": "https://www.therobotreport.com/amazon-cmu-partner-on-new-ai-innovation-hub/",
      "publishedAt": "Mon, 20 Oct 2025 17:47:45 +0000",
      "summary": "The Hub's initial focus areas leverage both institutions' strengths in artificial intelligence and robotics, Amazon and CMU said. The post Amazon, CMU partner on new AI Innovation Hub appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.17111v2",
      "title": "Efficient Vision-Language-Action Models for Embodied Manipulation: A\n  Systematic Survey",
      "url": "http://arxiv.org/abs/2510.17111v2",
      "publishedAt": "2025-10-20T02:59:45Z",
      "summary": "Vision-Language-Action (VLA) models extend vision-language models to embodied control by mapping natural-language instructions and visual observations to robot actions. Despite their capabilities, VLA systems face significant challenges due to their massive computational and memory demands, which conflict with the constraints of edge platforms such as on-board mobile manipulators that require real-time performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Embodied AI",
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.14828v2",
      "title": "RoboGPT-R1: Enhancing Robot Planning with Reinforcement Learning",
      "url": "http://arxiv.org/abs/2510.14828v2",
      "publishedAt": "2025-10-16T16:04:35Z",
      "summary": "Improving the reasoning capabilities of embodied agents is crucial for robots to complete complex human instructions in long-view manipulation tasks successfully.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Embodied AI",
        "RL",
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585672",
      "title": "Your guide to Day 2 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-day-2-robobusiness-2025/",
      "publishedAt": "Thu, 16 Oct 2025 12:00:30 +0000",
      "summary": "Day 2 of RoboBusiness 2025 is another packed day full of interesting talks, unique networking opportunities, and big-name keynotes. The post Your guide to Day 2 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585662",
      "title": "Your guide to Day 1 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-to-day-1-of-robobusiness-2025/",
      "publishedAt": "Wed, 15 Oct 2025 12:00:30 +0000",
      "summary": "This is a comprehensive guide to everything happening on the first day of RoboBusiness 2025, include a full session schedule. The post Your guide to Day 1 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585617",
      "title": "A guide to everything happening at RoboBusiness 2025",
      "url": "https://www.therobotreport.com/a-guide-to-everything-happening-at-robobusiness-2025/",
      "publishedAt": "Tue, 14 Oct 2025 12:00:26 +0000",
      "summary": "To help you keep track of everything going on at RoboBusiness, we’ve compiled a summary of all of the activities at the event. The post A guide to everything happening at RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585678",
      "title": "Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program",
      "url": "https://www.therobotreport.com/diligent-robotics-joins-agetech-collaborative-aarp-accelerator-program/",
      "publishedAt": "Tue, 14 Oct 2025 11:30:06 +0000",
      "summary": "After providing mobile manipulators to hospitals, Diligent Robotics is working with AARP to bring robots to senior care communities. The post Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.11474v2",
      "title": "Coordinated Strategies in Realistic Air Combat by Hierarchical\n  Multi-Agent Reinforcement Learning",
      "url": "http://arxiv.org/abs/2510.11474v2",
      "publishedAt": "2025-10-13T14:44:51Z",
      "summary": "Achieving mission objectives in a realistic simulation of aerial combat is highly challenging due to imperfect situational awareness and nonlinear flight dynamics. In this work, we introduce a novel 3D multi-agent air combat environment and a Hierarchical Multi-Agent Reinforcement Learning framework to tackle these challenges.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585671",
      "title": "HavocAI obtains $85M to scale autonomous marine systems",
      "url": "https://www.therobotreport.com/havocai-obtains-85m-to-scale-autonomous-marine-systems/",
      "publishedAt": "Mon, 13 Oct 2025 14:38:55 +0000",
      "summary": "HavocAI plans to use the funding to grow its autonomous fleet and enable military vessels in allied navies. The post HavocAI obtains $85M to scale autonomous marine systems appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585669",
      "title": "Surgical robots take center stage at DeviceTalks West, RoboBusiness",
      "url": "https://www.therobotreport.com/surgical-robots-take-center-stage-devicetalks-west-robobusiness/",
      "publishedAt": "Mon, 13 Oct 2025 12:54:33 +0000",
      "summary": "Attendees at RoboBusiness 2025 and DeviceTalks West this week can learn about the latest developments in surgical robotics. The post Surgical robots take center stage at DeviceTalks West, RoboBusiness appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.05874v2",
      "title": "MaNGO - Adaptable Graph Network Simulators via Meta-Learning",
      "url": "http://arxiv.org/abs/2510.05874v2",
      "publishedAt": "2025-10-07T12:44:24Z",
      "summary": "Accurately simulating physics is crucial across scientific domains, with applications spanning from robotics to materials science. While traditional mesh-based simulations are precise, they are often computationally expensive and require knowledge of physical parameters, such as material properties.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIA’s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI — the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world — is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.01415v5",
      "title": "RoboMemory: A Brain-inspired Multi-memory Agentic Framework for\n  Interactive Environmental Learning in Physical Embodied Systems",
      "url": "http://arxiv.org/abs/2508.01415v5",
      "publishedAt": "2025-08-02T15:39:42Z",
      "summary": "Embodied agents face persistent challenges in real-world environments, including partial observability, limited spatial reasoning, and high-latency multi-memory integration. We present RoboMemory, a brain-inspired framework that unifies Spatial, Temporal, Episodic, and Semantic memory under a parallelized architecture for efficient long-horizon planning and interactive environmental learning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.00744v2",
      "title": "Rethinking Backbone Design for Lightweight 3D Object Detection in LiDAR",
      "url": "http://arxiv.org/abs/2508.00744v2",
      "publishedAt": "2025-08-01T16:19:51Z",
      "summary": "Recent advancements in LiDAR-based 3D object detection have significantly accelerated progress toward the realization of fully autonomous driving in real-world environments. Despite achieving high detection performance, most of the approaches still rely on a VGG-based or ResNet-based backbone for feature exploration, which increases the model complexity.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82559",
      "title": "NVIDIA and Partners Highlight Next-Generation Robotics, Automation and AI Technologies at Automatica",
      "url": "https://blogs.nvidia.com/blog/automatica-robotics-2025/",
      "publishedAt": "Tue, 24 Jun 2025 09:00:30 +0000",
      "summary": "From the heart of Germany’s automotive sector to manufacturing hubs across France and Italy, Europe is embracing industrial AI and advanced AI-powered robotics to address labor shortages, boost productivity and fuel sustainable economic growth. Robotics companies are developing humanoid robots and collaborative systems that integrate AI into real-world manufacturing applications.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82396",
      "title": "Hexagon Taps NVIDIA Robotics and AI Software to Build and Deploy AEON, a New Humanoid",
      "url": "https://blogs.nvidia.com/blog/hexagon-robotics-ai-software-aeon-humanoid/",
      "publishedAt": "Tue, 17 Jun 2025 15:10:55 +0000",
      "summary": "As a global labor shortage leaves 50 million positions unfilled across industries like manufacturing and logistics, Hexagon — a global leader in measurement technologies — is developing humanoid robots that can lend a helping hand. Industrial sectors depend on skilled workers to perform a variety of error-prone tasks, including operating high-precision scanners for reality capture Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=82037",
      "title": "European Robot Makers Adopt NVIDIA Isaac, Omniverse and Halos to Develop Safe, Physical AI-Driven Robot Fleets",
      "url": "https://blogs.nvidia.com/blog/european-robot-makers-isaac-omniverse-halos-safe-physical-ai/",
      "publishedAt": "Wed, 11 Jun 2025 11:00:23 +0000",
      "summary": "In the face of growing labor shortages and need for sustainability, European manufacturers are racing to reinvent their processes to become software-defined and AI-driven. To achieve this, robot developers and industrial digitalization solution providers are working with NVIDIA to build safe, AI-driven robots and industrial technologies to drive modern, sustainable manufacturing. At NVIDIA GTC Paris Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82173",
      "title": "Germany Builds Its AI Autobahn With NVIDIA",
      "url": "https://blogs.nvidia.com/blog/germany-ai-factories/",
      "publishedAt": "Wed, 11 Jun 2025 10:25:33 +0000",
      "summary": "Germany is building on a long history of engineering innovation with new AI investments poised to transform the country’s economy — including the automotive, banking, manufacturing and robotics industries. The country is deploying tens of thousands of NVIDIA GPUs to power AI factories that generate intelligence for businesses and researchers, optimized AI software to run Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=81193",
      "title": "Researchers and Students in Türkiye Build AI, Robotics Tools to Boost Disaster Readiness",
      "url": "https://blogs.nvidia.com/blog/turkiye-disaster-readiness-ai-robotics/",
      "publishedAt": "Mon, 02 Jun 2025 15:00:11 +0000",
      "summary": "Since a 7.8-magnitude earthquake hit Syria and Türkiye two years ago — leaving 55,000 people dead, 130,000 injured and millions displaced from their homes — students, researchers and developers have been harnessing the latest AI robotics technologies to increase disaster preparedness in the region. The work is part of a Disaster Response Innovation and Education Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3013274",
      "title": "Hugging Face unveils two new humanoid robots",
      "url": "https://techcrunch.com/2025/05/29/hugging-face-unveils-two-new-humanoid-robots/",
      "publishedAt": "Thu, 29 May 2025 19:28:24 +0000",
      "summary": "AI dev platform Hugging Face continued its push into robotics on Thursday with the release of two new humanoid robots.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3011215",
      "title": "Why Intempus thinks robots should have a human physiological state",
      "url": "https://techcrunch.com/2025/05/25/why-intempus-thinks-robots-should-have-a-human-physiological-state/",
      "publishedAt": "Sun, 25 May 2025 14:00:00 +0000",
      "summary": "Teddy Warner, 19, has always been interested in robotics. His family was in the industry, and he says he &#8220;grew up&#8221; working in a machinist shop while in high school. Now Warner is building a robotics company of his own, Intempus, that looks to make robots a bit more human. Intempus is building tech to [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3010629",
      "title": "Serve is betting that food delivery and access to public markets are the keys to scaling robotics",
      "url": "https://techcrunch.com/podcast/serve-is-betting-that-food-delivery-and-access-to-public-markets-are-the-keys-to-scaling-robotics/",
      "publishedAt": "Wed, 21 May 2025 20:20:53 +0000",
      "summary": "“The only thing worse than being a public company CEO is being a private company CEO right now,” says Ali Kashani, co-founder and CEO of Serve Robotics. Access to capital, he argues, is everything in robotics. And in today’s “FOMO-driven” venture climate, securing funds is far from guaranteed. Backed by Nvidia and Uber, Serve recently [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80963",
      "title": "NVIDIA Research Breakthroughs Put Advanced Robots in Motion",
      "url": "https://blogs.nvidia.com/blog/nvidia-research-robotics-icra-2025/",
      "publishedAt": "Mon, 19 May 2025 15:00:53 +0000",
      "summary": "Across robot training and development, NVIDIA Research is uncovering breakthroughs in areas such as multimodal generative AI and synthetic data generation. The team’s latest innovations will be spotlighted at the International Conference on Robotics and Automation (ICRA), running May 19-23 in Atlanta. “ICRA has played a pivotal role in shaping the direction of robotics and Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80675",
      "title": "Foxconn Taps NVIDIA to Accelerate Physical and Digital Robotics for Global Healthcare Industry",
      "url": "https://blogs.nvidia.com/blog/foxconn-smart-hospital-robot/",
      "publishedAt": "Mon, 19 May 2025 04:50:42 +0000",
      "summary": "The world’s largest electronics manufacturer is building smart hospital solutions using NVIDIA technologies from the data center to the edge.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80740",
      "title": "That’s One Smart Hospital! Taiwan Medical Centers Deploy Life-Saving Innovations With NVIDIA System-Builder Partners",
      "url": "https://blogs.nvidia.com/blog/taiwan-medical-centers-system-builder-partners/",
      "publishedAt": "Mon, 19 May 2025 04:50:09 +0000",
      "summary": "Leading healthcare organizations across the globe are using agentic AI, robotics and digital twins of medical environments to enhance surgical precision, boost workflow efficiency, improve medical diagnoses and more. Physical AI and humanoid robots in hospitals have the potential to automate routine tasks, assist with patient care and address workforce shortages. This is especially crucial Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80491",
      "title": "NVIDIA Omniverse Digital Twins Help Taiwan Manufacturers Drive Golden Age of Industrial AI",
      "url": "https://blogs.nvidia.com/blog/omniverse-digital-twins-taiwan-manufacturers-physical-ai/",
      "publishedAt": "Mon, 19 May 2025 04:30:03 +0000",
      "summary": "NVIDIA and Taiwan’s manufacturing ecosystem, including Delta Electronics, Foxconn, TSMC and Wistron, are showcasing this week at COMPUTEX in Taipei the crucial role digital twins play in accelerating industrial AI. These electronics, semiconductor and robotics manufacturing leaders are using Universal Scene Description (OpenUSD) and NVIDIA Omniverse libraries and blueprints to develop physically based digital twins.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80499",
      "title": "NVIDIA Partners Showcase Cutting-Edge Robotic and Industrial AI Solutions at Automate 2025",
      "url": "https://blogs.nvidia.com/blog/robotics-industrial-ai-automate/",
      "publishedAt": "Tue, 13 May 2025 13:45:00 +0000",
      "summary": "As the manufacturing industry faces challenges — such as labor shortages, reshoring and inconsistent operational strategies — AI-powered robots present a significant opportunity to accelerate industrial automation. At Automate, the largest robotics and automation event in North America, robotics leaders KUKA, Standard Bots, Universal Robots (UR) and Vention are showcasing hardware and robots powered by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3004901",
      "title": "Amazon offers peek at new human jobs in an AI bot world",
      "url": "https://techcrunch.com/2025/05/11/amazon-offers-peek-at-new-human-jobs-in-an-ai-bot-world/",
      "publishedAt": "Sun, 11 May 2025 14:00:00 +0000",
      "summary": "The tech industry seems to have two thoughts when it comes to where human workers fit into the AI-powered world they are creating: Either they think that all the jobs, except perhaps their own, will be done by bots. (VC Marc Andreessen seems to think that his work as an investor could never be automated). [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=80269",
      "title": "Wandercraft Begins Clinical Trials for Physical AI-Powered Personal Exoskeleton",
      "url": "https://blogs.nvidia.com/blog/physical-ai-exoskeleton/",
      "publishedAt": "Thu, 01 May 2025 13:00:30 +0000",
      "summary": "For Nicolas Simon, advancing the field of robotics is a personal mission that could change his siblings’ lives. Two-thirds of Simon’s family members use wheelchairs due to mobility challenges related to Charcot-Marie-Tooth disease, an inherited genetic condition. As an engineering student and robotics club chair at France’s École Polytechnique, he saw the opportunity to build Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=79551",
      "title": "National Robotics Week — Latest Physical AI Research, Breakthroughs and Resources",
      "url": "https://blogs.nvidia.com/blog/national-robotics-week-2025/",
      "publishedAt": "Sat, 12 Apr 2025 16:00:05 +0000",
      "summary": "This National Robotics Week, NVIDIA highlighted the pioneering technologies that are shaping the future of intelligent machines and driving progress across manufacturing, healthcare, logistics and more. Advancements in robotics simulation and robot learning are driving this fundamental shift in the industry. Plus, the emergence of world foundation models is accelerating the evolution of AI-enabled robots Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.14689v3",
      "title": "Follow the STARs: Dynamic $ω$-Regular Shielding of Learned Policies",
      "url": "http://arxiv.org/abs/2505.14689v3",
      "publishedAt": "2025-04-11T16:37:24Z",
      "summary": "This paper presents a novel dynamic post-shielding framework that enforces the full class of $\\omega$-regular correctness properties over pre-computed probabilistic policies.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2503.07376v2",
      "title": "AttentionSwarm: Reinforcement Learning with Attention Control Barier\n  Function for Crazyflie Drones in Dynamic Environments",
      "url": "http://arxiv.org/abs/2503.07376v2",
      "publishedAt": "2025-03-10T14:30:59Z",
      "summary": "We introduce AttentionSwarm, a novel benchmark designed to evaluate safe and efficient swarm control in a dynamic drone racing scenario. Central to our approach is the Attention Model-Based Control Barrier Function (CBF) framework, which integrates attention mechanisms with safety-critical control theory to enable real-time collision avoidance and trajectory optimization.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2503.01206v3",
      "title": "Action Tokenizer Matters in In-Context Imitation Learning",
      "url": "http://arxiv.org/abs/2503.01206v3",
      "publishedAt": "2025-03-03T06:02:53Z",
      "summary": "In-context imitation learning (ICIL) is a new paradigm that enables robots to generalize from demonstrations to unseen tasks without retraining. A well-structured action representation is the key to capturing demonstration information effectively, yet action tokenizer (the process of discretizing and encoding actions) remains largely unexplored in ICIL.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2502.03762v3",
      "title": "Learning Reward Machines from Partially Observed Policies",
      "url": "http://arxiv.org/abs/2502.03762v3",
      "publishedAt": "2025-02-06T03:48:25Z",
      "summary": "Inverse reinforcement learning is the problem of inferring a reward function from an optimal policy or demonstrations by an expert. In this work, it is assumed that the reward is expressed as a reward machine whose transitions depend on atomic propositions associated with the state of a Markov Decision Process (MDP). Our goal is to identify the true reward machine using finite information.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2404.18201v6",
      "title": "What Foundation Models can Bring for Robot Learning in Manipulation : A\n  Survey",
      "url": "http://arxiv.org/abs/2404.18201v6",
      "publishedAt": "2024-04-28T14:39:29Z",
      "summary": "The realization of universal robots is an ultimate goal of researchers. However, a key hurdle in achieving this goal lies in the robots' ability to manipulate objects in their unstructured surrounding environments according to different tasks. The learning-based approach is considered an effective way to address generalization.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2405.14882v2",
      "title": "LookUp3D: Data-Driven 3D Scanning",
      "url": "http://arxiv.org/abs/2405.14882v2",
      "publishedAt": "2024-04-05T07:08:20Z",
      "summary": "High speed, high-resolution, and accurate 3D scanning would open doors to many new applications in graphics, robotics, science, and medicine by enabling the accurate scanning of deformable objects during interactions. Past attempts to use structured light, time-of-flight, and stereo in high-speed settings have usually required tradeoffs in resolution or inaccuracy.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    }
  ]
}