{
  "generatedAt": "2025-10-16T15:48:11.951Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=585672",
      "title": "Your guide to Day 2 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-day-2-robobusiness-2025/",
      "publishedAt": "Thu, 16 Oct 2025 12:00:30 +0000",
      "summary": "Day 2 of RoboBusiness 2025 is another packed day full of interesting talks, unique networking opportunities, and big-name keynotes. The post Your guide to Day 2 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13808v1",
      "title": "VisCoP: Visual Probing for Video Domain Adaptation of Vision Language\n  Models",
      "url": "http://arxiv.org/abs/2510.13808v1",
      "publishedAt": "2025-10-15T17:59:52Z",
      "summary": "Large Vision-Language Models (VLMs) excel at general visual reasoning tasks but exhibit sharp performance degradation when applied to novel domains with substantial distribution shifts from pretraining data. Existing domain adaptation approaches finetune different VLM components, but this often results in limited domain-specific feature learning or catastrophic forgetting of prior capabilities.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13794v1",
      "title": "MimicKit: A Reinforcement Learning Framework for Motion Imitation and\n  Control",
      "url": "http://arxiv.org/abs/2510.13794v1",
      "publishedAt": "2025-10-15T17:51:42Z",
      "summary": "MimicKit is an open-source framework for training motion controllers using motion imitation and reinforcement learning. The codebase provides implementations of commonly-used motion-imitation techniques and RL algorithms.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13792v1",
      "title": "Provably Invincible Adversarial Attacks on Reinforcement Learning\n  Systems: A Rate-Distortion Information-Theoretic Approach",
      "url": "http://arxiv.org/abs/2510.13792v1",
      "publishedAt": "2025-10-15T17:48:19Z",
      "summary": "Reinforcement learning (RL) for the Markov Decision Process (MDP) has emerged in many security-related applications, such as autonomous driving, financial decisions, and drone/robot algorithms. In order to improve the robustness/defense of RL systems against adversaries, studying various adversarial attacks on RL systems is very important.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13778v1",
      "title": "InternVLA-M1: A Spatially Guided Vision-Language-Action Framework for\n  Generalist Robot Policy",
      "url": "http://arxiv.org/abs/2510.13778v1",
      "publishedAt": "2025-10-15T17:30:05Z",
      "summary": "We introduce InternVLA-M1, a unified framework for spatial grounding and robot control that advances instruction-following robots toward scalable, general-purpose intelligence. Its core idea is spatially guided vision-language-action training, where spatial grounding serves as the critical link between instructions and robot actions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13704v1",
      "title": "Simplicial Embeddings Improve Sample Efficiency in Actor-Critic Agents",
      "url": "http://arxiv.org/abs/2510.13704v1",
      "publishedAt": "2025-10-15T16:01:30Z",
      "summary": "Recent works have proposed accelerating the wall-clock training time of actor-critic methods via the use of large-scale environment parallelization; unfortunately, these can sometimes still require large number of environment interactions to achieve a desired level of performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13686v1",
      "title": "Hierarchical Discrete Lattice Assembly: An Approach for the Digital\n  Fabrication of Scalable Macroscale Structures",
      "url": "http://arxiv.org/abs/2510.13686v1",
      "publishedAt": "2025-10-15T15:43:43Z",
      "summary": "Although digital fabrication processes at the desktop scale have become proficient and prolific, systems aimed at producing larger-scale structures are still typically complex, expensive, and unreliable. In this work, we present an approach for the fabrication of scalable macroscale structures using simple robots and interlocking lattice building blocks.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13644v1",
      "title": "On Your Own: Pro-level Autonomous Drone Racing in Uninstrumented Arenas",
      "url": "http://arxiv.org/abs/2510.13644v1",
      "publishedAt": "2025-10-15T15:06:47Z",
      "summary": "Drone technology is proliferating in many industries, including agriculture, logistics, defense, infrastructure, and environmental monitoring. Vision-based autonomy is one of its key enablers, particularly for real-world applications. This is essential for operating in novel, unstructured environments where traditional navigation methods may be unavailable.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13626v1",
      "title": "LIBERO-Plus: In-depth Robustness Analysis of Vision-Language-Action\n  Models",
      "url": "http://arxiv.org/abs/2510.13626v1",
      "publishedAt": "2025-10-15T14:51:36Z",
      "summary": "Visual-Language-Action (VLA) models report impressive success rates on robotic manipulation benchmarks, yet these results may mask fundamental weaknesses in robustness. We perform a systematic vulnerability analysis by introducing controlled perturbations across seven dimensions: objects layout, camera viewpoints, robot initial states, language instructions, light conditions, background textures and sensor noise.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13625v1",
      "title": "A Modular Object Detection System for Humanoid Robots Using YOLO",
      "url": "http://arxiv.org/abs/2510.13625v1",
      "publishedAt": "2025-10-15T14:51:31Z",
      "summary": "Within the field of robotics, computer vision remains a significant barrier to progress, with many tasks hindered by inefficient vision systems. This research proposes a generalized vision module leveraging YOLOv9, a state-of-the-art framework optimized for computationally constrained environments like robots. The model is trained on a dataset tailored to the FIRA robotics Hurocup.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13619v1",
      "title": "Characterizing Lidar Point-Cloud Adversities Using a Vector Field\n  Visualization",
      "url": "http://arxiv.org/abs/2510.13619v1",
      "publishedAt": "2025-10-15T14:49:27Z",
      "summary": "In this paper we introduce a visualization methodology to aid a human analyst in classifying adversity modes that impact lidar scan matching. Our methodology is intended for offline rather than real-time analysis. The method generates a vector-field plot that characterizes local discrepancies between a pair of registered point clouds.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13616v1",
      "title": "Efficient Force and Stiffness Prediction in Robotic Produce Handling\n  with a Piezoresistive Pressure Sensor",
      "url": "http://arxiv.org/abs/2510.13616v1",
      "publishedAt": "2025-10-15T14:45:37Z",
      "summary": "Properly handling delicate produce with robotic manipulators is a major part of the future role of automation in agricultural harvesting and processing. Grasping with the correct amount of force is crucial in not only ensuring proper grip on the object, but also to avoid damaging or bruising the product.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13599v1",
      "title": "PlanarMesh: Building Compact 3D Meshes from LiDAR using Incremental\n  Adaptive Resolution Reconstruction",
      "url": "http://arxiv.org/abs/2510.13599v1",
      "publishedAt": "2025-10-15T14:33:00Z",
      "summary": "Building an online 3D LiDAR mapping system that produces a detailed surface reconstruction while remaining computationally efficient is a challenging task. In this paper, we present PlanarMesh, a novel incremental, mesh-based LiDAR reconstruction system that adaptively adjusts mesh resolution to achieve compact, detailed reconstructions in real-time.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13595v1",
      "title": "Active Tactile Exploration for Rigid Body Pose and Shape Estimation",
      "url": "http://arxiv.org/abs/2510.13595v1",
      "publishedAt": "2025-10-15T14:24:57Z",
      "summary": "General robot manipulation requires the handling of previously unseen objects. Learning a physically accurate model at test time can provide significant benefits in data efficiency, predictability, and reuse between tasks. Tactile sensing can compliment vision with its robustness to occlusion, but its temporal sparsity necessitates careful online exploration to maintain data efficiency.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13594v1",
      "title": "Development of an Intuitive GUI for Non-Expert Teleoperation of Humanoid\n  Robots",
      "url": "http://arxiv.org/abs/2510.13594v1",
      "publishedAt": "2025-10-15T14:24:48Z",
      "summary": "The operation of humanoid robotics is an essential field of research with many practical and competitive applications. Many of these systems, however, do not invest heavily in developing a non-expert-centered graphical user interface (GUI) for operation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13565v1",
      "title": "XD-RCDepth: Lightweight Radar-Camera Depth Estimation with\n  Explainability-Aligned and Distribution-Aware Distillation",
      "url": "http://arxiv.org/abs/2510.13565v1",
      "publishedAt": "2025-10-15T14:05:33Z",
      "summary": "Depth estimation remains central to autonomous driving, and radar-camera fusion offers robustness in adverse conditions by providing complementary geometric cues. In this paper, we present XD-RCDepth, a lightweight architecture that reduces the parameters by 29.7% relative to the state-of-the-art lightweight baseline while maintaining comparable accuracy.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13553v1",
      "title": "Hoecken-D Hand: A Novel Robotic Hand for Linear Parallel Pinching and\n  Self-Adaptive Grasping",
      "url": "http://arxiv.org/abs/2510.13553v1",
      "publishedAt": "2025-10-15T13:49:02Z",
      "summary": "This paper presents the Hoecken-D Hand, an underactuated robotic gripper that combines a modified Hoecken linkage with a differential spring mechanism to achieve both linear parallel pinching and a mid-stroke transition to adaptive envelope.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13546v1",
      "title": "Accelerated Feature Detectors for Visual SLAM: A Comparative Study of\n  FPGA vs GPU",
      "url": "http://arxiv.org/abs/2510.13546v1",
      "publishedAt": "2025-10-15T13:40:55Z",
      "summary": "Feature detection is a common yet time-consuming module in Simultaneous Localization and Mapping (SLAM) implementations, which are increasingly deployed on power-constrained platforms, such as drones. Graphics Processing Units (GPUs) have been a popular accelerator for computer vision in general, and feature detection and SLAM in particular.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13535v1",
      "title": "A Novel Robot Hand with Hoeckens Linkages and Soft Phalanges for\n  Scooping and Self-Adaptive Grasping in Environmental Constraints",
      "url": "http://arxiv.org/abs/2510.13535v1",
      "publishedAt": "2025-10-15T13:27:46Z",
      "summary": "This paper presents a novel underactuated adaptive robotic hand, Hockens-A Hand, which integrates the Hoeckens mechanism, a double-parallelogram linkage, and a specialized four-bar linkage to achieve three adaptive grasping modes: parallel pinching, asymmetric scooping, and enveloping grasping.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13488v1",
      "title": "Bridge the Gap: Enhancing Quadruped Locomotion with Vertical Ground\n  Perturbations",
      "url": "http://arxiv.org/abs/2510.13488v1",
      "publishedAt": "2025-10-15T12:37:55Z",
      "summary": "Legged robots, particularly quadrupeds, excel at navigating rough terrains, yet their performance under vertical ground perturbations, such as those from oscillating surfaces, remains underexplored.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13464v1",
      "title": "Through the Lens of Doubt: Robust and Efficient Uncertainty Estimation\n  for Visual Place Recognition",
      "url": "http://arxiv.org/abs/2510.13464v1",
      "publishedAt": "2025-10-15T12:12:55Z",
      "summary": "Visual Place Recognition (VPR) enables robots and autonomous vehicles to identify previously visited locations by matching current observations against a database of known places. However, VPR systems face significant challenges when deployed across varying visual environments, lighting conditions, seasonal changes, and viewpoints changes.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.13461v1",
      "title": "Physics-Informed Neural Network Modeling of Vehicle Collision Dynamics\n  in Precision Immobilization Technique Maneuvers",
      "url": "http://arxiv.org/abs/2510.13461v1",
      "publishedAt": "2025-10-15T12:08:55Z",
      "summary": "Accurate prediction of vehicle collision dynamics is crucial for advanced safety systems and post-impact control applications, yet existing methods face inherent trade-offs among computational efficiency, prediction accuracy, and data requirements. This paper proposes a dual Physics-Informed Neural Network framework addressing these challenges through two complementary networks.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=585662",
      "title": "Your guide to Day 1 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-to-day-1-of-robobusiness-2025/",
      "publishedAt": "Wed, 15 Oct 2025 12:00:30 +0000",
      "summary": "This is a comprehensive guide to everything happening on the first day of RoboBusiness 2025, include a full session schedule. The post Your guide to Day 1 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585617",
      "title": "A guide to everything happening at RoboBusiness 2025",
      "url": "https://www.therobotreport.com/a-guide-to-everything-happening-at-robobusiness-2025/",
      "publishedAt": "Tue, 14 Oct 2025 12:00:26 +0000",
      "summary": "To help you keep track of everything going on at RoboBusiness, we’ve compiled a summary of all of the activities at the event. The post A guide to everything happening at RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585678",
      "title": "Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program",
      "url": "https://www.therobotreport.com/diligent-robotics-joins-agetech-collaborative-aarp-accelerator-program/",
      "publishedAt": "Tue, 14 Oct 2025 11:30:06 +0000",
      "summary": "After providing mobile manipulators to hospitals, Diligent Robotics is working with AARP to bring robots to senior care communities. The post Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585671",
      "title": "HavocAI obtains $85M to scale autonomous marine systems",
      "url": "https://www.therobotreport.com/havocai-obtains-85m-to-scale-autonomous-marine-systems/",
      "publishedAt": "Mon, 13 Oct 2025 14:38:55 +0000",
      "summary": "HavocAI plans to use the funding to grow its autonomous fleet and enable military vessels in allied navies. The post HavocAI obtains $85M to scale autonomous marine systems appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585669",
      "title": "Surgical robots take center stage at DeviceTalks West, RoboBusiness",
      "url": "https://www.therobotreport.com/surgical-robots-take-center-stage-devicetalks-west-robobusiness/",
      "publishedAt": "Mon, 13 Oct 2025 12:54:33 +0000",
      "summary": "Attendees at RoboBusiness 2025 and DeviceTalks West this week can learn about the latest developments in surgical robotics. The post Surgical robots take center stage at DeviceTalks West, RoboBusiness appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.10912v2",
      "title": "More than A Point: Capturing Uncertainty with Adaptive Affordance\n  Heatmaps for Spatial Grounding in Robotic Tasks",
      "url": "http://arxiv.org/abs/2510.10912v2",
      "publishedAt": "2025-10-13T02:14:30Z",
      "summary": "Many language-guided robotic systems rely on collapsing spatial reasoning into discrete points, making them brittle to perceptual noise and semantic ambiguity. To address this challenge, we propose RoboMAP, a framework that represents spatial targets as continuous, adaptive affordance heatmaps.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=585666",
      "title": "Humanoids need orchestration to be useful in manufacturing, notes Flexxbotics CEO",
      "url": "https://www.therobotreport.com/humanoids-need-orchestration-useful-manufacturing-notes-flexxbotics-ceo/",
      "publishedAt": "Sun, 12 Oct 2025 12:30:12 +0000",
      "summary": "Before humanoids can take their place in factories, developers need to consider coordination and context, writes Tyler Bouchard. The post Humanoids need orchestration to be useful in manufacturing, notes Flexxbotics CEO appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585655",
      "title": "How machine vision is enhancing automation safety and efficiency",
      "url": "https://www.therobotreport.com/how-machine-vision-is-enhancing-automation-safety-efficiency/",
      "publishedAt": "Sat, 11 Oct 2025 12:30:23 +0000",
      "summary": "The most sophisticated machine vision systems have enabled new and emerging designs far more sophisticated than bin picking. The post How machine vision is enhancing automation safety and efficiency appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585652",
      "title": "Edge computing and AI: A conversation with Palladyne AI&#8217;s Ben Wolff",
      "url": "https://www.therobotreport.com/edge-computing-ai-conversation-ben-wolff/",
      "publishedAt": "Fri, 10 Oct 2025 19:48:45 +0000",
      "summary": "Palladyne AI focuses on simplifying robot programming, advancing swarming technology, and developing hardware-agnostic AI for diverse applications. The post Edge computing and AI: A conversation with Palladyne AI&#8217;s Ben Wolff appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585646",
      "title": "Intel expands Panther Lake processor edge applications to robotics",
      "url": "https://www.therobotreport.com/intel-expands-panther-lake-processor-edge-applications-to-robotics/",
      "publishedAt": "Fri, 10 Oct 2025 19:04:42 +0000",
      "summary": "Intel has the first Panther Lake SKU slated to ship before the end of the year, with broad market availability starting January 2026. The post Intel expands Panther Lake processor edge applications to robotics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585335",
      "title": "Robotics Summit 2026 call for speakers ends today",
      "url": "https://www.therobotreport.com/robotics-summit-2026-opens-call-for-speakers/",
      "publishedAt": "Fri, 10 Oct 2025 15:37:53 +0000",
      "summary": "The Robotics Summit &#038; Expo, the industry’s must-attend technical development event, returns to Boston in 2026 with deepened coverage, an expanded expo floor, and more. The post Robotics Summit 2026 call for speakers ends today appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585641",
      "title": "Revolute Robotics brings in $1.9M to deploy its driving, flying robots",
      "url": "https://www.therobotreport.com/revolute-robotics-brings-in-1-9m-deploy-driving-flying-robots/",
      "publishedAt": "Fri, 10 Oct 2025 14:33:59 +0000",
      "summary": "Revolute offers a unique robot that can drive on the ground to extend battery life and fly when it needs to get around obstacles. The post Revolute Robotics brings in $1.9M to deploy its driving, flying robots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=585612",
      "title": "Lucid Bots brings embodied AI to commercial painting",
      "url": "https://www.therobotreport.com/lucid-bots-brings-embodied-ai-commercial-painting/",
      "publishedAt": "Thu, 09 Oct 2025 19:53:35 +0000",
      "summary": "Lucid Bots has added painting capabilities to its Sherpa drone, automating commercial coating at scale to meet infrastructure demand. The post Lucid Bots brings embodied AI to commercial painting appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585628",
      "title": "Figure AI designs Figure 03 humanoid for AI, home use, and scaling",
      "url": "https://www.therobotreport.com/figure-ai-designs-figure-03-humanoid-ai-home-use-scaling/",
      "publishedAt": "Thu, 09 Oct 2025 18:21:54 +0000",
      "summary": "Figure 03 features a redesigned sensory suite and hand system, a form factor for household operation, and lower manufacturing costs. The post Figure AI designs Figure 03 humanoid for AI, home use, and scaling appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585624",
      "title": "Fundamental XR launches Fundamental Touch for wireless haptics",
      "url": "https://www.therobotreport.com/fundamental-xr-launches-fundamental-touch-for-wireless-haptics/",
      "publishedAt": "Thu, 09 Oct 2025 14:35:21 +0000",
      "summary": "Fundamental Touch is a new software architecture that enables wireless haptic feedback for high-fidelity, safer teleoperation. The post Fundamental XR launches Fundamental Touch for wireless haptics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.07882v2",
      "title": "Towards Proprioception-Aware Embodied Planning for Dual-Arm Humanoid\n  Robots",
      "url": "http://arxiv.org/abs/2510.07882v2",
      "publishedAt": "2025-10-09T07:35:12Z",
      "summary": "In recent years, Multimodal Large Language Models (MLLMs) have demonstrated the ability to serve as high-level planners, enabling robots to follow complex human instructions. However, their effectiveness, especially in long-horizon tasks involving dual-arm humanoid robots, remains limited.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.09653v2",
      "title": "Ultralytics YOLO Evolution: An Overview of YOLO26, YOLO11, YOLOv8 and\n  YOLOv5 Object Detectors for Computer Vision and Pattern Recognition",
      "url": "http://arxiv.org/abs/2510.09653v2",
      "publishedAt": "2025-10-06T23:28:44Z",
      "summary": "This paper presents a comprehensive overview of the Ultralytics YOLO(You Only Look Once) family of object detectors, focusing the architectural evolution, benchmarking, deployment perspectives, and future challenges.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.16370v2",
      "title": "Dual-Regularized Riccati Recursions for Interior-Point Optimal Control",
      "url": "http://arxiv.org/abs/2509.16370v2",
      "publishedAt": "2025-09-19T19:26:22Z",
      "summary": "We derive closed-form extensions of Riccati's recursions (both sequential and parallel) for solving dual-regularized LQR problems. We show how these methods can be used to solve general constrained, non-convex, discrete-time optimal control problems via a regularized interior point method, while guaranteeing that each step is a descent direction of an Augmented Barrier-Lagrangian merit function.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIA’s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI — the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world — is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.02512v3",
      "title": "QuaDreamer: Controllable Panoramic Video Generation for Quadruped Robots",
      "url": "http://arxiv.org/abs/2508.02512v3",
      "publishedAt": "2025-08-04T15:18:01Z",
      "summary": "Panoramic cameras, capturing comprehensive 360-degree environmental data, are suitable for quadruped robots in surrounding perception and interaction with complex environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82559",
      "title": "NVIDIA and Partners Highlight Next-Generation Robotics, Automation and AI Technologies at Automatica",
      "url": "https://blogs.nvidia.com/blog/automatica-robotics-2025/",
      "publishedAt": "Tue, 24 Jun 2025 09:00:30 +0000",
      "summary": "From the heart of Germany’s automotive sector to manufacturing hubs across France and Italy, Europe is embracing industrial AI and advanced AI-powered robotics to address labor shortages, boost productivity and fuel sustainable economic growth. Robotics companies are developing humanoid robots and collaborative systems that integrate AI into real-world manufacturing applications.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82396",
      "title": "Hexagon Taps NVIDIA Robotics and AI Software to Build and Deploy AEON, a New Humanoid",
      "url": "https://blogs.nvidia.com/blog/hexagon-robotics-ai-software-aeon-humanoid/",
      "publishedAt": "Tue, 17 Jun 2025 15:10:55 +0000",
      "summary": "As a global labor shortage leaves 50 million positions unfilled across industries like manufacturing and logistics, Hexagon — a global leader in measurement technologies — is developing humanoid robots that can lend a helping hand. Industrial sectors depend on skilled workers to perform a variety of error-prone tasks, including operating high-precision scanners for reality capture Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2506.13553v2",
      "title": "RelTopo: Multi-Level Relational Modeling for Driving Scene Topology\n  Reasoning",
      "url": "http://arxiv.org/abs/2506.13553v2",
      "publishedAt": "2025-06-16T14:40:28Z",
      "summary": "Accurate road topology reasoning is critical for autonomous driving, enabling effective navigation and adherence to traffic regulations. Central to this task are lane perception and topology reasoning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=82037",
      "title": "European Robot Makers Adopt NVIDIA Isaac, Omniverse and Halos to Develop Safe, Physical AI-Driven Robot Fleets",
      "url": "https://blogs.nvidia.com/blog/european-robot-makers-isaac-omniverse-halos-safe-physical-ai/",
      "publishedAt": "Wed, 11 Jun 2025 11:00:23 +0000",
      "summary": "In the face of growing labor shortages and need for sustainability, European manufacturers are racing to reinvent their processes to become software-defined and AI-driven. To achieve this, robot developers and industrial digitalization solution providers are working with NVIDIA to build safe, AI-driven robots and industrial technologies to drive modern, sustainable manufacturing. At NVIDIA GTC Paris Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82173",
      "title": "Germany Builds Its AI Autobahn With NVIDIA",
      "url": "https://blogs.nvidia.com/blog/germany-ai-factories/",
      "publishedAt": "Wed, 11 Jun 2025 10:25:33 +0000",
      "summary": "Germany is building on a long history of engineering innovation with new AI investments poised to transform the country’s economy — including the automotive, banking, manufacturing and robotics industries. The country is deploying tens of thousands of NVIDIA GPUs to power AI factories that generate intelligence for businesses and researchers, optimized AI software to run Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=81193",
      "title": "Researchers and Students in Türkiye Build AI, Robotics Tools to Boost Disaster Readiness",
      "url": "https://blogs.nvidia.com/blog/turkiye-disaster-readiness-ai-robotics/",
      "publishedAt": "Mon, 02 Jun 2025 15:00:11 +0000",
      "summary": "Since a 7.8-magnitude earthquake hit Syria and Türkiye two years ago — leaving 55,000 people dead, 130,000 injured and millions displaced from their homes — students, researchers and developers have been harnessing the latest AI robotics technologies to increase disaster preparedness in the region. The work is part of a Disaster Response Innovation and Education Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3013274",
      "title": "Hugging Face unveils two new humanoid robots",
      "url": "https://techcrunch.com/2025/05/29/hugging-face-unveils-two-new-humanoid-robots/",
      "publishedAt": "Thu, 29 May 2025 19:28:24 +0000",
      "summary": "AI dev platform Hugging Face continued its push into robotics on Thursday with the release of two new humanoid robots.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3011215",
      "title": "Why Intempus thinks robots should have a human physiological state",
      "url": "https://techcrunch.com/2025/05/25/why-intempus-thinks-robots-should-have-a-human-physiological-state/",
      "publishedAt": "Sun, 25 May 2025 14:00:00 +0000",
      "summary": "Teddy Warner, 19, has always been interested in robotics. His family was in the industry, and he says he &#8220;grew up&#8221; working in a machinist shop while in high school. Now Warner is building a robotics company of his own, Intempus, that looks to make robots a bit more human. Intempus is building tech to [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3010629",
      "title": "Serve is betting that food delivery and access to public markets are the keys to scaling robotics",
      "url": "https://techcrunch.com/podcast/serve-is-betting-that-food-delivery-and-access-to-public-markets-are-the-keys-to-scaling-robotics/",
      "publishedAt": "Wed, 21 May 2025 20:20:53 +0000",
      "summary": "“The only thing worse than being a public company CEO is being a private company CEO right now,” says Ali Kashani, co-founder and CEO of Serve Robotics. Access to capital, he argues, is everything in robotics. And in today’s “FOMO-driven” venture climate, securing funds is far from guaranteed. Backed by Nvidia and Uber, Serve recently [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.14975v2",
      "title": "Flattening Hierarchies with Policy Bootstrapping",
      "url": "http://arxiv.org/abs/2505.14975v2",
      "publishedAt": "2025-05-20T23:31:30Z",
      "summary": "Offline goal-conditioned reinforcement learning (GCRL) is a promising approach for pretraining generalist policies on large datasets of reward-free trajectories, akin to the self-supervised objectives used to train foundation models for computer vision and natural language processing.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80963",
      "title": "NVIDIA Research Breakthroughs Put Advanced Robots in Motion",
      "url": "https://blogs.nvidia.com/blog/nvidia-research-robotics-icra-2025/",
      "publishedAt": "Mon, 19 May 2025 15:00:53 +0000",
      "summary": "Across robot training and development, NVIDIA Research is uncovering breakthroughs in areas such as multimodal generative AI and synthetic data generation. The team’s latest innovations will be spotlighted at the International Conference on Robotics and Automation (ICRA), running May 19-23 in Atlanta. “ICRA has played a pivotal role in shaping the direction of robotics and Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80675",
      "title": "Foxconn Taps NVIDIA to Accelerate Physical and Digital Robotics for Global Healthcare Industry",
      "url": "https://blogs.nvidia.com/blog/foxconn-smart-hospital-robot/",
      "publishedAt": "Mon, 19 May 2025 04:50:42 +0000",
      "summary": "The world’s largest electronics manufacturer is building smart hospital solutions using NVIDIA technologies from the data center to the edge.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80740",
      "title": "That’s One Smart Hospital! Taiwan Medical Centers Deploy Life-Saving Innovations With NVIDIA System-Builder Partners",
      "url": "https://blogs.nvidia.com/blog/taiwan-medical-centers-system-builder-partners/",
      "publishedAt": "Mon, 19 May 2025 04:50:09 +0000",
      "summary": "Leading healthcare organizations across the globe are using agentic AI, robotics and digital twins of medical environments to enhance surgical precision, boost workflow efficiency, improve medical diagnoses and more. Physical AI and humanoid robots in hospitals have the potential to automate routine tasks, assist with patient care and address workforce shortages. This is especially crucial Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80491",
      "title": "NVIDIA Omniverse Digital Twins Help Taiwan Manufacturers Drive Golden Age of Industrial AI",
      "url": "https://blogs.nvidia.com/blog/omniverse-digital-twins-taiwan-manufacturers-physical-ai/",
      "publishedAt": "Mon, 19 May 2025 04:30:03 +0000",
      "summary": "NVIDIA and Taiwan’s manufacturing ecosystem, including Delta Electronics, Foxconn, TSMC and Wistron, are showcasing this week at COMPUTEX in Taipei the crucial role digital twins play in accelerating industrial AI. These electronics, semiconductor and robotics manufacturing leaders are using Universal Scene Description (OpenUSD) and NVIDIA Omniverse libraries and blueprints to develop physically based digital twins.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80499",
      "title": "NVIDIA Partners Showcase Cutting-Edge Robotic and Industrial AI Solutions at Automate 2025",
      "url": "https://blogs.nvidia.com/blog/robotics-industrial-ai-automate/",
      "publishedAt": "Tue, 13 May 2025 13:45:00 +0000",
      "summary": "As the manufacturing industry faces challenges — such as labor shortages, reshoring and inconsistent operational strategies — AI-powered robots present a significant opportunity to accelerate industrial automation. At Automate, the largest robotics and automation event in North America, robotics leaders KUKA, Standard Bots, Universal Robots (UR) and Vention are showcasing hardware and robots powered by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3004901",
      "title": "Amazon offers peek at new human jobs in an AI bot world",
      "url": "https://techcrunch.com/2025/05/11/amazon-offers-peek-at-new-human-jobs-in-an-ai-bot-world/",
      "publishedAt": "Sun, 11 May 2025 14:00:00 +0000",
      "summary": "The tech industry seems to have two thoughts when it comes to where human workers fit into the AI-powered world they are creating: Either they think that all the jobs, except perhaps their own, will be done by bots. (VC Marc Andreessen seems to think that his work as an investor could never be automated). [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2505.00535v2",
      "title": "Moving through Cartesian products, coronas and joins in general position",
      "url": "http://arxiv.org/abs/2505.00535v2",
      "publishedAt": "2025-05-01T14:00:59Z",
      "summary": "The general position problem asks for large sets of vertices such that no three vertices of the set lie on a common shortest path. Recently a dynamic version of this problem was defined, called the \\emph{mobile general position problem}, in which a collection of robots must visit all the vertices of the graph whilst remaining in general position.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=80269",
      "title": "Wandercraft Begins Clinical Trials for Physical AI-Powered Personal Exoskeleton",
      "url": "https://blogs.nvidia.com/blog/physical-ai-exoskeleton/",
      "publishedAt": "Thu, 01 May 2025 13:00:30 +0000",
      "summary": "For Nicolas Simon, advancing the field of robotics is a personal mission that could change his siblings’ lives. Two-thirds of Simon’s family members use wheelchairs due to mobility challenges related to Charcot-Marie-Tooth disease, an inherited genetic condition. As an engineering student and robotics club chair at France’s École Polytechnique, he saw the opportunity to build Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2504.14556v2",
      "title": "LLM-Enabled In-Context Learning for Data Collection Scheduling in\n  UAV-assisted Sensor Networks",
      "url": "http://arxiv.org/abs/2504.14556v2",
      "publishedAt": "2025-04-20T10:05:07Z",
      "summary": "Unmanned Aerial Vehicles (UAVs) are increasingly being utilized in various private and commercial applications, e.g., traffic control, parcel delivery, and Search and Rescue (SAR) missions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=79551",
      "title": "National Robotics Week — Latest Physical AI Research, Breakthroughs and Resources",
      "url": "https://blogs.nvidia.com/blog/national-robotics-week-2025/",
      "publishedAt": "Sat, 12 Apr 2025 16:00:05 +0000",
      "summary": "This National Robotics Week, NVIDIA highlighted the pioneering technologies that are shaping the future of intelligent machines and driving progress across manufacturing, healthcare, logistics and more. Advancements in robotics simulation and robot learning are driving this fundamental shift in the industry. Plus, the emergence of world foundation models is accelerating the evolution of AI-enabled robots Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2504.02477v3",
      "title": "Multimodal Fusion and Vision-Language Models: A Survey for Robot Vision",
      "url": "http://arxiv.org/abs/2504.02477v3",
      "publishedAt": "2025-04-03T10:53:07Z",
      "summary": "Robot vision has greatly benefited from advancements in multimodal fusion techniques and vision-language models (VLMs). We adopt a task-oriented perspective to systematically review the applications and advancements of multimodal fusion methods and VLMs in the field of robot vision.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2503.15225v2",
      "title": "A Personalized Data-Driven Generative Model of Human Repetitive Motion",
      "url": "http://arxiv.org/abs/2503.15225v2",
      "publishedAt": "2025-03-19T14:03:20Z",
      "summary": "The deployment of autonomous virtual avatars (in extended reality) and robots in human group activities -- such as rehabilitation therapy, sports, and manufacturing -- is expected to increase as these technologies become more pervasive. Designing cognitive architectures and control strategies to drive these agents requires realistic models of human motion.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2411.16776v2",
      "title": "SynDiff-AD: Improving Semantic Segmentation and End-to-End Autonomous\n  Driving with Synthetic Data from Latent Diffusion Models",
      "url": "http://arxiv.org/abs/2411.16776v2",
      "publishedAt": "2024-11-25T07:24:12Z",
      "summary": "In recent years, significant progress has been made in collecting large-scale datasets to improve segmentation and autonomous driving models. These large-scale datasets are often dominated by common environmental conditions such as \"Clear and Day\" weather, leading to decreased performance in under-represented conditions like \"Rainy and Night\".",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2410.08650v3",
      "title": "Extended Friction Models for the Physics Simulation of Servo Actuators",
      "url": "http://arxiv.org/abs/2410.08650v3",
      "publishedAt": "2024-10-11T09:19:35Z",
      "summary": "Accurate physical simulation is crucial for the development and validation of control algorithms in robotic systems. Recent works in Reinforcement Learning (RL) take notably advantage of extensive simulations to produce efficient robot control. State-of-the-art servo actuator models generally fail at capturing the complex friction dynamics of these systems.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2410.05038v3",
      "title": "GARField: Addressing the visual Sim-to-Real gap in garment manipulation\n  with mesh-attached radiance fields",
      "url": "http://arxiv.org/abs/2410.05038v3",
      "publishedAt": "2024-10-07T13:50:15Z",
      "summary": "While humans intuitively manipulate garments and other textile items swiftly and accurately, it is a significant challenge for robots. A factor crucial to human performance is the ability to imagine, a priori, the intended result of the manipulation intents and hence develop predictions on the garment pose.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    }
  ]
}