{
  "generatedAt": "2025-12-03T21:06:48.327Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=586225",
      "title": "Ubicept replaces blurry CMOS with sharp SPAD imaging",
      "url": "https://www.therobotreport.com/ubicept-replaces-blurry-cmos-with-sharp-spad-imaging/",
      "publishedAt": "Wed, 03 Dec 2025 15:18:04 +0000",
      "summary": "Ubicept says its new toolkit uses SPAD sensors for low-light imaging and reduced motion blur in videos. The post Ubicept replaces blurry CMOS with sharp SPAD imaging appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586224",
      "title": "EY rolls out physical AI platform, opens EY.ai Lab, and names global robotics lead",
      "url": "https://www.therobotreport.com/ey-rolls-out-physical-ai-platform-opens-ey-ai-lab-appoints-global-robotics-lead/",
      "publishedAt": "Wed, 03 Dec 2025 12:01:39 +0000",
      "summary": "EY does not make robots, but it is working on a platform and a lab to help companies simulate and manage physical AI. The post EY rolls out physical AI platform, opens EY.ai Lab, and names global robotics lead appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586219",
      "title": "SoftBank and Yaskawa to collaborate on physical AI for the office",
      "url": "https://www.therobotreport.com/softbank-yaskawa-electric-collaborate-physical-ai-office/",
      "publishedAt": "Tue, 02 Dec 2025 20:51:45 +0000",
      "summary": "Yaskawa Electric and Softbank plan to enable human-robot collaboration and more tasks by integrating AI and communications. The post SoftBank and Yaskawa to collaborate on physical AI for the office appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.03044v1",
      "title": "Video2Act: A Dual-System Video Diffusion Policy with Robotic Spatio-Motional Modeling",
      "url": "https://arxiv.org/abs/2512.03044v1",
      "publishedAt": "2025-12-02T18:59:53Z",
      "summary": "Robust perception and dynamics modeling are fundamental to real-world robotic policy learning. Recent methods employ video diffusion models (VDMs) to enhance robotic policies, improving their understanding and modeling of the physical world. However, existing approaches overlook the coherent and physically consistent motion representations inherently encoded across frames in VDMs.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.03028v1",
      "title": "SMP: Reusable Score-Matching Motion Priors for Physics-Based Character Control",
      "url": "https://arxiv.org/abs/2512.03028v1",
      "publishedAt": "2025-12-02T18:54:12Z",
      "summary": "Data-driven motion priors that can guide agents toward producing naturalistic behaviors play a pivotal role in creating life-like virtual characters. Adversarial imitation learning has been a highly effective method for learning motion priors from reference motion data.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586217",
      "title": "U.S. backs Zipline with $150M for drone delivery in Africa",
      "url": "https://www.therobotreport.com/us-backs-zipline-with-150m-for-drone-delivery-in-africa/",
      "publishedAt": "Tue, 02 Dec 2025 18:53:03 +0000",
      "summary": "Zipline said the deal could triple the number of hospitals and health facilities it serves from 5,000 to 15,000. The post U.S. backs Zipline with $150M for drone delivery in Africa appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.03010v1",
      "title": "SurfFill: Completion of LiDAR Point Clouds via Gaussian Surfel Splatting",
      "url": "https://arxiv.org/abs/2512.03010v1",
      "publishedAt": "2025-12-02T18:35:54Z",
      "summary": "LiDAR-captured point clouds are often considered the gold standard in active 3D reconstruction. While their accuracy is exceptional in flat regions, the capturing is susceptible to miss small geometric structures and may fail with dark, absorbent materials. Alternatively, capturing multiple photos of the scene and applying 3D photogrammetry can infer these details as they often represent feature-rich regions.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.03004v1",
      "title": "DGGT: Feedforward 4D Reconstruction of Dynamic Driving Scenes using Unposed Images",
      "url": "https://arxiv.org/abs/2512.03004v1",
      "publishedAt": "2025-12-02T18:29:18Z",
      "summary": "Autonomous driving needs fast, scalable 4D reconstruction and re-simulation for training and evaluation, yet most methods for dynamic driving scenes still rely on per-scene optimization, known camera calibration, or short frame windows, making them slow and impractical.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02982v1",
      "title": "U4D: Uncertainty-Aware 4D World Modeling from LiDAR Sequences",
      "url": "https://arxiv.org/abs/2512.02982v1",
      "publishedAt": "2025-12-02T17:59:57Z",
      "summary": "Modeling dynamic 3D environments from LiDAR sequences is central to building reliable 4D worlds for autonomous driving and embodied AI. Existing generative frameworks, however, often treat all spatial regions uniformly, overlooking the varying uncertainty across real-world scenes. This uniform generation leads to artifacts in complex or ambiguous regions, limiting realism and temporal stability.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02972v1",
      "title": "BEVDilation: LiDAR-Centric Multi-Modal Fusion for 3D Object Detection",
      "url": "https://arxiv.org/abs/2512.02972v1",
      "publishedAt": "2025-12-02T17:50:33Z",
      "summary": "Integrating LiDAR and camera information in the bird's eye view (BEV) representation has demonstrated its effectiveness in 3D object detection. However, because of the fundamental disparity in geometric accuracy between these sensors, indiscriminate fusion in previous methods often leads to degraded performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02966v1",
      "title": "Lumos: Let there be Language Model System Certification",
      "url": "https://arxiv.org/abs/2512.02966v1",
      "publishedAt": "2025-12-02T17:44:47Z",
      "summary": "We introduce the first principled framework, Lumos, for specifying and formally certifying Language Model System (LMS) behaviors. Lumos is an imperative probabilistic programming DSL over graphs, with constructs to generate independent and identically distributed prompts for LMS. It offers a structured view of prompt distributions via graphs, forming random prompts from sampled subgraphs.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02951v1",
      "title": "Experimental Characterization of Fingertip Trajectory following for a 3-DoF Series-Parallel Hybrid Robotic Finger",
      "url": "https://arxiv.org/abs/2512.02951v1",
      "publishedAt": "2025-12-02T17:23:44Z",
      "summary": "Task-space control of robotic fingers is a critical enabler of dexterous manipulation, as manipulation objectives are most naturally specified in terms of fingertip motions and applied forces rather than individual joint angles.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02932v1",
      "title": "EGGS: Exchangeable 2D/3D Gaussian Splatting for Geometry-Appearance Balanced Novel View Synthesis",
      "url": "https://arxiv.org/abs/2512.02932v1",
      "publishedAt": "2025-12-02T17:01:00Z",
      "summary": "Novel view synthesis (NVS) is crucial in computer vision and graphics, with wide applications in AR, VR, and autonomous driving. While 3D Gaussian Splatting (3DGS) enables real-time rendering with high appearance fidelity, it suffers from multi-view inconsistencies, limiting geometric accuracy. In contrast, 2D Gaussian Splatting (2DGS) enforces multi-view consistency but compromises texture details.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02902v1",
      "title": "VLA Models Are More Generalizable Than You Think: Revisiting Physical and Spatial Modeling",
      "url": "https://arxiv.org/abs/2512.02902v1",
      "publishedAt": "2025-12-02T16:16:13Z",
      "summary": "Vision-language-action (VLA) models achieve strong in-distribution performance but degrade sharply under novel camera viewpoints and visual perturbations. We show that this brittleness primarily arises from misalignment in Spatial Modeling, rather than Physical Modeling. To address this, we propose a one-shot adaptation framework that recalibrates visual representations through lightweight, learnable updates.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02897v1",
      "title": "Polar Perspectives: Evaluating 2-D LiDAR Projections for Robust Place Recognition with Visual Foundation Models",
      "url": "https://arxiv.org/abs/2512.02897v1",
      "publishedAt": "2025-12-02T16:04:17Z",
      "summary": "This work presents a systematic investigation into how alternative LiDAR-to-image projections affect metric place recognition when coupled with a state-of-the-art vision foundation model. We introduce a modular retrieval pipeline that controls for backbone, aggregation, and evaluation protocol, thereby isolating the influence of the 2-D projection itself.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87946",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "publishedAt": "Tue, 02 Dec 2025 16:00:27 +0000",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02858v1",
      "title": "PAC-Bayesian Optimal Control with Stability and Generalization Guarantees",
      "url": "https://arxiv.org/abs/2512.02858v1",
      "publishedAt": "2025-12-02T15:17:34Z",
      "summary": "Stochastic Nonlinear Optimal Control (SNOC) seeks to minimize a cost function that accounts for random disturbances acting on a nonlinear dynamical system. Since the expectation over all disturbances is generally intractable, a common surrogate is the empirical cost, obtained by averaging over a finite dataset of sampled noise realizations.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02851v1",
      "title": "SwarmDiffusion: End-To-End Traversability-Guided Diffusion for Embodiment-Agnostic Navigation of Heterogeneous Robots",
      "url": "https://arxiv.org/abs/2512.02851v1",
      "publishedAt": "2025-12-02T15:09:19Z",
      "summary": "Visual traversability estimation is critical for autonomous navigation, but existing VLM-based methods rely on hand-crafted prompts, generalize poorly across embodiments, and output only traversability maps, leaving trajectory generation to slow external planners.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02844v1",
      "title": "VLM as Strategist: Adaptive Generation of Safety-critical Testing Scenarios via Guided Diffusion",
      "url": "https://arxiv.org/abs/2512.02844v1",
      "publishedAt": "2025-12-02T14:56:57Z",
      "summary": "The safe deployment of autonomous driving systems (ADSs) relies on comprehensive testing and evaluation. However, safety-critical scenarios that can effectively expose system vulnerabilities are extremely sparse in the real world.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02834v1",
      "title": "Steering Vision-Language-Action Models as Anti-Exploration: A Test-Time Scaling Approach",
      "url": "https://arxiv.org/abs/2512.02834v1",
      "publishedAt": "2025-12-02T14:42:54Z",
      "summary": "Vision-Language-Action (VLA) models, trained via flow-matching or diffusion objectives, excel at learning complex behaviors from large-scale, multi-modal datasets (e.g., human teleoperation, scripted policies).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02810v1",
      "title": "Phase-Adaptive LLM Framework with Multi-Stage Validation for Construction Robot Task Allocation: A Systematic Benchmark Against Traditional Optimization Algorithms",
      "url": "https://arxiv.org/abs/2512.02810v1",
      "publishedAt": "2025-12-02T14:23:36Z",
      "summary": "Multi-robot task allocation in construction automation has traditionally relied on optimization methods such as Dynamic Programming and Reinforcement Learning. This research introduces the LangGraph-based Task Allocation Agent (LTAA), an LLM-driven framework that integrates phase-adaptive allocation strategies, multi-stage validation with hierarchical retries, and dynamic prompting for efficient robot coordination.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "LLM",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02787v1",
      "title": "Diagnose, Correct, and Learn from Manipulation Failures via Visual Symbols",
      "url": "https://arxiv.org/abs/2512.02787v1",
      "publishedAt": "2025-12-02T14:02:42Z",
      "summary": "Vision-Language-Action (VLA) models have recently achieved remarkable progress in robotic manipulation, yet they remain limited in failure diagnosis and learning from failures. Additionally, existing failure datasets are mostly generated programmatically in simulation, which limits their generalization to the real world.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02777v1",
      "title": "CogDrive: Cognition-Driven Multimodal Prediction-Planning Fusion for Safe Autonomy",
      "url": "https://arxiv.org/abs/2512.02777v1",
      "publishedAt": "2025-12-02T13:53:18Z",
      "summary": "Safe autonomous driving in mixed traffic requires a unified understanding of multimodal interactions and dynamic planning under uncertainty. Existing learning based approaches struggle to capture rare but safety critical behaviors, while rule based systems often lack adaptability in complex interactions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02729v1",
      "title": "RoboWheel: A Data Engine from Real-World Human Demonstrations for Cross-Embodiment Robotic Learning",
      "url": "https://arxiv.org/abs/2512.02729v1",
      "publishedAt": "2025-12-02T13:10:16Z",
      "summary": "We introduce Robowheel, a data engine that converts human hand object interaction (HOI) videos into training-ready supervision for cross morphology robotic learning. From monocular RGB or RGB-D inputs, we perform high precision HOI reconstruction and enforce physical plausibility via a reinforcement learning (RL) optimizer that refines hand object relative poses under contact and penetration constraints.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.02698v1",
      "title": "Adaptive hydrogels with spatiotemporal stiffening using pH-modulating enzymes",
      "url": "https://arxiv.org/abs/2512.02698v1",
      "publishedAt": "2025-12-02T12:28:31Z",
      "summary": "Adaptive material systems that autonomously respond to external stimuli are crucial for advancing next-generation smart devices. Biological systems achieve autonomous behavior by utilizing chemical energy from out-of-equilibrium reactions to power life-like functions without requiring external energy inputs.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.02686v1",
      "title": "ClimaOoD: Improving Anomaly Segmentation via Physically Realistic Synthetic Data",
      "url": "https://arxiv.org/abs/2512.02686v1",
      "publishedAt": "2025-12-02T12:14:19Z",
      "summary": "Anomaly segmentation seeks to detect and localize unknown or out-of-distribution (OoD) objects that fall outside predefined semantic classes a capability essential for safe autonomous driving. However, the scarcity and limited diversity of anomaly data severely constrain model generalization in open-world environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586209",
      "title": "Humanoid says its first bipedal robot can start walking just 48 hours after assembly",
      "url": "https://www.therobotreport.com/humanoid-sayss-first-bipedal-robot-can-start-walking-just-48-hours-after-assembly/",
      "publishedAt": "Tue, 02 Dec 2025 12:00:38 +0000",
      "summary": "The bipedal robot expands Humanoid’s portfolio, following the wheeled Alpha platform, which has completed its first commercial POCs. The post Humanoid says its first bipedal robot can start walking just 48 hours after assembly appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586215",
      "title": "AILOS Robotics introduces drive technology to make robots lighter, more agile, and safer",
      "url": "https://www.therobotreport.com/ailos-robotics-introduces-drive-technology-making-robots-lighter-more-agile-safer/",
      "publishedAt": "Tue, 02 Dec 2025 05:01:47 +0000",
      "summary": "VUB spinoff AILOS Robotics said its patented gearbox heralds a new era for humanoids, cobots, and wearable robotics. The post AILOS Robotics introduces drive technology to make robots lighter, more agile, and safer appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586206",
      "title": "iRobot debt acquired by contract manufacturer as bankruptcy looms",
      "url": "https://www.therobotreport.com/irobot-debt-acquired-by-contract-manufacturer-as-bankruptcy-looms/",
      "publishedAt": "Mon, 01 Dec 2025 22:33:36 +0000",
      "summary": "iRobot negotiations with another potential acquirer fell through, and its main creditor has set a deadline of Jan. 15 for certain conditions. The post iRobot debt acquired by contract manufacturer as bankruptcy looms appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586196",
      "title": "Top 10 robotics developments of November 2025",
      "url": "https://www.therobotreport.com/top-10-robotics-developments-november-2025/",
      "publishedAt": "Mon, 01 Dec 2025 21:20:37 +0000",
      "summary": "From promising startups to setbacks for iRobot and Teradyne, here are the top robotics stories of November 2025. The post Top 10 robotics developments of November 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586199",
      "title": "ROBOTERA gets Series A funding, partners with UNIDO on embodied intelligence",
      "url": "https://www.therobotreport.com/robotera-gets-series-a-funding-partners-unido-embodied-intelligence/",
      "publishedAt": "Mon, 01 Dec 2025 20:08:49 +0000",
      "summary": "ROBOTERA has raised funding toward general-purpose humanoid and service robots, which it is developing with UN support. The post ROBOTERA gets Series A funding, partners with UNIDO on embodied intelligence appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.01987v2",
      "title": "Forecasting in Offline Reinforcement Learning for Non-stationary Environments",
      "url": "https://arxiv.org/abs/2512.01987v2",
      "publishedAt": "2025-12-01T18:45:05Z",
      "summary": "Offline Reinforcement Learning (RL) provides a promising avenue for training policies from pre-collected datasets when gathering additional interaction data is infeasible. However, existing offline RL methods often assume stationarity or only consider synthetic perturbations at test time, assumptions that often fail in real-world scenarios characterized by abrupt, time-varying offsets.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.01946v2",
      "title": "Guardian: Detecting Robotic Planning and Execution Errors with Vision-Language Models",
      "url": "https://arxiv.org/abs/2512.01946v2",
      "publishedAt": "2025-12-01T17:57:27Z",
      "summary": "Robust robotic manipulation requires reliable failure detection and recovery. Although current Vision-Language Models (VLMs) show promise, their accuracy and generalization are limited by the scarcity of failure data. To address this data gap, we propose an automatic robot failure synthesis approach that procedurally perturbs successful trajectories to generate diverse planning and execution failures.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87911",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "publishedAt": "Mon, 01 Dec 2025 17:00:48 +0000",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.01856v2",
      "title": "Is Image-based Object Pose Estimation Ready to Support Grasping?",
      "url": "https://arxiv.org/abs/2512.01856v2",
      "publishedAt": "2025-12-01T16:39:39Z",
      "summary": "We present a framework for evaluating 6-DoF instance-level object pose estimators, focusing on those that require a single RGB (not RGB-D) image as input. Besides gaining intuition about how accurate these estimators are, we are interested in the degree to which they can serve as the sole perception mechanism for robotic grasping.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.01830v2",
      "title": "OpenREAD: Reinforced Open-Ended Reasoning for End-to-End Autonomous Driving with LLM-as-Critic",
      "url": "https://arxiv.org/abs/2512.01830v2",
      "publishedAt": "2025-12-01T16:11:57Z",
      "summary": "Recently, two-stage fine-tuning strategies, e.g., acquiring essential driving knowledge through supervised fine-tuning (SFT) and further enhancing decision-making and planning via reinforcement fine-tuning (RFT), have shown strong potential in advancing the knowledge-driven autonomous driving (AD) paradigm.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586195",
      "title": "MassRobotics expands physical AI fellowship with AWS and NVIDIA",
      "url": "https://www.therobotreport.com/massrobotics-expands-physical-ai-fellowship-with-aws-and-nvidia/",
      "publishedAt": "Mon, 01 Dec 2025 16:04:26 +0000",
      "summary": "The Physical AI Fellowship provides robotics and AI developers with access to MassRobotics, AWs, and NVIDIA resources and mentorship. The post MassRobotics expands physical AI fellowship with AWS and NVIDIA appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.01801v2",
      "title": "GR-RL: Going Dexterous and Precise for Long-Horizon Robotic Manipulation",
      "url": "https://arxiv.org/abs/2512.01801v2",
      "publishedAt": "2025-12-01T15:33:59Z",
      "summary": "We present GR-RL, a robotic learning framework that turns a generalist vision-language-action (VLA) policy into a highly capable specialist for long-horizon dexterous manipulation. Assuming the optimality of human demonstrations is core to existing VLA policies. However, we claim that in highly dexterous and precise manipulation tasks, human demonstrations are noisy and suboptimal.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586127",
      "title": "Popular AI models aren’t ready to safely run robots, say CMU researchers",
      "url": "https://www.therobotreport.com/popular-ai-models-arent-ready-safely-run-robots-say-cmu-researchers/",
      "publishedAt": "Sun, 30 Nov 2025 15:00:51 +0000",
      "summary": "CMU and King's College London evaluated how robots using LLMs behave when they have access to personal information. The post Popular AI models aren’t ready to safely run robots, say CMU researchers appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586190",
      "title": "ARM Institute earns $87M agreement with the Air Force Research Lab",
      "url": "https://www.therobotreport.com/arm-institute-earns-87m-agreement-air-force-research-lab/",
      "publishedAt": "Sat, 29 Nov 2025 15:00:11 +0000",
      "summary": "The ARM Institute will perform research, development, testing, and evaluation to advance dual-use robotics for the U.S. Air Force. The post ARM Institute earns $87M agreement with the Air Force Research Lab appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.00470v2",
      "title": "LAP: Fast LAtent Diffusion Planner with Fine-Grained Feature Distillation for Autonomous Driving",
      "url": "https://arxiv.org/abs/2512.00470v2",
      "publishedAt": "2025-11-29T12:45:05Z",
      "summary": "Diffusion models have demonstrated strong capabilities for modeling human-like driving behaviors in autonomous driving, but their iterative sampling process induces substantial latency, and operating directly on raw trajectory points forces the model to spend capacity on low-level kinematics, rather than high-level multi-modal semantics.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586178",
      "title": "Surgical robotics market to double by 2029",
      "url": "https://www.therobotreport.com/surgical-robotics-market-to-double-by-2029-report/",
      "publishedAt": "Fri, 28 Nov 2025 14:30:02 +0000",
      "summary": "New report from The Robot Report's sister publication delivers detailed forecasts, market share insights, and competitive breakdowns about the global surgical robotics market. The post Surgical robotics market to double by 2029 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586191",
      "title": "Advantech integrates compute with D3 Embedded sensing for mobile robots",
      "url": "https://www.therobotreport.com/advantech-integrates-compute-with-d3-embedded-sensing-for-mobile-robots/",
      "publishedAt": "Fri, 28 Nov 2025 13:30:43 +0000",
      "summary": "D3 Embedded and Advantech said their integrated vision systems can help autonomous mobile robots come to market faster. The post Advantech integrates compute with D3 Embedded sensing for mobile robots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586183",
      "title": "Inside Glacier&#8217;s mission to modernize recycling",
      "url": "https://www.therobotreport.com/inside-glaciers-mission-to-modernize-recycling/",
      "publishedAt": "Wed, 26 Nov 2025 18:45:48 +0000",
      "summary": "Glacier's robots promise to help the circular economy become more efficient and to improve sustainability. The post Inside Glacier&#8217;s mission to modernize recycling appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.18960v2",
      "title": "AVA-VLA: Improving Vision-Language-Action models with Active Visual Attention",
      "url": "https://arxiv.org/abs/2511.18960v2",
      "publishedAt": "2025-11-24T10:22:28Z",
      "summary": "Vision-Language-Action (VLA) models have demonstrated remarkable capabilities in embodied AI tasks. However, existing VLA models, often built upon Vision-Language Models (VLMs), typically process dense visual inputs independently at each timestep. This approach implicitly models the task as a Markov Decision Process (MDP).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.18538v3",
      "title": "From Code Foundation Models to Agents and Applications: A Practical Guide to Code Intelligence",
      "url": "https://arxiv.org/abs/2511.18538v3",
      "publishedAt": "2025-11-23T17:09:34Z",
      "summary": "Large language models (LLMs) have fundamentally transformed automated software development by enabling direct translation of natural language descriptions into functional code, driving commercial adoption through tools like Github Copilot (Microsoft), Cursor (Anysphere), Trae (ByteDance), and Claude Code (Anthropic).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3069331",
      "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
      "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/",
      "publishedAt": "Thu, 20 Nov 2025 18:00:01 +0000",
      "summary": "Point One Navigation, now valued at $230 million, is building out well beyond automotive.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87636",
      "title": "Powering AI Superfactories, NVIDIA and Microsoft Integrate Latest Technologies for Inference, Cybersecurity, Physical AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-microsoft-ai-superfactories/",
      "publishedAt": "Tue, 18 Nov 2025 20:00:22 +0000",
      "summary": "Timed with the Microsoft Ignite conference running this week, NVIDIA is expanding its collaboration with Microsoft, including through the adoption of next-generation NVIDIA Spectrum-X Ethernet switches for the new Microsoft Fairwater AI superfactory, powered by the NVIDIA Blackwell platform. The collaboration brings new integrations across Microsoft 365 Copilot, as well as the public preview of Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87325",
      "title": "AI On: 3 Ways to Bring Agentic AI to Computer Vision Applications",
      "url": "https://blogs.nvidia.com/blog/ways-to-bring-agentic-ai-to-computer-vision-applications/",
      "publishedAt": "Thu, 13 Nov 2025 18:50:06 +0000",
      "summary": "Editor’s note: This post is part of the AI On blog series, which explores the latest techniques and real-world applications of agentic AI, chatbots and copilots. The series also highlights the NVIDIA software and hardware powering advanced AI agents, which form the foundation of AI query engines that gather insights and perform tasks to transform Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3066690",
      "title": "Why a researcher is building robots that look and act like bats",
      "url": "https://techcrunch.com/2025/11/12/why-a-researcher-is-building-robots-that-look-and-act-like-bats/",
      "publishedAt": "Wed, 12 Nov 2025 17:12:07 +0000",
      "summary": "These palm-sized robots use ultrasound signals to navigate harsh conditions in search and rescue missions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.08294v2",
      "title": "SkelSplat: Robust Multi-view 3D Human Pose Estimation with Differentiable Gaussian Rendering",
      "url": "https://arxiv.org/abs/2511.08294v2",
      "publishedAt": "2025-11-11T14:28:43Z",
      "summary": "Accurate 3D human pose estimation is fundamental for applications such as augmented reality and human-robot interaction. State-of-the-art multi-view methods learn to fuse predictions across views by training on large annotated datasets, leading to poor generalization when the test scenario differs.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2511.03576v2",
      "title": "Multi-User Personalisation in Human-Robot Interaction: Resolving Preference Conflicts Using Gradual Argumentation",
      "url": "https://arxiv.org/abs/2511.03576v2",
      "publishedAt": "2025-11-05T15:59:30Z",
      "summary": "While personalisation in Human-Robot Interaction (HRI) has advanced significantly, most existing approaches focus on single-user adaptation, overlooking scenarios involving multiple stakeholders with potentially conflicting preferences.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot – and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models — which power robots, autonomous vehicles and other intelligent machines — must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on What’s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness 🔗 A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment can’t be limited to a few urban tech hubs — it must reach every community, university and state. That’s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology — contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86265",
      "title": "NVIDIA Contributes to Open Frameworks for Next-Generation Robotics Development",
      "url": "https://blogs.nvidia.com/blog/roscon-2025-open-framework-robotics/",
      "publishedAt": "Mon, 27 Oct 2025 00:00:55 +0000",
      "summary": "This year’s ROSCon conference heads to Singapore, bringing together the global robotics developer community behind Robot Operating System (ROS) — the world’s most widely adopted open framework for building robots. At the conference, running through Wednesday, Oct. 29, NVIDIA announced collaborations with partners and the Open Source Robotics Alliance (OSRA), as well as new robotics Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.22386v2",
      "title": "On the complexity of the free space of a translating box in R^3",
      "url": "https://arxiv.org/abs/2510.22386v2",
      "publishedAt": "2025-10-25T18:07:02Z",
      "summary": "Consider a convex polyhedral robot $B$ that can translate (without rotating) amidst a finite set of non-moving polyhedral obstacles in $\\mathbb R^3$. The \"free space\" $\\mathcal F$ of $B$ is the set of all positions in which $B$ is disjoint from the interior of every obstacle.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIA’s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI — the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world — is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.02443v2",
      "title": "PRIMU: Uncertainty Estimation for Novel Views in Gaussian Splatting from Primitive-Based Representations of Error and Coverage",
      "url": "https://arxiv.org/abs/2508.02443v2",
      "publishedAt": "2025-08-04T14:02:20Z",
      "summary": "We introduce Primitive-based Representations of Uncertainty (PRIMU), a post-hoc uncertainty estimation (UE) framework for Gaussian Splatting (GS). Reliable UE is essential for deploying GS in safety-critical domains such as robotics and medicine. Existing approaches typically estimate Gaussian-primitive variances and rely on the rendering process to obtain pixel-wise uncertainties.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82559",
      "title": "NVIDIA and Partners Highlight Next-Generation Robotics, Automation and AI Technologies at Automatica",
      "url": "https://blogs.nvidia.com/blog/automatica-robotics-2025/",
      "publishedAt": "Tue, 24 Jun 2025 09:00:30 +0000",
      "summary": "From the heart of Germany’s automotive sector to manufacturing hubs across France and Italy, Europe is embracing industrial AI and advanced AI-powered robotics to address labor shortages, boost productivity and fuel sustainable economic growth. Robotics companies are developing humanoid robots and collaborative systems that integrate AI into real-world manufacturing applications.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82396",
      "title": "Hexagon Taps NVIDIA Robotics and AI Software to Build and Deploy AEON, a New Humanoid",
      "url": "https://blogs.nvidia.com/blog/hexagon-robotics-ai-software-aeon-humanoid/",
      "publishedAt": "Tue, 17 Jun 2025 15:10:55 +0000",
      "summary": "As a global labor shortage leaves 50 million positions unfilled across industries like manufacturing and logistics, Hexagon — a global leader in measurement technologies — is developing humanoid robots that can lend a helping hand. Industrial sectors depend on skilled workers to perform a variety of error-prone tasks, including operating high-precision scanners for reality capture Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3013274",
      "title": "Hugging Face unveils two new humanoid robots",
      "url": "https://techcrunch.com/2025/05/29/hugging-face-unveils-two-new-humanoid-robots/",
      "publishedAt": "Thu, 29 May 2025 19:28:24 +0000",
      "summary": "AI dev platform Hugging Face continued its push into robotics on Thursday with the release of two new humanoid robots.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.19238v2",
      "title": "Efficient Policy Optimization in Robust Constrained MDPs with Iteration Complexity Guarantees",
      "url": "https://arxiv.org/abs/2505.19238v2",
      "publishedAt": "2025-05-25T17:27:06Z",
      "summary": "Constrained decision-making is essential for designing safe policies in real-world control systems, yet simulated environments often fail to capture real-world adversities. We consider the problem of learning a policy that will maximize the cumulative reward while satisfying a constraint, even when there is a mismatch between the real model and an accessible simulator/nominal model.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2503.02050v2",
      "title": "DYNEMO-SLAM: Dynamic Entity and Motion-Aware 3D Scene Graph SLAM",
      "url": "https://arxiv.org/abs/2503.02050v2",
      "publishedAt": "2025-03-03T21:02:31Z",
      "summary": "Robots operating in dynamic environments face significant challenges due to the presence of moving agents and displaced objects. Traditional SLAM systems typically assume a static world or treat dynamic as outliers, discarding their information to preserve map consistency.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    }
  ]
}