{
  "generatedAt": "2025-10-20T12:08:07.681Z",
  "count": 89,
  "items": [
    {
      "id": "http://arxiv.org/abs/2510.15870v1",
      "title": "OmniVinci: Enhancing Architecture and Data for Omni-Modal Understanding\n  LLM",
      "url": "http://arxiv.org/abs/2510.15870v1",
      "publishedAt": "2025-10-17T17:59:59Z",
      "summary": "Advancing machine intelligence requires developing the ability to perceive across multiple modalities, much as humans sense the world. We introduce OmniVinci, an initiative to build a strong, open-source, omni-modal LLM. We carefully study the design choices across model architecture and data curation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15868v1",
      "title": "LightsOut: Diffusion-based Outpainting for Enhanced Lens Flare Removal",
      "url": "http://arxiv.org/abs/2510.15868v1",
      "publishedAt": "2025-10-17T17:59:50Z",
      "summary": "Lens flare significantly degrades image quality, impacting critical computer vision tasks like object detection and autonomous driving. Recent Single Image Flare Removal (SIFR) methods perform poorly when off-frame light sources are incomplete or absent. We propose LightsOut, a diffusion-based outpainting framework tailored to enhance SIFR by reconstructing off-frame light sources.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15803v1",
      "title": "Dynamic Recalibration in LiDAR SLAM: Integrating AI and Geometric\n  Methods with Real-Time Feedback Using INAF Fusion",
      "url": "http://arxiv.org/abs/2510.15803v1",
      "publishedAt": "2025-10-17T16:29:02Z",
      "summary": "This paper presents a novel fusion technique for LiDAR Simultaneous Localization and Mapping (SLAM), aimed at improving localization and 3D mapping using LiDAR sensor. Our approach centers on the Inferred Attention Fusion (INAF) module, which integrates AI with geometric odometry.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15786v1",
      "title": "DexCanvas: Bridging Human Demonstrations and Robot Learning for\n  Dexterous Manipulation",
      "url": "http://arxiv.org/abs/2510.15786v1",
      "publishedAt": "2025-10-17T16:08:14Z",
      "summary": "We present DexCanvas, a large-scale hybrid real-synthetic human manipulation dataset containing 7,000 hours of dexterous hand-object interactions seeded from 70 hours of real human demonstrations, organized across 21 fundamental manipulation types based on the Cutkosky taxonomy.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15767v1",
      "title": "EASELAN: An Open-Source Framework for Multimodal Biosignal Annotation\n  and Data Management",
      "url": "http://arxiv.org/abs/2510.15767v1",
      "publishedAt": "2025-10-17T15:56:04Z",
      "summary": "Recent advancements in machine learning and adaptive cognitive systems are driving a growing demand for large and richly annotated multimodal data. A prominent example of this trend are fusion models, which increasingly incorporate multiple biosignals in addition to traditional audiovisual channels.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.15718v1",
      "title": "Weakening Goals in Logical Specifications",
      "url": "http://arxiv.org/abs/2510.15718v1",
      "publishedAt": "2025-10-17T15:03:37Z",
      "summary": "Logical specifications are widely used to represent software systems and their desired properties. Under system degradation or environmental changes, commonly seen in complex real-world robotic systems, these properties may no longer hold and so traditional verification methods will simply fail to construct a proof.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.15686v1",
      "title": "Few-Shot Demonstration-Driven Task Coordination and Trajectory Execution\n  for Multi-Robot Systems",
      "url": "http://arxiv.org/abs/2510.15686v1",
      "publishedAt": "2025-10-17T14:30:29Z",
      "summary": "In this paper, we propose a novel few-shot learning framework for multi-robot systems that integrate both spatial and temporal elements: Few-Shot Demonstration-Driven Task Coordination and Trajectory Execution (DDACE).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15679v1",
      "title": "HEADER: Hierarchical Robot Exploration via Attention-Based Deep\n  Reinforcement Learning with Expert-Guided Reward",
      "url": "http://arxiv.org/abs/2510.15679v1",
      "publishedAt": "2025-10-17T14:17:02Z",
      "summary": "This work pushes the boundaries of learning-based methods in autonomous robot exploration in terms of environmental scale and exploration efficiency. We present HEADER, an attention-based reinforcement learning approach with hierarchical graphs for efficient exploration in large-scale environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15668v1",
      "title": "Freehand 3D Ultrasound Imaging: Sim-in-the-Loop Probe Pose Optimization\n  via Visual Servoing",
      "url": "http://arxiv.org/abs/2510.15668v1",
      "publishedAt": "2025-10-17T13:54:33Z",
      "summary": "Freehand 3D ultrasound (US) imaging using conventional 2D probes offers flexibility and accessibility for diverse clinical applications but faces challenges in accurate probe pose estimation. Traditional methods depend on costly tracking systems, while neural network-based methods struggle with image noise and error accumulation, compromising reconstruction precision.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.15639v1",
      "title": "Integration of a Variable Stiffness Link for Long-Reach Aerial\n  Manipulation",
      "url": "http://arxiv.org/abs/2510.15639v1",
      "publishedAt": "2025-10-17T13:31:21Z",
      "summary": "This paper presents the integration of a Variable Stiffness Link (VSL) for long-reach aerial manipulation, enabling adaptable mechanical coupling between an aerial multirotor platform and a dual-arm manipulator. Conventional long-reach manipulation systems rely on rigid or cable connections, which limit precision or transmit disturbances to the aerial vehicle.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.15638v1",
      "title": "Educational SoftHand-A: Building an Anthropomorphic Hand with Soft\n  Synergies using LEGO MINDSTORMS",
      "url": "http://arxiv.org/abs/2510.15638v1",
      "publishedAt": "2025-10-17T13:29:18Z",
      "summary": "This paper introduces an anthropomorphic robot hand built entirely using LEGO MINDSTORMS: the Educational SoftHand-A, a tendon-driven, highly-underactuated robot hand based on the Pisa/IIT SoftHand and related hands. To be suitable for an educational context, the design is constrained to use only standard LEGO pieces with tests using common equipment available at home.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15626v1",
      "title": "Adaptive Legged Locomotion via Online Learning for Model Predictive\n  Control",
      "url": "http://arxiv.org/abs/2510.15626v1",
      "publishedAt": "2025-10-17T13:18:13Z",
      "summary": "We provide an algorithm for adaptive legged locomotion via online learning and model predictive control. The algorithm is composed of two interacting modules: model predictive control (MPC) and online learning of residual dynamics. The residual dynamics can represent modeling errors and external disturbances.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15533v1",
      "title": "Improved Extended Kalman Filter-Based Disturbance Observers for\n  Exoskeletons",
      "url": "http://arxiv.org/abs/2510.15533v1",
      "publishedAt": "2025-10-17T11:07:54Z",
      "summary": "The nominal performance of mechanical systems is often degraded by unknown disturbances. A two-degree-of-freedom control structure can decouple nominal performance from disturbance rejection. However, perfect disturbance rejection is unattainable when the disturbance dynamic is unknown. In this work, we reveal an inherent trade-off in disturbance estimation subject to tracking speed and tracking uncertainty.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.15530v1",
      "title": "VO-DP: Semantic-Geometric Adaptive Diffusion Policy for Vision-Only\n  Robotic Manipulation",
      "url": "http://arxiv.org/abs/2510.15530v1",
      "publishedAt": "2025-10-17T11:01:33Z",
      "summary": "In the context of imitation learning, visuomotor-based diffusion policy learning is one of the main directions in robotic manipulation. Most of these approaches rely on point clouds as observation inputs and construct scene representations through point clouds feature learning, which enables them to achieve remarkable accuracy.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15510v1",
      "title": "Exploring Conditions for Diffusion models in Robotic Control",
      "url": "http://arxiv.org/abs/2510.15510v1",
      "publishedAt": "2025-10-17T10:24:14Z",
      "summary": "While pre-trained visual representations have significantly advanced imitation learning, they are often task-agnostic as they remain frozen during policy learning. In this work, we explore leveraging pre-trained text-to-image diffusion models to obtain task-adaptive visual representations for robotic control, without fine-tuning the model itself.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.15505v1",
      "title": "Perfect Prediction or Plenty of Proposals? What Matters Most in Planning\n  for Autonomous Driving",
      "url": "http://arxiv.org/abs/2510.15505v1",
      "publishedAt": "2025-10-17T10:17:54Z",
      "summary": "Traditionally, prediction and planning in autonomous driving (AD) have been treated as separate, sequential modules. Recently, there has been a growing shift towards tighter integration of these components, known as Integrated Prediction and Planning (IPP), with the aim of enabling more informed and adaptive decision-making.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15446v1",
      "title": "VDRive: Leveraging Reinforced VLA and Diffusion Policy for End-to-end\n  Autonomous Driving",
      "url": "http://arxiv.org/abs/2510.15446v1",
      "publishedAt": "2025-10-17T09:02:18Z",
      "summary": "In autonomous driving, dynamic environment and corner cases pose significant challenges to the robustness of ego vehicle's state understanding and decision making. We introduce VDRive, a novel pipeline for end-to-end autonomous driving that explicitly models state-action mapping to address these challenges, enabling interpretable and robust decision making.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15388v1",
      "title": "Iterative Refinement of Flow Policies in Probability Space for Online\n  Reinforcement Learning",
      "url": "http://arxiv.org/abs/2510.15388v1",
      "publishedAt": "2025-10-17T07:43:51Z",
      "summary": "While behavior cloning with flow/diffusion policies excels at learning complex skills from demonstrations, it remains vulnerable to distributional shift, and standard RL methods struggle to fine-tune these models due to their iterative inference process and the limitations of existing workarounds.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15385v1",
      "title": "FreqPDE: Rethinking Positional Depth Embedding for Multi-View 3D Object\n  Detection Transformers",
      "url": "http://arxiv.org/abs/2510.15385v1",
      "publishedAt": "2025-10-17T07:36:54Z",
      "summary": "Detecting 3D objects accurately from multi-view 2D images is a challenging yet essential task in the field of autonomous driving. Current methods resort to integrating depth prediction to recover the spatial information for object query decoding, which necessitates explicit supervision from LiDAR points during the training phase.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15382v1",
      "title": "Towards Robust Zero-Shot Reinforcement Learning",
      "url": "http://arxiv.org/abs/2510.15382v1",
      "publishedAt": "2025-10-17T07:33:19Z",
      "summary": "The recent development of zero-shot reinforcement learning (RL) has opened a new avenue for learning pre-trained generalist policies that can adapt to arbitrary new tasks in a zero-shot manner.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.15376v1",
      "title": "Towards Automated Chicken Deboning via Learning-based\n  Dynamically-Adaptive 6-DoF Multi-Material Cutting",
      "url": "http://arxiv.org/abs/2510.15376v1",
      "publishedAt": "2025-10-17T07:27:19Z",
      "summary": "Automating chicken shoulder deboning requires precise 6-DoF cutting through a partially occluded, deformable, multi-material joint, since contact with the bones presents serious health and safety risks.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2510.14952v2",
      "title": "From Language to Locomotion: Retargeting-free Humanoid Control via\n  Motion Latent Guidance",
      "url": "http://arxiv.org/abs/2510.14952v2",
      "publishedAt": "2025-10-16T17:57:47Z",
      "summary": "Natural language offers a natural interface for humanoid robots, but existing language-guided humanoid locomotion pipelines remain cumbersome and untrustworthy. They typically decode human motion, retarget it to robot morphology, and then track it with a physics-based controller.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585672",
      "title": "Your guide to Day 2 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-day-2-robobusiness-2025/",
      "publishedAt": "Thu, 16 Oct 2025 12:00:30 +0000",
      "summary": "Day 2 of RoboBusiness 2025 is another packed day full of interesting talks, unique networking opportunities, and big-name keynotes. The post Your guide to Day 2 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.14049v2",
      "title": "CausalVerse: Benchmarking Causal Representation Learning with\n  Configurable High-Fidelity Simulations",
      "url": "http://arxiv.org/abs/2510.14049v2",
      "publishedAt": "2025-10-15T19:39:22Z",
      "summary": "Causal Representation Learning (CRL) aims to uncover the data-generating process and identify the underlying causal variables and relations, whose evaluation remains inherently challenging due to the requirement of known ground-truth causal variables and causal structure.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=585662",
      "title": "Your guide to Day 1 of RoboBusiness 2025",
      "url": "https://www.therobotreport.com/your-guide-to-day-1-of-robobusiness-2025/",
      "publishedAt": "Wed, 15 Oct 2025 12:00:30 +0000",
      "summary": "This is a comprehensive guide to everything happening on the first day of RoboBusiness 2025, include a full session schedule. The post Your guide to Day 1 of RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585617",
      "title": "A guide to everything happening at RoboBusiness 2025",
      "url": "https://www.therobotreport.com/a-guide-to-everything-happening-at-robobusiness-2025/",
      "publishedAt": "Tue, 14 Oct 2025 12:00:26 +0000",
      "summary": "To help you keep track of everything going on at RoboBusiness, we’ve compiled a summary of all of the activities at the event. The post A guide to everything happening at RoboBusiness 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585678",
      "title": "Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program",
      "url": "https://www.therobotreport.com/diligent-robotics-joins-agetech-collaborative-aarp-accelerator-program/",
      "publishedAt": "Tue, 14 Oct 2025 11:30:06 +0000",
      "summary": "After providing mobile manipulators to hospitals, Diligent Robotics is working with AARP to bring robots to senior care communities. The post Diligent Robotics joins AgeTech Collaborative from AARP Accelerator Program appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585671",
      "title": "HavocAI obtains $85M to scale autonomous marine systems",
      "url": "https://www.therobotreport.com/havocai-obtains-85m-to-scale-autonomous-marine-systems/",
      "publishedAt": "Mon, 13 Oct 2025 14:38:55 +0000",
      "summary": "HavocAI plans to use the funding to grow its autonomous fleet and enable military vessels in allied navies. The post HavocAI obtains $85M to scale autonomous marine systems appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585669",
      "title": "Surgical robots take center stage at DeviceTalks West, RoboBusiness",
      "url": "https://www.therobotreport.com/surgical-robots-take-center-stage-devicetalks-west-robobusiness/",
      "publishedAt": "Mon, 13 Oct 2025 12:54:33 +0000",
      "summary": "Attendees at RoboBusiness 2025 and DeviceTalks West this week can learn about the latest developments in surgical robotics. The post Surgical robots take center stage at DeviceTalks West, RoboBusiness appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585666",
      "title": "Humanoids need orchestration to be useful in manufacturing, notes Flexxbotics CEO",
      "url": "https://www.therobotreport.com/humanoids-need-orchestration-useful-manufacturing-notes-flexxbotics-ceo/",
      "publishedAt": "Sun, 12 Oct 2025 12:30:12 +0000",
      "summary": "Before humanoids can take their place in factories, developers need to consider coordination and context, writes Tyler Bouchard. The post Humanoids need orchestration to be useful in manufacturing, notes Flexxbotics CEO appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585655",
      "title": "How machine vision is enhancing automation safety and efficiency",
      "url": "https://www.therobotreport.com/how-machine-vision-is-enhancing-automation-safety-efficiency/",
      "publishedAt": "Sat, 11 Oct 2025 12:30:23 +0000",
      "summary": "The most sophisticated machine vision systems have enabled new and emerging designs far more sophisticated than bin picking. The post How machine vision is enhancing automation safety and efficiency appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585652",
      "title": "Edge computing and AI: A conversation with Palladyne AI&#8217;s Ben Wolff",
      "url": "https://www.therobotreport.com/edge-computing-ai-conversation-ben-wolff/",
      "publishedAt": "Fri, 10 Oct 2025 19:48:45 +0000",
      "summary": "Palladyne AI focuses on simplifying robot programming, advancing swarming technology, and developing hardware-agnostic AI for diverse applications. The post Edge computing and AI: A conversation with Palladyne AI&#8217;s Ben Wolff appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585646",
      "title": "Intel expands Panther Lake processor edge applications to robotics",
      "url": "https://www.therobotreport.com/intel-expands-panther-lake-processor-edge-applications-to-robotics/",
      "publishedAt": "Fri, 10 Oct 2025 19:04:42 +0000",
      "summary": "Intel has the first Panther Lake SKU slated to ship before the end of the year, with broad market availability starting January 2026. The post Intel expands Panther Lake processor edge applications to robotics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585335",
      "title": "Robotics Summit 2026 call for speakers ends today",
      "url": "https://www.therobotreport.com/robotics-summit-2026-opens-call-for-speakers/",
      "publishedAt": "Fri, 10 Oct 2025 15:37:53 +0000",
      "summary": "The Robotics Summit &#038; Expo, the industry’s must-attend technical development event, returns to Boston in 2026 with deepened coverage, an expanded expo floor, and more. The post Robotics Summit 2026 call for speakers ends today appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585641",
      "title": "Revolute Robotics brings in $1.9M to deploy its driving, flying robots",
      "url": "https://www.therobotreport.com/revolute-robotics-brings-in-1-9m-deploy-driving-flying-robots/",
      "publishedAt": "Fri, 10 Oct 2025 14:33:59 +0000",
      "summary": "Revolute offers a unique robot that can drive on the ground to extend battery life and fly when it needs to get around obstacles. The post Revolute Robotics brings in $1.9M to deploy its driving, flying robots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=585612",
      "title": "Lucid Bots brings embodied AI to commercial painting",
      "url": "https://www.therobotreport.com/lucid-bots-brings-embodied-ai-commercial-painting/",
      "publishedAt": "Thu, 09 Oct 2025 19:53:35 +0000",
      "summary": "Lucid Bots has added painting capabilities to its Sherpa drone, automating commercial coating at scale to meet infrastructure demand. The post Lucid Bots brings embodied AI to commercial painting appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585628",
      "title": "Figure AI designs Figure 03 humanoid for AI, home use, and scaling",
      "url": "https://www.therobotreport.com/figure-ai-designs-figure-03-humanoid-ai-home-use-scaling/",
      "publishedAt": "Thu, 09 Oct 2025 18:21:54 +0000",
      "summary": "Figure 03 features a redesigned sensory suite and hand system, a form factor for household operation, and lower manufacturing costs. The post Figure AI designs Figure 03 humanoid for AI, home use, and scaling appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585624",
      "title": "Fundamental XR launches Fundamental Touch for wireless haptics",
      "url": "https://www.therobotreport.com/fundamental-xr-launches-fundamental-touch-for-wireless-haptics/",
      "publishedAt": "Thu, 09 Oct 2025 14:35:21 +0000",
      "summary": "Fundamental Touch is a new software architecture that enables wireless haptic feedback for high-fidelity, safer teleoperation. The post Fundamental XR launches Fundamental Touch for wireless haptics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.24907v2",
      "title": "Real-time Recognition of Human Interactions from a Single RGB-D Camera\n  for Socially-Aware Robot Navigation",
      "url": "http://arxiv.org/abs/2509.24907v2",
      "publishedAt": "2025-09-29T15:14:56Z",
      "summary": "{Recognizing human interactions is essential for social robots as it enables them to navigate safely and naturally in shared environments. Conventional robotic systems however often focus on obstacle avoidance, neglecting social cues necessary for seamless human-robot interaction. To address this gap, we propose a framework to recognize human group interactions for socially aware navigation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.02437v3",
      "title": "U-ARM : Ultra low-cost general teleoperation interface for robot\n  manipulation",
      "url": "http://arxiv.org/abs/2509.02437v3",
      "publishedAt": "2025-09-02T15:39:38Z",
      "summary": "We propose U-Arm, a low-cost and rapidly adaptable leader-follower teleoperation framework designed to interface with most of commercially available robotic arms. Our system supports teleoperation through three structurally distinct 3D-printed leader arms that share consistent control logic, enabling seamless compatibility with diverse commercial robot configurations.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=74901",
      "title": "What Is NVIDIA’s Three-Computer Solution for Robotics?",
      "url": "https://blogs.nvidia.com/blog/three-computers-robotics/",
      "publishedAt": "Fri, 08 Aug 2025 16:00:13 +0000",
      "summary": "Physical AI — the embodiment of artificial intelligence in robots, visual AI agents, warehouses and factories and other autonomous systems that operate in the real world — is experiencing its breakthrough moment.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.05635v2",
      "title": "Genie Envisioner: A Unified World Foundation Platform for Robotic\n  Manipulation",
      "url": "http://arxiv.org/abs/2508.05635v2",
      "publishedAt": "2025-08-07T17:59:44Z",
      "summary": "We introduce Genie Envisioner (GE), a unified world foundation platform for robotic manipulation that integrates policy learning, evaluation, and simulation within a single video-generative framework. At its core, GE-Base is a large-scale, instruction-conditioned video diffusion model that captures the spatial, temporal, and semantic dynamics of real-world robotic interactions in a structured latent space.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2507.19983v2",
      "title": "CLASP: General-Purpose Clothes Manipulation with Semantic Keypoints",
      "url": "http://arxiv.org/abs/2507.19983v2",
      "publishedAt": "2025-07-26T15:43:25Z",
      "summary": "Clothes manipulation, such as folding or hanging, is a critical capability for home service robots. Despite recent advances, most existing methods remain limited to specific clothes types and tasks, due to the complex, high-dimensional geometry of clothes.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82559",
      "title": "NVIDIA and Partners Highlight Next-Generation Robotics, Automation and AI Technologies at Automatica",
      "url": "https://blogs.nvidia.com/blog/automatica-robotics-2025/",
      "publishedAt": "Tue, 24 Jun 2025 09:00:30 +0000",
      "summary": "From the heart of Germany’s automotive sector to manufacturing hubs across France and Italy, Europe is embracing industrial AI and advanced AI-powered robotics to address labor shortages, boost productivity and fuel sustainable economic growth. Robotics companies are developing humanoid robots and collaborative systems that integrate AI into real-world manufacturing applications.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82396",
      "title": "Hexagon Taps NVIDIA Robotics and AI Software to Build and Deploy AEON, a New Humanoid",
      "url": "https://blogs.nvidia.com/blog/hexagon-robotics-ai-software-aeon-humanoid/",
      "publishedAt": "Tue, 17 Jun 2025 15:10:55 +0000",
      "summary": "As a global labor shortage leaves 50 million positions unfilled across industries like manufacturing and logistics, Hexagon — a global leader in measurement technologies — is developing humanoid robots that can lend a helping hand. Industrial sectors depend on skilled workers to perform a variety of error-prone tasks, including operating high-precision scanners for reality capture Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=82037",
      "title": "European Robot Makers Adopt NVIDIA Isaac, Omniverse and Halos to Develop Safe, Physical AI-Driven Robot Fleets",
      "url": "https://blogs.nvidia.com/blog/european-robot-makers-isaac-omniverse-halos-safe-physical-ai/",
      "publishedAt": "Wed, 11 Jun 2025 11:00:23 +0000",
      "summary": "In the face of growing labor shortages and need for sustainability, European manufacturers are racing to reinvent their processes to become software-defined and AI-driven. To achieve this, robot developers and industrial digitalization solution providers are working with NVIDIA to build safe, AI-driven robots and industrial technologies to drive modern, sustainable manufacturing. At NVIDIA GTC Paris Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=82173",
      "title": "Germany Builds Its AI Autobahn With NVIDIA",
      "url": "https://blogs.nvidia.com/blog/germany-ai-factories/",
      "publishedAt": "Wed, 11 Jun 2025 10:25:33 +0000",
      "summary": "Germany is building on a long history of engineering innovation with new AI investments poised to transform the country’s economy — including the automotive, banking, manufacturing and robotics industries. The country is deploying tens of thousands of NVIDIA GPUs to power AI factories that generate intelligence for businesses and researchers, optimized AI software to run Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2506.06094v2",
      "title": "Onboard Mission Replanning for Adaptive Cooperative Multi-Robot Systems",
      "url": "http://arxiv.org/abs/2506.06094v2",
      "publishedAt": "2025-06-06T13:54:19Z",
      "summary": "Cooperative autonomous robotic systems have significant potential for executing complex multi-task missions across space, air, ground, and maritime domains. But they commonly operate in remote, dynamic and hazardous environments, requiring rapid in-mission adaptation without reliance on fragile or slow communication links to centralised compute.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015300",
      "title": "Hugging Face says its new robotics model is so efficient it can run on a MacBook",
      "url": "https://techcrunch.com/2025/06/04/hugging-face-says-its-new-robotics-model-is-so-efficient-it-can-run-on-a-macbook/",
      "publishedAt": "Wed, 04 Jun 2025 20:10:30 +0000",
      "summary": "AI dev platform Hugging Face released an open AI model for robotics called SmolVLA, which the company claims outperforms much larger models for robotics in both virtual and real-world environments.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=81193",
      "title": "Researchers and Students in Türkiye Build AI, Robotics Tools to Boost Disaster Readiness",
      "url": "https://blogs.nvidia.com/blog/turkiye-disaster-readiness-ai-robotics/",
      "publishedAt": "Mon, 02 Jun 2025 15:00:11 +0000",
      "summary": "Since a 7.8-magnitude earthquake hit Syria and Türkiye two years ago — leaving 55,000 people dead, 130,000 injured and millions displaced from their homes — students, researchers and developers have been harnessing the latest AI robotics technologies to increase disaster preparedness in the region. The work is part of a Disaster Response Innovation and Education Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3013274",
      "title": "Hugging Face unveils two new humanoid robots",
      "url": "https://techcrunch.com/2025/05/29/hugging-face-unveils-two-new-humanoid-robots/",
      "publishedAt": "Thu, 29 May 2025 19:28:24 +0000",
      "summary": "AI dev platform Hugging Face continued its push into robotics on Thursday with the release of two new humanoid robots.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3011215",
      "title": "Why Intempus thinks robots should have a human physiological state",
      "url": "https://techcrunch.com/2025/05/25/why-intempus-thinks-robots-should-have-a-human-physiological-state/",
      "publishedAt": "Sun, 25 May 2025 14:00:00 +0000",
      "summary": "Teddy Warner, 19, has always been interested in robotics. His family was in the industry, and he says he &#8220;grew up&#8221; working in a machinist shop while in high school. Now Warner is building a robotics company of his own, Intempus, that looks to make robots a bit more human. Intempus is building tech to [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3010629",
      "title": "Serve is betting that food delivery and access to public markets are the keys to scaling robotics",
      "url": "https://techcrunch.com/podcast/serve-is-betting-that-food-delivery-and-access-to-public-markets-are-the-keys-to-scaling-robotics/",
      "publishedAt": "Wed, 21 May 2025 20:20:53 +0000",
      "summary": "“The only thing worse than being a public company CEO is being a private company CEO right now,” says Ali Kashani, co-founder and CEO of Serve Robotics. Access to capital, he argues, is everything in robotics. And in today’s “FOMO-driven” venture climate, securing funds is far from guaranteed. Backed by Nvidia and Uber, Serve recently [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80963",
      "title": "NVIDIA Research Breakthroughs Put Advanced Robots in Motion",
      "url": "https://blogs.nvidia.com/blog/nvidia-research-robotics-icra-2025/",
      "publishedAt": "Mon, 19 May 2025 15:00:53 +0000",
      "summary": "Across robot training and development, NVIDIA Research is uncovering breakthroughs in areas such as multimodal generative AI and synthetic data generation. The team’s latest innovations will be spotlighted at the International Conference on Robotics and Automation (ICRA), running May 19-23 in Atlanta. “ICRA has played a pivotal role in shaping the direction of robotics and Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80675",
      "title": "Foxconn Taps NVIDIA to Accelerate Physical and Digital Robotics for Global Healthcare Industry",
      "url": "https://blogs.nvidia.com/blog/foxconn-smart-hospital-robot/",
      "publishedAt": "Mon, 19 May 2025 04:50:42 +0000",
      "summary": "The world’s largest electronics manufacturer is building smart hospital solutions using NVIDIA technologies from the data center to the edge.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80740",
      "title": "That’s One Smart Hospital! Taiwan Medical Centers Deploy Life-Saving Innovations With NVIDIA System-Builder Partners",
      "url": "https://blogs.nvidia.com/blog/taiwan-medical-centers-system-builder-partners/",
      "publishedAt": "Mon, 19 May 2025 04:50:09 +0000",
      "summary": "Leading healthcare organizations across the globe are using agentic AI, robotics and digital twins of medical environments to enhance surgical precision, boost workflow efficiency, improve medical diagnoses and more. Physical AI and humanoid robots in hospitals have the potential to automate routine tasks, assist with patient care and address workforce shortages. This is especially crucial Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80491",
      "title": "NVIDIA Omniverse Digital Twins Help Taiwan Manufacturers Drive Golden Age of Industrial AI",
      "url": "https://blogs.nvidia.com/blog/omniverse-digital-twins-taiwan-manufacturers-physical-ai/",
      "publishedAt": "Mon, 19 May 2025 04:30:03 +0000",
      "summary": "NVIDIA and Taiwan’s manufacturing ecosystem, including Delta Electronics, Foxconn, TSMC and Wistron, are showcasing this week at COMPUTEX in Taipei the crucial role digital twins play in accelerating industrial AI. These electronics, semiconductor and robotics manufacturing leaders are using Universal Scene Description (OpenUSD) and NVIDIA Omniverse libraries and blueprints to develop physically based digital twins.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=80499",
      "title": "NVIDIA Partners Showcase Cutting-Edge Robotic and Industrial AI Solutions at Automate 2025",
      "url": "https://blogs.nvidia.com/blog/robotics-industrial-ai-automate/",
      "publishedAt": "Tue, 13 May 2025 13:45:00 +0000",
      "summary": "As the manufacturing industry faces challenges — such as labor shortages, reshoring and inconsistent operational strategies — AI-powered robots present a significant opportunity to accelerate industrial automation. At Automate, the largest robotics and automation event in North America, robotics leaders KUKA, Standard Bots, Universal Robots (UR) and Vention are showcasing hardware and robots powered by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.08222v2",
      "title": "Scaling Multi Agent Reinforcement Learning for Underwater Acoustic\n  Tracking via Autonomous Vehicles",
      "url": "http://arxiv.org/abs/2505.08222v2",
      "publishedAt": "2025-05-13T04:42:30Z",
      "summary": "Autonomous vehicles (AV) offer a cost-effective solution for scientific missions such as underwater tracking. Recently, reinforcement learning (RL) has emerged as a powerful method for controlling AVs in complex marine environments. However, scaling these techniques to a fleet--essential for multi-target tracking or targets with rapid, unpredictable motion--presents significant computational challenges.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3004901",
      "title": "Amazon offers peek at new human jobs in an AI bot world",
      "url": "https://techcrunch.com/2025/05/11/amazon-offers-peek-at-new-human-jobs-in-an-ai-bot-world/",
      "publishedAt": "Sun, 11 May 2025 14:00:00 +0000",
      "summary": "The tech industry seems to have two thoughts when it comes to where human workers fit into the AI-powered world they are creating: Either they think that all the jobs, except perhaps their own, will be done by bots. (VC Marc Andreessen seems to think that his work as an investor could never be automated). [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2505.03841v3",
      "title": "Contact-Aware Safety in Soft Robots Using High-Order Control Barrier and\n  Lyapunov Functions",
      "url": "http://arxiv.org/abs/2505.03841v3",
      "publishedAt": "2025-05-05T06:10:09Z",
      "summary": "Robots operating alongside people, particularly in sensitive scenarios such as aiding the elderly with daily tasks or collaborating with workers in manufacturing, must guarantee safety and cultivate user trust.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=80269",
      "title": "Wandercraft Begins Clinical Trials for Physical AI-Powered Personal Exoskeleton",
      "url": "https://blogs.nvidia.com/blog/physical-ai-exoskeleton/",
      "publishedAt": "Thu, 01 May 2025 13:00:30 +0000",
      "summary": "For Nicolas Simon, advancing the field of robotics is a personal mission that could change his siblings’ lives. Two-thirds of Simon’s family members use wheelchairs due to mobility challenges related to Charcot-Marie-Tooth disease, an inherited genetic condition. As an engineering student and robotics club chair at France’s École Polytechnique, he saw the opportunity to build Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=79551",
      "title": "National Robotics Week — Latest Physical AI Research, Breakthroughs and Resources",
      "url": "https://blogs.nvidia.com/blog/national-robotics-week-2025/",
      "publishedAt": "Sat, 12 Apr 2025 16:00:05 +0000",
      "summary": "This National Robotics Week, NVIDIA highlighted the pioneering technologies that are shaping the future of intelligent machines and driving progress across manufacturing, healthcare, logistics and more. Advancements in robotics simulation and robot learning are driving this fundamental shift in the industry. Plus, the emergence of world foundation models is accelerating the evolution of AI-enabled robots Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2504.02679v2",
      "title": "A Set-Theoretic Robust Control Approach for Linear Quadratic Games with\n  Unknown Counterparts",
      "url": "http://arxiv.org/abs/2504.02679v2",
      "publishedAt": "2025-04-03T15:15:46Z",
      "summary": "Ensuring robust decision-making in multi-agent systems is challenging when agents have distinct, possibly conflicting objectives and lack full knowledge of each other's strategies. This is apparent in safety-critical applications such as human-robot interaction and assisted driving, where uncertainty arises not only from unknown adversary strategies but also from external disturbances.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2412.07941v2",
      "title": "Beyond Static Assumptions: the Predictive Justified Perspective Model\n  for Epistemic Planning",
      "url": "http://arxiv.org/abs/2412.07941v2",
      "publishedAt": "2024-12-10T22:00:08Z",
      "summary": "Epistemic Planning (EP) is an important research area dedicated to reasoning about the knowledge and beliefs of agents in multi-agent cooperative or adversarial settings. The Justified Perspective (JP) model is the state-of-the-art approach to solving EP problems with efficiency and expressiveness. However, all existing EP methods inherit the static environment assumption from classical planning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2409.18641v3",
      "title": "Pseudo-Kinematic Trajectory Control and Planning of Tracked Vehicles",
      "url": "http://arxiv.org/abs/2409.18641v3",
      "publishedAt": "2024-09-27T11:19:41Z",
      "summary": "Tracked vehicles distribute their weight continuously over a large surface area (the tracks). This distinctive feature makes them the preferred choice for vehicles required to traverse soft and uneven terrain. From a robotics perspective, however, this flexibility comes at a cost: the complexity of modelling the system and the resulting difficulty in designing theoretically sound navigation solutions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2407.09718v3",
      "title": "CLOVER: Context-aware Long-term Object Viewpoint- and Environment-\n  Invariant Representation Learning",
      "url": "http://arxiv.org/abs/2407.09718v3",
      "publishedAt": "2024-07-12T23:16:48Z",
      "summary": "Mobile service robots can benefit from object-level understanding of their environments, including the ability to distinguish object instances and re-identify previously seen instances. Object re-identification is challenging across different viewpoints and in scenes with significant appearance variation arising from weather or lighting changes.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2401.17996v2",
      "title": "Development and Adaptation of Robotic Vision in the Real-World: the\n  Challenge of Door Detection",
      "url": "http://arxiv.org/abs/2401.17996v2",
      "publishedAt": "2024-01-31T16:55:44Z",
      "summary": "Mobile service robots are increasingly prevalent in human-centric, real-world domains, operating autonomously in unconstrained indoor environments. In such a context, robotic vision plays a central role in enabling service robots to perceive high-level environmental features from visual observations.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    }
  ]
}