{
  "generatedAt": "2025-12-29T15:05:39.749Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=586463",
      "title": "New lidar platforms promise safer, more efficient, and more autonomous industrial systems",
      "url": "https://www.therobotreport.com/new-lidar-platforms-promise-safer-more-efficient-more-autonomous-industrial-systems/",
      "publishedAt": "Mon, 29 Dec 2025 13:31:55 +0000",
      "summary": "FMCW lidar offers mobile robots better precision for navigation at scale in complex environments, says Voyant Photonics' CEO. The post New lidar platforms promise safer, more efficient, and more autonomous industrial systems appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586459",
      "title": "Four ways to make AI products that people will love",
      "url": "https://www.therobotreport.com/four-ways-to-make-ai-products-that-people-will-love/",
      "publishedAt": "Sun, 28 Dec 2025 15:00:35 +0000",
      "summary": "AI and robotics have stirred unease in the public, but good design principles can help avoid problems, writes Serve Robotics' CEO. The post Four ways to make AI products that people will love appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586449",
      "title": "Researchers create programmable, autonomous robots smaller than a grain of rice",
      "url": "https://www.therobotreport.com/researchers-create-programmable-autonomous-robots-smaller-than-a-grain-of-rice/",
      "publishedAt": "Sat, 27 Dec 2025 15:00:34 +0000",
      "summary": "Powered by light, the robots carry computers and can move in complex patterns, say Penn Engineering and University of Michigan researchers. The post Researchers create programmable, autonomous robots smaller than a grain of rice appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.22046v1",
      "title": "Backdoor Attacks on Prompt-Driven Video Segmentation Foundation Models",
      "url": "https://arxiv.org/abs/2512.22046v1",
      "publishedAt": "2025-12-26T14:48:58Z",
      "summary": "Prompt-driven Video Segmentation Foundation Models (VSFMs) such as SAM2 are increasingly deployed in applications like autonomous driving and digital pathology, raising concerns about backdoor threats. Surprisingly, we find that directly transferring classic backdoor attacks (e.g., BadNet) to VSFMs is almost ineffective, with ASR below 5\\%.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586441",
      "title": "Primech AI to debut Hytron bathroom cleaning robot at CES 2026",
      "url": "https://www.therobotreport.com/primech-ai-launch-hytron-bathroom-cleaning-robot-ces/",
      "publishedAt": "Fri, 26 Dec 2025 13:20:38 +0000",
      "summary": "Hytron uses an AI-driven platform to clean all restroom touchpoints while also controlling water application to minimize slip risk. The post Primech AI to debut Hytron bathroom cleaning robot at CES 2026 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21983v1",
      "title": "Bab_Sak Robotic Intubation System (BRIS): A Learning-Enabled Control Framework for Safe Fiberoptic Endotracheal Intubation",
      "url": "https://arxiv.org/abs/2512.21983v1",
      "publishedAt": "2025-12-26T11:05:45Z",
      "summary": "Endotracheal intubation is a critical yet technically demanding procedure, with failure or improper tube placement leading to severe complications. Existing robotic and teleoperated intubation systems primarily focus on airway navigation and do not provide integrated control of endotracheal tube advancement or objective verification of tube depth relative to the carina.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.21975v1",
      "title": "RT-Focuser: A Real-Time Lightweight Model for Edge-side Image Deblurring",
      "url": "https://arxiv.org/abs/2512.21975v1",
      "publishedAt": "2025-12-26T10:41:25Z",
      "summary": "Motion blur caused by camera or object movement severely degrades image quality and poses challenges for real-time applications such as autonomous driving, UAV perception, and medical imaging. In this paper, a lightweight U-shaped network tailored for real-time deblurring is presented and named RT-Focuser.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21970v1",
      "title": "StereoVLA: Enhancing Vision-Language-Action Models with Stereo Vision",
      "url": "https://arxiv.org/abs/2512.21970v1",
      "publishedAt": "2025-12-26T10:34:20Z",
      "summary": "Stereo cameras closely mimic human binocular vision, providing rich spatial cues critical for precise robotic manipulation. Despite their advantage, the adoption of stereo vision in vision-language-action models (VLAs) remains underexplored. In this work, we present StereoVLA, a VLA model that leverages rich geometric cues from stereo vision.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21898v1",
      "title": "Flexible Multitask Learning with Factorized Diffusion Policy",
      "url": "https://arxiv.org/abs/2512.21898v1",
      "publishedAt": "2025-12-26T07:11:47Z",
      "summary": "Multitask learning poses significant challenges due to the highly multimodal and diverse nature of robot action distributions. However, effectively fitting policies to these complex task distributions is often difficult, and existing monolithic models often underfit the action distribution and lack the flexibility required for efficient adaptation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21887v1",
      "title": "Aerial World Model for Long-horizon Visual Generation and Navigation in 3D Space",
      "url": "https://arxiv.org/abs/2512.21887v1",
      "publishedAt": "2025-12-26T06:22:39Z",
      "summary": "Unmanned aerial vehicles (UAVs) have emerged as powerful embodied agents. One of the core abilities is autonomous navigation in large-scale three-dimensional environments. Existing navigation policies, however, are typically optimized for low-level objectives such as obstacle avoidance and trajectory smoothness, lacking the ability to incorporate high-level semantics into planning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21886v1",
      "title": "Online Inertia Parameter Estimation for Unknown Objects Grasped by a Manipulator Towards Space Applications",
      "url": "https://arxiv.org/abs/2512.21886v1",
      "publishedAt": "2025-12-26T06:19:00Z",
      "summary": "Knowing the inertia parameters of a grasped object is crucial for dynamics-aware manipulation, especially in space robotics with free-floating bases. This work addresses the problem of estimating the inertia parameters of an unknown target object during manipulation. We apply and extend an existing online identification method by incorporating momentum conservation, enabling its use for the floating-base robots.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21882v1",
      "title": "Optimal Trajectory Planning for Orbital Robot Rendezvous and Docking",
      "url": "https://arxiv.org/abs/2512.21882v1",
      "publishedAt": "2025-12-26T06:11:54Z",
      "summary": "Approaching a tumbling target safely is a critical challenge in space debris removal missions utilizing robotic manipulators onboard servicing satellites. In this work, we propose a trajectory planning method based on nonlinear optimization for a close-range rendezvous to bring a free-floating, rotating debris object in a two-dimensional plane into the manipulator's workspace, as a preliminary step for its capture.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21859v1",
      "title": "TimeBill: Time-Budgeted Inference for Large Language Models",
      "url": "https://arxiv.org/abs/2512.21859v1",
      "publishedAt": "2025-12-26T04:49:35Z",
      "summary": "Large Language Models (LLMs) are increasingly deployed in time-critical systems, such as robotics, autonomous driving, embodied intelligence, and industrial automation, where generating accurate responses within a given time budget is crucial for decision-making, control, or safety-critical tasks.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21853v1",
      "title": "MoonBot: Modular and On-Demand Reconfigurable Robot Toward Moon Base Construction",
      "url": "https://arxiv.org/abs/2512.21853v1",
      "publishedAt": "2025-12-26T04:22:28Z",
      "summary": "The allure of lunar surface exploration and development has recently captured widespread global attention. Robots have proved to be indispensable for exploring uncharted terrains, uncovering and leveraging local resources, and facilitating the construction of future human habitats.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21831v1",
      "title": "End-to-End 3D Spatiotemporal Perception with Multimodal Fusion and V2X Collaboration",
      "url": "https://arxiv.org/abs/2512.21831v1",
      "publishedAt": "2025-12-26T02:20:22Z",
      "summary": "Multi-view cooperative perception and multimodal fusion are essential for reliable 3D spatiotemporal understanding in autonomous driving, especially under occlusions, limited viewpoints, and communication delays in V2X scenarios. This paper proposes XET-V2X, a multi-modal fused end-to-end tracking framework for v2x collaboration that unifies multi-view multimodal sensing within a shared spatiotemporal representation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21766v1",
      "title": "UniLabOS: An AI-Native Operating System for Autonomous Laboratories",
      "url": "https://arxiv.org/abs/2512.21766v1",
      "publishedAt": "2025-12-25T19:24:05Z",
      "summary": "Autonomous laboratories promise to accelerate discovery by coupling learning algorithms with robotic experimentation, yet adoption remains limited by fragmented software that separates high-level planning from low-level execution.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21723v1",
      "title": "HELP: Hierarchical Embodied Language Planner for Household Tasks",
      "url": "https://arxiv.org/abs/2512.21723v1",
      "publishedAt": "2025-12-25T15:54:08Z",
      "summary": "Embodied agents tasked with complex scenarios, whether in real or simulated environments, rely heavily on robust planning capabilities. When instructions are formulated in natural language, large language models (LLMs) equipped with extensive linguistic knowledge can play this role.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21722v1",
      "title": "MAction-SocialNav: Multi-Action Socially Compliant Navigation via Reasoning-enhanced Prompt Tuning",
      "url": "https://arxiv.org/abs/2512.21722v1",
      "publishedAt": "2025-12-25T15:52:10Z",
      "summary": "Socially compliant navigation requires robots to move safely and appropriately in human-centered environments by respecting social norms. However, social norms are often ambiguous, and in a single scenario, multiple actions may be equally acceptable. Most existing methods simplify this problem by assuming a single correct action, which limits their ability to handle real-world social uncertainty.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.21654v1",
      "title": "Structural Induced Exploration for Balanced and Scalable Multi-Robot Path Planning",
      "url": "https://arxiv.org/abs/2512.21654v1",
      "publishedAt": "2025-12-25T12:53:24Z",
      "summary": "Multi-robot path planning is a fundamental yet challenging problem due to its combinatorial complexity and the need to balance global efficiency with fair task allocation among robots. Traditional swarm intelligence methods, although effective on small instances, often converge prematurely and struggle to scale to complex environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21650v1",
      "title": "Causal-HM: Restoring Physical Generative Logic in Multimodal Anomaly Detection via Hierarchical Modulation",
      "url": "https://arxiv.org/abs/2512.21650v1",
      "publishedAt": "2025-12-25T12:32:33Z",
      "summary": "Multimodal Unsupervised Anomaly Detection (UAD) is critical for quality assurance in smart manufacturing, particularly in complex processes like robotic welding.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.21627v1",
      "title": "AstraNav-Memory: Contexts Compression for Long Memory",
      "url": "https://arxiv.org/abs/2512.21627v1",
      "publishedAt": "2025-12-25T11:19:26Z",
      "summary": "Lifelong embodied navigation requires agents to accumulate, retain, and exploit spatial-semantic experience across tasks, enabling efficient exploration in novel environments and rapid goal reaching in familiar ones. While object-centric memory is interpretable, it depends on detection and reconstruction pipelines that limit robustness and scalability.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21618v1",
      "title": "SymDrive: Realistic and Controllable Driving Simulator via Symmetric Auto-regressive Online Restoration",
      "url": "https://arxiv.org/abs/2512.21618v1",
      "publishedAt": "2025-12-25T10:28:43Z",
      "summary": "High-fidelity and controllable 3D simulation is essential for addressing the long-tail data scarcity in Autonomous Driving (AD), yet existing methods struggle to simultaneously achieve photorealistic rendering and interactive traffic editing. Current approaches often falter in large-angle novel view synthesis and suffer from geometric or lighting artifacts during asset manipulation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586446",
      "title": "Comau introduces MyCo cobot products",
      "url": "https://www.therobotreport.com/comau-introduces-myco-collaborative-robot-products/",
      "publishedAt": "Wed, 24 Dec 2025 15:31:48 +0000",
      "summary": "Comau has launched MyCo, a new family of six lightweight cobots designed for safe, flexible, and cost-effective industrial automation. The post Comau introduces MyCo cobot products appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21235v2",
      "title": "RoboCade: Gamifying Robot Data Collection",
      "url": "https://arxiv.org/abs/2512.21235v2",
      "publishedAt": "2025-12-24T15:20:54Z",
      "summary": "Imitation learning from human demonstrations has become a dominant approach for training autonomous robot policies. However, collecting demonstration datasets is costly: it often requires access to robots and needs sustained effort in a tedious, long process. These factors limit the scale of data available for training policies.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.21233v2",
      "title": "UniTacHand: Unified Spatio-Tactile Representation for Human to Robotic Hand Skill Transfer",
      "url": "https://arxiv.org/abs/2512.21233v2",
      "publishedAt": "2025-12-24T15:18:54Z",
      "summary": "Tactile sensing is crucial for robotic hands to achieve human-level dexterous manipulation, especially in scenarios with visual occlusion. However, its application is often hindered by the difficulty of collecting large-scale real-world robotic tactile data. In this study, we propose to collect low-cost human manipulation data using haptic gloves for tactile-based robotic policy learning.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2512.21220v2",
      "title": "RoboSafe: Safeguarding Embodied Agents via Executable Safety Logic",
      "url": "https://arxiv.org/abs/2512.21220v2",
      "publishedAt": "2025-12-24T15:01:26Z",
      "summary": "Embodied agents powered by vision-language models (VLMs) are increasingly capable of executing complex real-world tasks, yet they remain vulnerable to hazardous instructions that may trigger unsafe behaviors. Runtime safety guardrails, which intercept hazardous actions during task execution, offer a promising solution due to their flexibility.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.20815v2",
      "title": "Learning to Sense for Driving: Joint Optics-Sensor-Model Co-Design for Semantic Segmentation",
      "url": "https://arxiv.org/abs/2512.20815v2",
      "publishedAt": "2025-12-23T22:28:30Z",
      "summary": "Traditional autonomous driving pipelines decouple camera design from downstream perception, relying on fixed optics and handcrafted ISPs that prioritize human viewable imagery rather than machine semantics. This separation discards information during demosaicing, denoising, or quantization, while forcing models to adapt to sensor artifacts.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586440",
      "title": "Robotics in review: Editors look back at 2025",
      "url": "https://www.therobotreport.com/robotics-in-review-editors-look-back-at-2025/",
      "publishedAt": "Tue, 23 Dec 2025 19:56:16 +0000",
      "summary": "The editorial team reviews 2025’s top robotics stories, including iRobot’s bankruptcy, the humanoid boom, and Waymo’s scaling. The post Robotics in review: Editors look back at 2025 appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586437",
      "title": "Galbot brings in $300M to scale mobile manipulator deployments",
      "url": "https://www.therobotreport.com/galbot-brings-in-300m-to-scale-mobile-manipulator-deployments/",
      "publishedAt": "Tue, 23 Dec 2025 18:43:48 +0000",
      "summary": "Galbot's flagship robot is the G1, a mobile manipulator with a human-like torso, two arms, and a mobile base. The post Galbot brings in $300M to scale mobile manipulator deployments appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586433",
      "title": "TE Connectivity launches 3D industrial application tool",
      "url": "https://www.therobotreport.com/te-connectivity-launches-3d-industrial-application-tool/",
      "publishedAt": "Mon, 22 Dec 2025 21:46:23 +0000",
      "summary": "TE Connectivity offers a range of connectivity and sensor systems that it has tested in some of the harshest environments. The post TE Connectivity launches 3D industrial application tool appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=585867",
      "title": "Last day to enter the 2026 RBR50 Awards",
      "url": "https://www.therobotreport.com/2026-rbr50-robotics-innovation-awards-open-for-nominations/",
      "publishedAt": "Mon, 22 Dec 2025 15:45:53 +0000",
      "summary": "2026 RBR50 Robotics Innovation Awards will recognize the leading technologies, businesses, startups, and applications of the past year. The post Last day to enter the 2026 RBR50 Awards appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586429",
      "title": "Ai2 says its Molmo 2 multimodal AI model can do more with less data",
      "url": "https://www.therobotreport.com/ai2-said-its-molmo-2-multimodal-ai-model-can-do-more-with-less-data/",
      "publishedAt": "Sun, 21 Dec 2025 13:30:03 +0000",
      "summary": "Molmo 2 is an 8B-parameter model that surpasses the 72B-parameter Molmo in accuracy, temporal understanding, and pixel-level grounding. The post Ai2 says its Molmo 2 multimodal AI model can do more with less data appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586424",
      "title": "Chef Robotics launches its most advanced assembly robot yet",
      "url": "https://www.therobotreport.com/chef-robotics-launches-most-advanced-assembly-robot-yet/",
      "publishedAt": "Sat, 20 Dec 2025 13:35:35 +0000",
      "summary": "Chef Robotics unveiled Chef+, an advanced AI robot with doubled capacity and a new automated meal flattening tool. The post Chef Robotics launches its most advanced assembly robot yet appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586241",
      "title": "Otis shares the secrets to controlling elevators for robots",
      "url": "https://www.therobotreport.com/otis-shares-secrets-controlling-elevators-robots/",
      "publishedAt": "Fri, 19 Dec 2025 19:57:11 +0000",
      "summary": "Otis developed APIs allowing autonomous robots to communicate with and navigate elevators in commercial buildings. The post Otis shares the secrets to controlling elevators for robots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586414",
      "title": "LimX Dynamics unveils TRON 2 shape-shifting limbed robot",
      "url": "https://www.therobotreport.com/limx-dynamics-just-unveiled-tron-2-shape-shifting-robot/",
      "publishedAt": "Fri, 19 Dec 2025 13:45:39 +0000",
      "summary": "The TRON 2 modular tri-form robot supports dual-arm, wheeled, and bipedal configurations for integrated VLA research and development. The post LimX Dynamics unveils TRON 2 shape-shifting limbed robot appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586409",
      "title": "RealMan Robotics open-sources its RealSource robot dataset",
      "url": "https://www.therobotreport.com/realman-robotics-open-sources-realsource-robot-dataset/",
      "publishedAt": "Thu, 18 Dec 2025 21:28:24 +0000",
      "summary": "The dataset is built from 10 real-world simulated environments in RealMan's Beijing Humanoid Robot Data Training Center. The post RealMan Robotics open-sources its RealSource robot dataset appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3077498",
      "title": "Pickle Robot adds Tesla veteran as first CFO",
      "url": "https://techcrunch.com/2025/12/18/pickle-robot-adds-tesla-veteran-as-first-cfo/",
      "publishedAt": "Thu, 18 Dec 2025 20:01:46 +0000",
      "summary": "Jeff Evanson recently joined Pickle Robot as the company's first CFO as the startup has allegedly expanded its partnership with UPS.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586407",
      "title": "Flexxbotics continues expansion, opening office at Newlab in Detroit",
      "url": "https://www.therobotreport.com/newlab-detroit-opens-flexxbotics-expands/",
      "publishedAt": "Thu, 18 Dec 2025 15:54:15 +0000",
      "summary": "With Newlab, Flexxbotics, which digitalizes industrial automation, is establishing a presence in the heart of U.S. manufacturing. The post Flexxbotics continues expansion, opening office at Newlab in Detroit appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88410",
      "title": "Into the Omniverse: OpenUSD and NVIDIA Halos Accelerate Safety for Robotaxis, Physical AI Systems",
      "url": "https://blogs.nvidia.com/blog/openusd-halos-safety-robotaxi-physical-ai/",
      "publishedAt": "Wed, 17 Dec 2025 17:00:49 +0000",
      "summary": "Physical AI is moving from research labs into the real world, powering intelligent robots and autonomous vehicles (AVs) — such as robotaxis — that must reliably sense, reason and act amid unpredictable conditions.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88276",
      "title": "Cheers to AI: ADAM Robot Bartender Makes Drinks at Vegas Golden Knights Game",
      "url": "https://blogs.nvidia.com/blog/adam-robot-vegas-golden-knights-thor/",
      "publishedAt": "Fri, 12 Dec 2025 16:00:04 +0000",
      "summary": "In Las Vegas’s T-Mobile Arena, fans of the Golden Knights are getting more than just hockey — they’re getting a taste of the future. ADAM, a robot developed with NVIDIA Isaac libraries, is pouring drinks and turning heads in one of the NHL’s most exciting venues. ADAM, short for Automated Dual Arm Mixologist, was developed Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3075424",
      "title": "1X struck a deal to send its &#8216;home&#8217; humanoids to factories and warehouses",
      "url": "https://techcrunch.com/2025/12/11/1x-struck-a-deal-to-send-its-home-humanoids-to-factories-and-warehouses/",
      "publishedAt": "Thu, 11 Dec 2025 22:03:36 +0000",
      "summary": "Despite launching as a humanoid robot designed to help consumers around the house, 1X's Neo robots are heading to industrial use cases.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.08766v2",
      "title": "Optimal navigation in two-dimensional flows: control theory and reinforcement learning",
      "url": "https://arxiv.org/abs/2512.08766v2",
      "publishedAt": "2025-12-09T16:14:07Z",
      "summary": "Zermelo's navigation problem seeks the trajectory of minimal travel time between two points in a fluid flow. We address this problem for an agent -- such as a micro-robot or active particle -- that is advected by a two-dimensional flow, self-propels at a fixed speed smaller than or comparable to the characteristic flow velocity, and can steer its direction.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88078",
      "title": "Robots’ Holiday Wishes Come True: NVIDIA Jetson Platform Offers High-Performance Edge AI at Festive Prices",
      "url": "https://blogs.nvidia.com/blog/jetson-edge-ai-holiday-2025/",
      "publishedAt": "Thu, 04 Dec 2025 16:00:07 +0000",
      "summary": "Editor’s note: This blog has been updated to showcase additional recent innovations tapping into the NVIDIA Jetson platform. Developers, researchers, hobbyists and students can take a byte out of holiday shopping this season as NVIDIA has unwrapped special discounts on the NVIDIA Jetson family of developer kits for edge AI and robotics — available through Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87946",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "publishedAt": "Tue, 02 Dec 2025 16:00:27 +0000",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87911",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "publishedAt": "Mon, 01 Dec 2025 17:00:48 +0000",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.21203v4",
      "title": "Transformer Driven Visual Servoing for Fabric Texture Matching Using Dual-Arm Manipulator",
      "url": "https://arxiv.org/abs/2511.21203v4",
      "publishedAt": "2025-11-26T09:33:03Z",
      "summary": "In this paper, we propose a method to align and place a fabric piece on top of another using a dual-arm manipulator and a grayscale camera, so that their surface textures are accurately matched. We propose a novel control scheme that combines Transformer-driven visual servoing with dualarm impedance control.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3069331",
      "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
      "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/",
      "publishedAt": "Thu, 20 Nov 2025 18:00:01 +0000",
      "summary": "Point One Navigation, now valued at $230 million, is building out well beyond automotive.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.16262v2",
      "title": "How Robot Dogs See the Unseeable: Improving Visual Interpretability via Peering for Exploratory Robots",
      "url": "https://arxiv.org/abs/2511.16262v2",
      "publishedAt": "2025-11-20T11:41:48Z",
      "summary": "Occlusion from obstacles, such as foliage, can severely obstruct a robot's sensors, impairing scene understanding. We show that \"peering\", a characteristic side-to-side movement used by insects to overcome their visual limitations, can also allow robots to markedly improve visual reasoning under partial occlusion.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87636",
      "title": "Powering AI Superfactories, NVIDIA and Microsoft Integrate Latest Technologies for Inference, Cybersecurity, Physical AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-microsoft-ai-superfactories/",
      "publishedAt": "Tue, 18 Nov 2025 20:00:22 +0000",
      "summary": "Timed with the Microsoft Ignite conference running this week, NVIDIA is expanding its collaboration with Microsoft, including through the adoption of next-generation NVIDIA Spectrum-X Ethernet switches for the new Microsoft Fairwater AI superfactory, powered by the NVIDIA Blackwell platform. The collaboration brings new integrations across Microsoft 365 Copilot, as well as the public preview of Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87325",
      "title": "AI On: 3 Ways to Bring Agentic AI to Computer Vision Applications",
      "url": "https://blogs.nvidia.com/blog/ways-to-bring-agentic-ai-to-computer-vision-applications/",
      "publishedAt": "Thu, 13 Nov 2025 18:50:06 +0000",
      "summary": "Editor’s note: This post is part of the AI On blog series, which explores the latest techniques and real-world applications of agentic AI, chatbots and copilots. The series also highlights the NVIDIA software and hardware powering advanced AI agents, which form the foundation of AI query engines that gather insights and perform tasks to transform Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3066690",
      "title": "Why a researcher is building robots that look and act like bats",
      "url": "https://techcrunch.com/2025/11/12/why-a-researcher-is-building-robots-that-look-and-act-like-bats/",
      "publishedAt": "Wed, 12 Nov 2025 17:12:07 +0000",
      "summary": "These palm-sized robots use ultrasound signals to navigate harsh conditions in search and rescue missions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot – and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models — which power robots, autonomous vehicles and other intelligent machines — must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on What’s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness 🔗 A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment can’t be limited to a few urban tech hubs — it must reach every community, university and state. That’s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology — contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86265",
      "title": "NVIDIA Contributes to Open Frameworks for Next-Generation Robotics Development",
      "url": "https://blogs.nvidia.com/blog/roscon-2025-open-framework-robotics/",
      "publishedAt": "Mon, 27 Oct 2025 00:00:55 +0000",
      "summary": "This year’s ROSCon conference heads to Singapore, bringing together the global robotics developer community behind Robot Operating System (ROS) — the world’s most widely adopted open framework for building robots. At the conference, running through Wednesday, Oct. 29, NVIDIA announced collaborations with partners and the Open Source Robotics Alliance (OSRA), as well as new robotics Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.13626v3",
      "title": "LIBERO-Plus: In-depth Robustness Analysis of Vision-Language-Action Models",
      "url": "https://arxiv.org/abs/2510.13626v3",
      "publishedAt": "2025-10-15T14:51:36Z",
      "summary": "Visual-Language-Action (VLA) models report impressive success rates on robotic manipulation benchmarks, yet these results may mask fundamental weaknesses in robustness. We perform a systematic vulnerability analysis by introducing controlled perturbations across seven dimensions: objects layout, camera viewpoints, robot initial states, language instructions, light conditions, background textures and sensor noise.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=85387",
      "title": "Into the Omniverse: Open-Source Physics Engine and OpenUSD Advance Robot Learning",
      "url": "https://blogs.nvidia.com/blog/newton-physics-engine-openusd/",
      "publishedAt": "Tue, 30 Sep 2025 13:00:07 +0000",
      "summary": "Building robots that can effectively operate alongside human workers in factories, hospitals and public spaces presents an enormous technical challenge. These robots require humanlike dexterity, perception, cognition and whole-body coordination to navigate unpredictable real-world environments in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.17346v2",
      "title": "GroundGazer: Camera-based indoor localization of mobile robots with millimeter accuracy at low cost",
      "url": "https://arxiv.org/abs/2509.17346v2",
      "publishedAt": "2025-09-22T04:18:10Z",
      "summary": "Highly accurate indoor localization systems with mm positioning accuracy are currently very expensive. They include range finders (such as LiDAR), tachymeters, and motion capture systems relying on multiple high-end cameras. In this work, we introduce a high-accuracy, planar indoor localization system named GroundGazer (GG) for autonomous mobile robots (AMRs).",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2509.08085v2",
      "title": "Planar Juggling of a Devil-Stick using Discrete VHCs",
      "url": "https://arxiv.org/abs/2509.08085v2",
      "publishedAt": "2025-09-09T18:43:19Z",
      "summary": "Planar juggling of a devil-stick using impulsive inputs is addressed using the concept of discrete virtual holonomic constraints (DVHC). The location of the center-of-mass of the devil-stick is specified in terms of its orientation at the discrete instants when impulsive control inputs are applied. The discrete zero dynamics (DZD) resulting from the choice of DVHC provides conditions for stable juggling.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2509.05723v2",
      "title": "Super-LIO: A Robust and Efficient LiDAR-Inertial Odometry System with a Compact Mapping Strategy",
      "url": "https://arxiv.org/abs/2509.05723v2",
      "publishedAt": "2025-09-06T14:07:35Z",
      "summary": "LiDAR-Inertial Odometry (LIO) is a foundational technique for autonomous systems, yet its deployment on resource-constrained platforms remains challenging due to computational and memory limitations. We propose Super-LIO, a robust LIO system that demands both high performance and accuracy, ideal for applications such as aerial robots and mobile autonomous systems.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=84322",
      "title": "How Do You Teach an AI Model to Reason? With Humans",
      "url": "https://blogs.nvidia.com/blog/ai-reasoning-cosmos/",
      "publishedAt": "Wed, 27 Aug 2025 23:13:16 +0000",
      "summary": "AI models are advancing at a rapid rate and scale. But what might they lack that (most) humans don’t? Common sense: an understanding, developed through real-world experiences, that birds can’t fly backwards, mirrors are reflective and ice melts into water. While such principles seem obvious to humans, they must be taught to AI models tasked Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=84194",
      "title": "NVIDIA Jetson Thor Unlocks Real-Time Reasoning for General Robotics and Physical AI",
      "url": "https://blogs.nvidia.com/blog/jetson-thor-physical-ai-edge/",
      "publishedAt": "Mon, 25 Aug 2025 15:00:31 +0000",
      "summary": "Robots around the world are about to get a lot smarter as physical AI developers plug in NVIDIA Jetson Thor modules — new robotics computers that can serve as the brains for robotic systems across research and industry. Robots demand rich sensor data and low-latency AI processing. Running real-time robotic applications requires significant AI compute Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83816",
      "title": "Celebrating More Than 2 Million Developers Embracing NVIDIA Robotics",
      "url": "https://blogs.nvidia.com/blog/2-million-robotics-developers/",
      "publishedAt": "Mon, 18 Aug 2025 16:00:34 +0000",
      "summary": "We’re celebrating the more than 2 million developers now using the NVIDIA robotics stack. These builders are reshaping industries across manufacturing, food delivery, agriculture, healthcare, facilities maintenance and much more.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83562",
      "title": "Making Safer Spaces: NVIDIA and Partners Bring Physical AI to Cities and Industrial Infrastructure",
      "url": "https://blogs.nvidia.com/blog/physical-ai-partners-metropolis-updates-siggraph/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:44 +0000",
      "summary": "Physical AI is becoming the foundation of smart cities, facilities and industrial processes across the globe. NVIDIA is working with companies including Accenture, Avathon, Belden, DeepHow, Milestone Systems and Telit Cinterion to enhance operations across the globe with physical AI-based perception and reasoning. The continuous loop of simulating, training and deploying physical AI offers sophisticated Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=83581",
      "title": "Amazon Devices &#038; Services Achieves Major Step Toward Zero-Touch Manufacturing With NVIDIA AI and Digital Twins",
      "url": "https://blogs.nvidia.com/blog/amazon-zero-touch-manufacturing/",
      "publishedAt": "Mon, 11 Aug 2025 15:00:00 +0000",
      "summary": "Using NVIDIA digital twin technologies, Amazon Devices &#38; Services is powering big leaps in manufacturing with a new physical AI software solution. Deployed this month at an Amazon Devices facility, the company’s innovative, simulation-first approach for zero-touch manufacturing trains robotic arms to inspect diverse devices for product-quality auditing and integrate new goods into the production Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2507.19854v2",
      "title": "Think, Act, Learn: A Framework for Autonomous Robotic Agents using Closed-Loop Large Language Models",
      "url": "https://arxiv.org/abs/2507.19854v2",
      "publishedAt": "2025-07-26T08:06:51Z",
      "summary": "The integration of Large Language Models (LLMs) into robotics has unlocked unprecedented capabilities in high-level task planning. However, most current systems operate in an open-loop fashion, where LLMs act as one-shot planners, rendering them brittle and unable to adapt to unforeseen circumstances in dynamic physical environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2507.05822v2",
      "title": "Video Event Reasoning and Prediction by Fusing World Knowledge from LLMs with Vision Foundation Models",
      "url": "https://arxiv.org/abs/2507.05822v2",
      "publishedAt": "2025-07-08T09:43:17Z",
      "summary": "Current video understanding models excel at recognizing \"what\" is happening but fall short in high-level cognitive tasks like causal reasoning and future prediction, a limitation rooted in their lack of commonsense world knowledge.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2506.16685v5",
      "title": "Compliant Residual DAgger: Improving Real-World Contact-Rich Manipulation with Human Corrections",
      "url": "https://arxiv.org/abs/2506.16685v5",
      "publishedAt": "2025-06-20T01:57:47Z",
      "summary": "We address key challenges in Dataset Aggregation (DAgger) for real-world contact-rich manipulation: how to collect informative human correction data and how to effectively update policies with this new data.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3018019",
      "title": "Sam Altman-backed Coco Robotics raises $80M",
      "url": "https://techcrunch.com/2025/06/11/sam-altman-backed-coco-robotics-raises-80m/",
      "publishedAt": "Wed, 11 Jun 2025 20:40:15 +0000",
      "summary": "Coco Robotics has made more than 500,000 deliveries with its zero-emissions robots since they hit the streets in 2020.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3017761",
      "title": "Meta&#8217;s V-JEPA 2 model teaches AI to understand its surroundings",
      "url": "https://techcrunch.com/2025/06/11/metas-v-jepa-2-model-teaches-ai-to-understand-its-surroundings/",
      "publishedAt": "Wed, 11 Jun 2025 15:54:09 +0000",
      "summary": "Meta's V-JEPA 2 model is a \"world model,\" referring to AI that is designed to understand its physical surroundings.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3016198",
      "title": "Tesla&#8217;s Optimus robot VP is leaving the company",
      "url": "https://techcrunch.com/2025/06/06/teslas-optimus-robot-vp-is-reportedly-leaving-the-company/",
      "publishedAt": "Fri, 06 Jun 2025 20:30:46 +0000",
      "summary": "Milan Kovac, head of Tesla's Optimus humanoid robot program, is leaving the company to spend more time with family, and he said that his support for Musk and Tesla is \"ironclad.\"",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3015738",
      "title": "Amazon launches new R&#038;D group focused on agentic AI and robotics",
      "url": "https://techcrunch.com/2025/06/05/amazon-launches-new-rd-group-focused-on-agentic-ai-and-robotics/",
      "publishedAt": "Thu, 05 Jun 2025 19:48:11 +0000",
      "summary": "Amazon wants this group to develop an agentic AI framework to be used to give its warehouse robots more skills.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.13556v4",
      "title": "Learning collision risk proactively from naturalistic driving data at scale",
      "url": "https://arxiv.org/abs/2505.13556v4",
      "publishedAt": "2025-05-19T07:22:32Z",
      "summary": "Accurately and proactively alerting drivers or automated systems to emerging collisions is crucial for road safety, particularly in highly interactive and complex urban environments. Existing methods either require labour-intensive annotation of sparse risk, struggle to consider varying contextual factors, or are tailored to limited scenarios.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2501.09926v2",
      "title": "ForestProtector: An IoT Architecture Integrating Machine Vision and Deep Reinforcement Learning for Efficient Wildfire Monitoring",
      "url": "https://arxiv.org/abs/2501.09926v2",
      "publishedAt": "2025-01-17T02:47:14Z",
      "summary": "Early detection of forest fires is crucial to minimizing the environmental and socioeconomic damage they cause. Indeed, a fire's duration directly correlates with the difficulty and cost of extinguishing it. For instance, a fire burning for 1 minute might require 1 liter of water to extinguish, while a 2-minute fire could demand 100 liters, and a 10-minute fire might necessitate 1,000 liters.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2404.04832v4",
      "title": "Robotic Sorting Systems: Robot Management and Layout Design Optimization",
      "url": "https://arxiv.org/abs/2404.04832v4",
      "publishedAt": "2024-04-07T06:52:20Z",
      "summary": "In the contemporary logistics industry, automation plays a pivotal role in enhancing production efficiency and expanding industrial scale. Autonomous mobile robots, in particular, have become integral to the modernization efforts in warehouses.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    }
  ]
}