{
  "generatedAt": "2026-02-18T21:14:00.258Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=587019",
      "title": "Ottonomy builds Ottumn.AI platform to orchestrate robots, drones, and smart infrastructure",
      "url": "https://www.therobotreport.com/ottonomy-builds-ottumn-ai-platform-to-orchestrate-robots-drones-and-smart-infrastructure/",
      "publishedAt": "Wed, 18 Feb 2026 20:55:48 +0000",
      "summary": "Ottonomy built Ottumn.AI on NVIDIA's infrastructure to integrate delivery systems for healthcare, logistics, and smart cities. The post Ottonomy builds Ottumn.AI platform to orchestrate robots, drones, and smart infrastructure appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3094024",
      "title": "Amazon halts Blue Jay robotics project after less than 6 months",
      "url": "https://techcrunch.com/2026/02/18/amazon-halts-blue-jay-robotics-project-after-less-than-six-months/",
      "publishedAt": "Wed, 18 Feb 2026 18:27:10 +0000",
      "summary": "Amazon said Blue Jay's core tech will be used for other robotics projects and the employees who worked on it were moved to other projects.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=587012",
      "title": "igus launches new RBTX online shopping experience for robotics developers",
      "url": "https://www.therobotreport.com/igus-launches-new-rbtx-online-shopping-experience-robotics-developers/",
      "publishedAt": "Wed, 18 Feb 2026 18:08:50 +0000",
      "summary": "This shift to a self-serve model removes the requirement for a sales consultation, providing a streamlined experience, igus said. The post igus launches new RBTX online shopping experience for robotics developers appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=587013",
      "title": "Mitsubishi Electric follows digital-first strategy for advanced air mobility",
      "url": "https://www.therobotreport.com/mitsubishi-electric-follows-digital-first-strategy-for-drone-management/",
      "publishedAt": "Wed, 18 Feb 2026 16:34:42 +0000",
      "summary": "Mitsubishi Electric United States is focused on helping companies with digital-first initiatives such as AnyMile for drone cargo management. The post Mitsubishi Electric follows digital-first strategy for advanced air mobility appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=89995",
      "title": "NVIDIA and Global Industrial Software Leaders Partner With India’s Largest Manufacturers to Drive AI Boom",
      "url": "https://blogs.nvidia.com/blog/india-global-industrial-software-leaders-manufacturers-ai/",
      "publishedAt": "Wed, 18 Feb 2026 00:30:32 +0000",
      "summary": "India is entering a new age of industrialization, as AI transforms how the world designs, builds and runs physical products and systems. The country is investing $134 billion dollars in new manufacturing capacity across construction, automotive, renewable energy and robotics, creating both a massive challenge and opportunity to build software-defined factories from day one. At Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=587005",
      "title": "Medtronic earns FDA clearance for Stealth AXiS spinal surgery system",
      "url": "https://www.therobotreport.com/medtronic-earns-fda-clearance-for-stealth-axis-spinal-surgery-system/",
      "publishedAt": "Tue, 17 Feb 2026 23:54:58 +0000",
      "summary": "Medtronic built the Stealth AXiS system to support a wide range of surgeon preferences, clinical complexity, and care settings. The post Medtronic earns FDA clearance for Stealth AXiS spinal surgery system appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=587006",
      "title": "IFR releases position paper on AI in robotics",
      "url": "https://www.therobotreport.com/ifr-releases-position-paper-ai-robotics/",
      "publishedAt": "Tue, 17 Feb 2026 22:20:09 +0000",
      "summary": "Artificial intelligence is transforming the robotics field at a rapid pace, according to the International Federation of Robotics or IFR. The post IFR releases position paper on AI in robotics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15828v1",
      "title": "Dex4D: Task-Agnostic Point Track Policy for Sim-to-Real Dexterous Manipulation",
      "url": "https://arxiv.org/abs/2602.15828v1",
      "publishedAt": "2026-02-17T18:59:31Z",
      "summary": "Learning generalist policies capable of accomplishing a plethora of everyday tasks remains an open challenge in dexterous manipulation. In particular, collecting large-scale manipulation data via real-world teleoperation is expensive and difficult to scale. While learning in simulation provides a feasible alternative, designing multiple task-specific environments and rewards for training is similarly challenging.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.15827v1",
      "title": "Perceptive Humanoid Parkour: Chaining Dynamic Human Skills via Motion Matching",
      "url": "https://arxiv.org/abs/2602.15827v1",
      "publishedAt": "2026-02-17T18:59:11Z",
      "summary": "While recent advances in humanoid locomotion have achieved stable walking on varied terrains, capturing the agility and adaptivity of highly dynamic human motions remains an open challenge. In particular, agile parkour in complex environments demands not only low-level robustness, but also human-like motion expressiveness, long-horizon skill composition, and perception-driven decision-making.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15817v1",
      "title": "Solving Parameter-Robust Avoid Problems with Unknown Feasibility using Reinforcement Learning",
      "url": "https://arxiv.org/abs/2602.15817v1",
      "publishedAt": "2026-02-17T18:53:31Z",
      "summary": "Recent advances in deep reinforcement learning (RL) have achieved strong results on high-dimensional control tasks, but applying RL to reachability problems raises a fundamental mismatch: reachability seeks to maximize the set of states from which a system remains safe indefinitely, while RL optimizes expected returns over a user-specified distribution.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15813v1",
      "title": "FAST-EQA: Efficient Embodied Question Answering with Global and Local Region Relevancy",
      "url": "https://arxiv.org/abs/2602.15813v1",
      "publishedAt": "2026-02-17T18:49:43Z",
      "summary": "Embodied Question Answering (EQA) combines visual scene understanding, goal-directed exploration, spatial and temporal reasoning under partial observability. A central challenge is to confine physical search to question-relevant subspaces while maintaining a compact, actionable memory of observations. Furthermore, for real-world deployment, fast inference time during exploration is crucial.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=587001",
      "title": "ARM Institute opens project call for military supply chain technology",
      "url": "https://www.therobotreport.com/arm-institute-opens-project-call-for-military-supply-chain-technology/",
      "publishedAt": "Tue, 17 Feb 2026 18:31:05 +0000",
      "summary": "The Office of the Secretary of Defense is working with the ARM Institute and other manufacturing innovation institutes on this project. The post ARM Institute opens project call for military supply chain technology appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15791v1",
      "title": "Enhancing Building Semantics Preservation in AI Model Training with Large Language Model Encodings",
      "url": "https://arxiv.org/abs/2602.15791v1",
      "publishedAt": "2026-02-17T18:26:36Z",
      "summary": "Accurate representation of building semantics, encompassing both generic object types and specific subtypes, is essential for effective AI model training in the architecture, engineering, construction, and operation (AECO) industry. Conventional encoding methods (e.g., one-hot) often fail to convey the nuanced relationships among closely related subtypes, limiting AI's semantic comprehension.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15767v1",
      "title": "Robot-Assisted Social Dining as a White Glove Service",
      "url": "https://arxiv.org/abs/2602.15767v1",
      "publishedAt": "2026-02-17T17:58:25Z",
      "summary": "Robot-assisted feeding enables people with disabilities who require assistance eating to enjoy a meal independently and with dignity. However, existing systems have only been tested in-lab or in-home, leaving in-the-wild social dining contexts (e.g., restaurants) largely unexplored.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15755v1",
      "title": "RaCo: Ranking and Covariance for Practical Learned Keypoints",
      "url": "https://arxiv.org/abs/2602.15755v1",
      "publishedAt": "2026-02-17T17:39:52Z",
      "summary": "This paper introduces RaCo, a lightweight neural network designed to learn robust and versatile keypoints suitable for a variety of 3D computer vision tasks. The model integrates three key components: the repeatable keypoint detector, a differentiable ranker to maximize matches with a limited number of keypoints, and a covariance estimator to quantify spatial uncertainty in metric scale.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15733v1",
      "title": "MeshMimic: Geometry-Aware Humanoid Motion Learning through 3D Scene Reconstruction",
      "url": "https://arxiv.org/abs/2602.15733v1",
      "publishedAt": "2026-02-17T17:09:45Z",
      "summary": "Humanoid motion control has witnessed significant breakthroughs in recent years, with deep reinforcement learning (RL) emerging as a primary catalyst for achieving complex, human-like behaviors. However, the high dimensionality and intricate dynamics of humanoid robots make manual motion design impractical, leading to a heavy reliance on expensive motion capture (MoCap) data.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15721v1",
      "title": "Lifelong Scalable Multi-Agent Realistic Testbed and A Comprehensive Study on Design Choices in Lifelong AGV Fleet Management Systems",
      "url": "https://arxiv.org/abs/2602.15721v1",
      "publishedAt": "2026-02-17T16:53:20Z",
      "summary": "We present Lifelong Scalable Multi-Agent Realistic Testbed (LSMART), an open-source simulator to evaluate any Multi-Agent Path Finding (MAPF) algorithm in a Fleet Management System (FMS) with Automated Guided Vehicles (AGVs). MAPF aims to move a group of agents from their corresponding starting locations to their goals. Lifelong MAPF (LMAPF) is a variant of MAPF that continuously assigns new goals for agents to reach.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.15684v1",
      "title": "Estimating Human Muscular Fatigue in Dynamic Collaborative Robotic Tasks with Learning-Based Models",
      "url": "https://arxiv.org/abs/2602.15684v1",
      "publishedAt": "2026-02-17T16:08:11Z",
      "summary": "Assessing human muscle fatigue is critical for optimizing performance and safety in physical human-robot interaction(pHRI). This work presents a data-driven framework to estimate fatigue in dynamic, cyclic pHRI using arm-mounted surface electromyography(sEMG).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15642v1",
      "title": "Spatially-Aware Adaptive Trajectory Optimization with Controller-Guided Feedback for Autonomous Racing",
      "url": "https://arxiv.org/abs/2602.15642v1",
      "publishedAt": "2026-02-17T15:10:44Z",
      "summary": "We present a closed-loop framework for autonomous raceline optimization that combines NURBS-based trajectory representation, CMA-ES global trajectory optimization, and controller-guided spatial feedback. Instead of treating tracking errors as transient disturbances, our method exploits them as informative signals of local track characteristics via a Kalman-inspired spatial update.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.15633v1",
      "title": "SpecFuse: A Spectral-Temporal Fusion Predictive Control Framework for UAV Landing on Oscillating Marine Platforms",
      "url": "https://arxiv.org/abs/2602.15633v1",
      "publishedAt": "2026-02-17T15:03:05Z",
      "summary": "Autonomous landing of Uncrewed Aerial Vehicles (UAVs) on oscillating marine platforms is severely constrained by wave-induced multi-frequency oscillations, wind disturbances, and prediction phase lags in motion prediction. Existing methods either treat platform motion as a general random process or lack explicit modeling of wave spectral characteristics, leading to suboptimal performance under dynamic sea conditions.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.15608v1",
      "title": "Grip as Needed, Glide on Demand: Ultrasonic Lubrication for Robotic Locomotion",
      "url": "https://arxiv.org/abs/2602.15608v1",
      "publishedAt": "2026-02-17T14:33:17Z",
      "summary": "Friction is the essential mediator of terrestrial locomotion, yet in robotic systems it is almost always treated as a passive property fixed by surface materials and conditions. Here, we introduce ultrasonic lubrication as a method to actively control friction in robotic locomotion.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.15567v1",
      "title": "Constraining Streaming Flow Models for Adapting Learned Robot Trajectory Distributions",
      "url": "https://arxiv.org/abs/2602.15567v1",
      "publishedAt": "2026-02-17T13:27:05Z",
      "summary": "Robot motion distributions often exhibit multi-modality and require flexible generative models for accurate representation. Streaming Flow Policies (SFPs) have recently emerged as a powerful paradigm for generating robot trajectories by integrating learned velocity fields directly in action space, enabling smooth and reactive control.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15549v1",
      "title": "VLM-DEWM: Dynamic External World Model for Verifiable and Resilient Vision-Language Planning in Manufacturing",
      "url": "https://arxiv.org/abs/2602.15549v1",
      "publishedAt": "2026-02-17T12:54:18Z",
      "summary": "Vision-language model (VLM) shows promise for high-level planning in smart manufacturing, yet their deployment in dynamic workcells faces two critical challenges: (1) stateless operation, they cannot persistently track out-of-view states, causing world-state drift; and (2) opaque reasoning, failures are difficult to diagnose, leading to costly blind retries.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15543v1",
      "title": "Selective Perception for Robot: Task-Aware Attention in Multimodal VLA",
      "url": "https://arxiv.org/abs/2602.15543v1",
      "publishedAt": "2026-02-17T12:48:59Z",
      "summary": "In robotics, Vision-Language-Action (VLA) models that integrate diverse multimodal signals from multi-view inputs have emerged as an effective approach. However, most prior work adopts static fusion that processes all visual inputs uniformly, which incurs unnecessary computational overhead and allows task-irrelevant background information to act as noise.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15533v1",
      "title": "Efficient Knowledge Transfer for Jump-Starting Control Policy Learning of Multirotors through Physics-Aware Neural Architectures",
      "url": "https://arxiv.org/abs/2602.15533v1",
      "publishedAt": "2026-02-17T12:31:53Z",
      "summary": "Efficiently training control policies for robots is a major challenge that can greatly benefit from utilizing knowledge gained from training similar systems through cross-embodiment knowledge transfer. In this work, we focus on accelerating policy training using a library-based initialization scheme that enables effective knowledge transfer across multirotor configurations.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.15513v1",
      "title": "Improving MLLMs in Embodied Exploration and Question Answering with Human-Inspired Memory Modeling",
      "url": "https://arxiv.org/abs/2602.15513v1",
      "publishedAt": "2026-02-17T11:41:28Z",
      "summary": "Deploying Multimodal Large Language Models as the brain of embodied agents remains challenging, particularly under long-horizon observations and limited context budgets. Existing memory assisted methods often rely on textual summaries, which discard rich visual and spatial details and remain brittle in non-stationary environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15490v1",
      "title": "RPT-SR: Regional Prior attention Transformer for infrared image Super-Resolution",
      "url": "https://arxiv.org/abs/2602.15490v1",
      "publishedAt": "2026-02-17T10:56:49Z",
      "summary": "General-purpose super-resolution models, particularly Vision Transformers, have achieved remarkable success but exhibit fundamental inefficiencies in common infrared imaging scenarios like surveillance and autonomous driving, which operate from fixed or nearly-static viewpoints.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15424v1",
      "title": "Lyapunov-Based $\\mathcal{L}_2$-Stable PI-Like Control of a Four-Wheel Independently Driven and Steered Robot",
      "url": "https://arxiv.org/abs/2602.15424v1",
      "publishedAt": "2026-02-17T08:36:13Z",
      "summary": "In this letter, Lyapunov-based synthesis of a PI-like controller is proposed for $\\mathcal{L}_2$-stable motion control of an independently driven and steered four-wheel mobile robot. An explicit, structurally verified model is used to enable systematic controller design with stability and performance guarantees suitable for real-time operation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15400v1",
      "title": "One Agent to Guide Them All: Empowering MLLMs for Vision-and-Language Navigation via Explicit World Representation",
      "url": "https://arxiv.org/abs/2602.15400v1",
      "publishedAt": "2026-02-17T07:13:48Z",
      "summary": "A navigable agent needs to understand both high-level semantic instructions and precise spatial perceptions. Building navigation agents centered on Multimodal Large Language Models (MLLMs) demonstrates a promising solution due to their powerful generalization ability. However, the current tightly coupled design dramatically limits system performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15398v1",
      "title": "Hybrid F' and ROS2 Architecture for Vision-Based Autonomous Flight: Design and Experimental Validation",
      "url": "https://arxiv.org/abs/2602.15398v1",
      "publishedAt": "2026-02-17T07:12:06Z",
      "summary": "Autonomous aerospace systems require architectures that balance deterministic real-time control with advanced perception capabilities. This paper presents an integrated system combining NASA's F' flight software framework with ROS2 middleware via Protocol Buffers bridging. We evaluate the architecture through a 32.25-minute indoor quadrotor flight test using vision-based navigation.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.15397v1",
      "title": "ActionCodec: What Makes for Good Action Tokenizers",
      "url": "https://arxiv.org/abs/2602.15397v1",
      "publishedAt": "2026-02-17T07:07:15Z",
      "summary": "Vision-Language-Action (VLA) models leveraging the native autoregressive paradigm of Vision-Language Models (VLMs) have demonstrated superior instruction-following and training efficiency. Central to this paradigm is action tokenization, yet its design has primarily focused on reconstruction fidelity, failing to address its direct impact on VLA optimization.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586997",
      "title": "How motor design enables different types of robots",
      "url": "https://www.therobotreport.com/how-motor-design-enables-different-types-of-robots/",
      "publishedAt": "Mon, 16 Feb 2026 15:05:10 +0000",
      "summary": "Advances in motor design have allowed different types of robots to both specialize for industrial functions and converge in precision. The post How motor design enables different types of robots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586991",
      "title": "The keys to designing safe and shared cobot workspaces",
      "url": "https://www.therobotreport.com/keys-designing-safe-shared-cobot-workspaces/",
      "publishedAt": "Mon, 16 Feb 2026 13:30:25 +0000",
      "summary": "Force- and power-limited robot arms, are only as safe as the quality of cobot workspace design, explains a columnist. The post The keys to designing safe and shared cobot workspaces appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.14674v2",
      "title": "From User Preferences to Base Score Extraction Functions in Gradual Argumentation (with Appendix)",
      "url": "https://arxiv.org/abs/2602.14674v2",
      "publishedAt": "2026-02-16T12:01:58Z",
      "summary": "Gradual argumentation is a field of symbolic AI which is attracting attention for its ability to support transparent and contestable AI systems. It is considered a useful tool in domains such as decision-making, recommendation, debate analysis, and others. The outcomes in such domains are usually dependent on the arguments' base scores, which must be selected carefully.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586987",
      "title": "High-precision robots: What to do when absolute accuracy is poor?",
      "url": "https://www.therobotreport.com/high-precision-robots-what-to-do-when-absolute-accuracy-is-poor/",
      "publishedAt": "Sun, 15 Feb 2026 13:34:12 +0000",
      "summary": "The Fraunhofer Institute for Manufacturing Engineering and Automation IPA is helping to improve absolute accuracy for robots. The post High-precision robots: What to do when absolute accuracy is poor? appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586974",
      "title": "ServoBelt offers high-end performance for automotive gantry",
      "url": "https://www.therobotreport.com/servobelt-offers-high-end-performance-automotive-gantry/",
      "publishedAt": "Sat, 14 Feb 2026 13:30:59 +0000",
      "summary": "Bell-Everman says its ServoBelt technology provides a cost-effective alternative to oversized gantry systems without sacrificing industrial-grade performance. The post ServoBelt offers high-end performance for automotive gantry appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586981",
      "title": "Manifest 2026 recap",
      "url": "https://www.therobotreport.com/manifest-2026-recap/",
      "publishedAt": "Sat, 14 Feb 2026 00:21:08 +0000",
      "summary": "Editors Mike Oitzman and Gene Demaitre recap the latest robotics news and their recent trip to the Manifest supply chain trade show in Las Vegas. The post Manifest 2026 recap appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586983",
      "title": "Realbotix makes transition from novelty to embodied AI",
      "url": "https://www.therobotreport.com/realbotix-makes-transition-from-novelty-to-embodied-ai/",
      "publishedAt": "Fri, 13 Feb 2026 22:03:51 +0000",
      "summary": "Realbotix, which showed its humanoids at CES 2026, illustrates how technology can mature past adult entertainment, writes columnist Oliver Mitchell. The post Realbotix makes transition from novelty to embodied AI appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586970",
      "title": "Trener Robotics raises $32M for robot-agnostic skills platform",
      "url": "https://www.therobotreport.com/trener-robotics-raises-32m-for-robot-agnostic-skills-platform/",
      "publishedAt": "Fri, 13 Feb 2026 13:30:30 +0000",
      "summary": "Trener Robotics’ Acteris is a robot-agnostic skills platform that lets operators describe the tasks they want to automate in their own words. The post Trener Robotics raises $32M for robot-agnostic skills platform appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12794v2",
      "title": "SafeFlowMPC: Predictive and Safe Trajectory Planning for Robot Manipulators with Learning-based Policies",
      "url": "https://arxiv.org/abs/2602.12794v2",
      "publishedAt": "2026-02-13T10:23:43Z",
      "summary": "The emerging integration of robots into everyday life brings several major challenges. Compared to classical industrial applications, more flexibility is needed in combination with real-time reactivity. Learning-based methods can train powerful policies based on demonstrated trajectories, such that the robot generalizes a task to similar situations.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12694v2",
      "title": "Discovering the mechanics of ultra-low density elastomeric foams in elite-level racing shoes",
      "url": "https://arxiv.org/abs/2602.12694v2",
      "publishedAt": "2026-02-13T07:56:28Z",
      "summary": "Ultra-low-density elastomeric foams enable lightweight systems that combine high compliance with efficient energy return. In high-performance racing shoes, these foams are critical for low weight, high cushioning, and efficient energy return; yet, their constitutive behavior remains difficult to model and poorly understood.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586965",
      "title": "PickNik Robotics to work with Motiv Space Systems on NASA ISAM mission",
      "url": "https://www.therobotreport.com/picknik-robotics-to-work-with-motiv-space-systems-on-nasa-isam-mission/",
      "publishedAt": "Thu, 12 Feb 2026 19:05:16 +0000",
      "summary": "For the mission, Motiv will be developing the robotic system while PickNik will provide robot motion planning and arm control software. The post PickNik Robotics to work with Motiv Space Systems on NASA ISAM mission appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586968",
      "title": "Warehousing robot maker turns to lubrication-free motion plastics",
      "url": "https://www.therobotreport.com/warehousing-robot-maker-turns-to-lubrication-free-motion-plastics/",
      "publishedAt": "Thu, 12 Feb 2026 17:10:39 +0000",
      "summary": "Bastian Solutions needed rugged and reliable bearings for its warehousing robot to load trucks, so it turned to igus motion plastics. The post Warehousing robot maker turns to lubrication-free motion plastics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3091866",
      "title": "Upside Robotics is reducing fertilizer use and waste in corn crops",
      "url": "https://techcrunch.com/2026/02/11/upside-robotics-is-reducing-fertilizer-use-and-waste-in-corn-crops/",
      "publishedAt": "Wed, 11 Feb 2026 16:00:00 +0000",
      "summary": "Upside Robotics builds autonomous solar-powered robots that can help farmers reduce their fertilizer use by 70%.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.02236v3",
      "title": "Online Fine-Tuning of Pretrained Controllers for Autonomous Driving via Real-Time Recurrent RL",
      "url": "https://arxiv.org/abs/2602.02236v3",
      "publishedAt": "2026-02-02T15:41:53Z",
      "summary": "Deploying pretrained policies in real-world applications presents substantial challenges that fundamentally limit the practical applicability of learning-based control systems. When autonomous systems encounter environmental changes in system dynamics, sensor drift, or task objectives, fixed policies rapidly degrade in performance.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Autonomous Driving",
        "RL"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=89488",
      "title": "Into the Omniverse: Physical AI Open Models and Frameworks Advance Robots and Autonomous Systems",
      "url": "https://blogs.nvidia.com/blog/physical-ai-open-models-robot-autonomous-systems-omniverse/",
      "publishedAt": "Thu, 29 Jan 2026 17:00:21 +0000",
      "summary": "Open source has become essential for driving innovation in robotics and autonomy. By providing access to critical infrastructure — from simulation frameworks to AI models — NVIDIA is enabling collaborative development that accelerates the path to safer, more capable autonomous systems.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3083601",
      "title": "How YC-backed Bucket Robotics survived its first CES",
      "url": "https://techcrunch.com/2026/01/18/how-yc-backed-bucket-robotics-survived-its-first-ces/",
      "publishedAt": "Sun, 18 Jan 2026 16:10:00 +0000",
      "summary": "Now, the startup is turning its attention to building the business, fundraising, and striking commercial deals.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3082677",
      "title": "Oshen built the first ocean robot to collect data in a Category 5 hurricane",
      "url": "https://techcrunch.com/2026/01/17/oshen-built-the-first-ocean-robot-to-collect-data-in-a-category-5-hurricane/",
      "publishedAt": "Sat, 17 Jan 2026 16:00:00 +0000",
      "summary": "Oshen has signed contracts with multiple government agencies for its C-Star robots to collect ocean data autonomously.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88971",
      "title": "AI’s Next Revolution: Multiply Labs Is Scaling Robotics-Driven Cell Therapy Biomanufacturing Labs",
      "url": "https://blogs.nvidia.com/blog/multiply-labs-isaac-omniverse/",
      "publishedAt": "Mon, 12 Jan 2026 15:00:48 +0000",
      "summary": "Startup works with leading cell therapy companies to bring robotics manufacturing into the clean room, reducing costs by more than 70% while accelerating output compared with legacy systems.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_video&#038;p=3081489",
      "title": "Inside CES 2026&#8217;s “physical AI” takeover",
      "url": "https://techcrunch.com/video/inside-ces-2026s-physical-ai-takeover/",
      "publishedAt": "Fri, 09 Jan 2026 01:19:00 +0000",
      "summary": "After years of chatbots and image generators, AI is finally leaving the screen. At CES 2026, that shift became impossible to ignore.&#160; The annual tech showcase in Las Vegas was&#160;dominated by &#8220;physical AI&#8221;&#160;and robotics, from Boston Dynamic&#8217;s newly redesigned Atlas humanoid robot to AI-powered ice makers (yes, really). The companies in attendance clearly want consumers [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88856",
      "title": "Japan Science and Technology Agency Develops NVIDIA-Powered Moonshot Robot for Elderly Care",
      "url": "https://blogs.nvidia.com/blog/japan-science-technology-agency-develops-moonshot-robot/",
      "publishedAt": "Thu, 08 Jan 2026 16:00:29 +0000",
      "summary": "The next universal technology since the smartphone is on the horizon — and it may be a little less pocket friendly. The Moonshot research program, funded by the Japan Science and Technology Agency and accelerated by NVIDIA AI and robotics technologies, is working to create a world by 2050 where AI-powered, autonomously learning robots are Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88923",
      "title": "Steel, Sensors and Silicon: How Caterpillar Is Bringing Edge AI to the Jobsite",
      "url": "https://blogs.nvidia.com/blog/caterpillar-ces-2026/",
      "publishedAt": "Wed, 07 Jan 2026 17:15:15 +0000",
      "summary": "At CES, Caterpillar reveals how it’s integrating NVIDIA technologies, from NVIDIA Jetson Thor to speech models, to transform the world’s heavy industries.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88849",
      "title": "From Warehouse to Wallet: New State of AI in Retail and CPG Survey Uncovers How AI Is Rewiring Supply Chains and Customer Experiences",
      "url": "https://blogs.nvidia.com/blog/ai-in-retail-cpg-survey-2026/",
      "publishedAt": "Wed, 07 Jan 2026 14:00:06 +0000",
      "summary": "AI has transformed retail and consumer packaged goods (CPG) operations, enhancing customer analysis and segmentation to enable greater personalization for marketing and advertising, and boosting the speed and accuracy of demand forecasting for supply chains and logistics. Companies are also raising the bar for customer engagement through intelligent digital shopping assistants and catalog enrichment by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88652",
      "title": "NVIDIA Unveils New Open Models, Data and Tools to Advance AI Across Every Industry",
      "url": "https://blogs.nvidia.com/blog/open-models-data-tools-accelerate-ai/",
      "publishedAt": "Mon, 05 Jan 2026 21:50:50 +0000",
      "summary": "Expanding the open model universe, NVIDIA today released new open models, data and tools to advance AI across every industry. These models — spanning the NVIDIA Nemotron family for agentic AI, the NVIDIA Cosmos platform for physical AI, the new NVIDIA Alpamayo family for autonomous vehicle development, NVIDIA Isaac GR00T for robotics and NVIDIA Clara Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3077498",
      "title": "Pickle Robot adds Tesla veteran as first CFO",
      "url": "https://techcrunch.com/2025/12/18/pickle-robot-adds-tesla-veteran-as-first-cfo/",
      "publishedAt": "Thu, 18 Dec 2025 20:01:46 +0000",
      "summary": "Jeff Evanson recently joined Pickle Robot as the company's first CFO as the startup has allegedly expanded its partnership with UPS.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88410",
      "title": "Into the Omniverse: OpenUSD and NVIDIA Halos Accelerate Safety for Robotaxis, Physical AI Systems",
      "url": "https://blogs.nvidia.com/blog/openusd-halos-safety-robotaxi-physical-ai/",
      "publishedAt": "Wed, 17 Dec 2025 17:00:49 +0000",
      "summary": "Physical AI is moving from research labs into the real world, powering intelligent robots and autonomous vehicles (AVs) — such as robotaxis — that must reliably sense, reason and act amid unpredictable conditions.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88276",
      "title": "Cheers to AI: ADAM Robot Bartender Makes Drinks at Vegas Golden Knights Game",
      "url": "https://blogs.nvidia.com/blog/adam-robot-vegas-golden-knights-thor/",
      "publishedAt": "Fri, 12 Dec 2025 16:00:04 +0000",
      "summary": "In Las Vegas’s T-Mobile Arena, fans of the Golden Knights are getting more than just hockey — they’re getting a taste of the future. ADAM, a robot developed with NVIDIA Isaac libraries, is pouring drinks and turning heads in one of the NHL’s most exciting venues. ADAM, short for Automated Dual Arm Mixologist, was developed Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3075424",
      "title": "1X struck a deal to send its &#8216;home&#8217; humanoids to factories and warehouses",
      "url": "https://techcrunch.com/2025/12/11/1x-struck-a-deal-to-send-its-home-humanoids-to-factories-and-warehouses/",
      "publishedAt": "Thu, 11 Dec 2025 22:03:36 +0000",
      "summary": "Despite launching as a humanoid robot designed to help consumers around the house, 1X's Neo robots are heading to industrial use cases.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2512.07726v2",
      "title": "Multi-Generator Continual Learning for Robust Delay Prediction in 6G",
      "url": "https://arxiv.org/abs/2512.07726v2",
      "publishedAt": "2025-12-08T17:18:04Z",
      "summary": "In future 6G networks, dependable networks will enable telecommunication services such as remote control of robots or vehicles with strict requirements on end-to-end network performance in terms of delay, delay variation, tail distributions, and throughput. With respect to such networks, it is paramount to be able to determine what performance level the network segment can guarantee at a given point in time.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88078",
      "title": "Robots’ Holiday Wishes Come True: NVIDIA Jetson Platform Offers High-Performance Edge AI at Festive Prices",
      "url": "https://blogs.nvidia.com/blog/jetson-edge-ai-holiday-2025/",
      "publishedAt": "Thu, 04 Dec 2025 16:00:07 +0000",
      "summary": "Editor’s note: This blog has been updated to showcase additional recent innovations tapping into the NVIDIA Jetson platform. Developers, researchers, hobbyists and students can take a byte out of holiday shopping this season as NVIDIA has unwrapped special discounts on the NVIDIA Jetson family of developer kits for edge AI and robotics — available through Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87946",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "publishedAt": "Tue, 02 Dec 2025 16:00:27 +0000",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87911",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "publishedAt": "Mon, 01 Dec 2025 17:00:48 +0000",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3069331",
      "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
      "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/",
      "publishedAt": "Thu, 20 Nov 2025 18:00:01 +0000",
      "summary": "Point One Navigation, now valued at $230 million, is building out well beyond automotive.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87636",
      "title": "Powering AI Superfactories, NVIDIA and Microsoft Integrate Latest Technologies for Inference, Cybersecurity, Physical AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-microsoft-ai-superfactories/",
      "publishedAt": "Tue, 18 Nov 2025 20:00:22 +0000",
      "summary": "Timed with the Microsoft Ignite conference running this week, NVIDIA is expanding its collaboration with Microsoft, including through the adoption of next-generation NVIDIA Spectrum-X Ethernet switches for the new Microsoft Fairwater AI superfactory, powered by the NVIDIA Blackwell platform. The collaboration brings new integrations across Microsoft 365 Copilot, as well as the public preview of Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.10874v2",
      "title": "Collaborative Multi-Robot Non-Prehensile Manipulation via Flow-Matching Co-Generation",
      "url": "https://arxiv.org/abs/2511.10874v2",
      "publishedAt": "2025-11-14T01:05:58Z",
      "summary": "Coordinating a team of robots to reposition multiple objects in cluttered environments requires reasoning jointly about where robots should establish contact, how to manipulate objects once contact is made, and how to navigate safely and efficiently at scale.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87325",
      "title": "Nemotron Labs: 3 Ways to Bring Agentic AI to Computer Vision Applications",
      "url": "https://blogs.nvidia.com/blog/ways-to-bring-agentic-ai-to-computer-vision-applications/",
      "publishedAt": "Thu, 13 Nov 2025 18:50:06 +0000",
      "summary": "Editor’s note: This post is part of the Nemotron Labs blog series, which explores how the latest open models, datasets and training techniques help businesses build specialized AI systems and applications on NVIDIA platforms. Each post highlights practical ways to use an open stack to deliver real value in production — from transparent research copilots Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3066690",
      "title": "Why a researcher is building robots that look and act like bats",
      "url": "https://techcrunch.com/2025/11/12/why-a-researcher-is-building-robots-that-look-and-act-like-bats/",
      "publishedAt": "Wed, 12 Nov 2025 17:12:07 +0000",
      "summary": "These palm-sized robots use ultrasound signals to navigate harsh conditions in search and rescue missions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot – and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models — which power robots, autonomous vehicles and other intelligent machines — must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on What’s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness 🔗 A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment can’t be limited to a few urban tech hubs — it must reach every community, university and state. That’s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology — contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2509.21961v2",
      "title": "FlowDrive: moderated flow matching with data balancing for trajectory planning",
      "url": "https://arxiv.org/abs/2509.21961v2",
      "publishedAt": "2025-09-26T06:49:22Z",
      "summary": "Learning-based planners are sensitive to the long-tailed distribution of driving data. Common maneuvers dominate datasets, while dangerous or rare scenarios are sparse. This imbalance can bias models toward the frequent cases and degrade performance on critical scenarios. To tackle this problem, we compare balancing strategies for sampling training data and find reweighting by trajectory pattern an effective approach.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2508.13920v2",
      "title": "LLMind 2.0: Distributed IoT Automation with Natural Language M2M Communication and Lightweight LLM Agents",
      "url": "https://arxiv.org/abs/2508.13920v2",
      "publishedAt": "2025-08-19T15:17:31Z",
      "summary": "Recent advances in large language models (LLMs) have generated great interest in their applications for IoT automation and device management. However, centralized approaches struggle to scale across heterogeneous, large-scale systems. We present LLMind 2.0, a distributed framework that embeds lightweight LLM-empowered device agents and adopts natural language for machine-to-machine (M2M) communication.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2507.01843v2",
      "title": "MoIRA: Modular Instruction Routing Architecture for Multi-Task Robotics",
      "url": "https://arxiv.org/abs/2507.01843v2",
      "publishedAt": "2025-07-02T15:58:47Z",
      "summary": "Mixture-of-Experts (MoE) approaches have recently gained traction in robotics applications due to their ability to dynamically allocate computational resources and specialize sub-networks for distinct tasks or environmental contexts, enabling more efficient decision-making.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2507.01426v2",
      "title": "Prescribed Performance Control of Unknown Euler-Lagrange Systems Under Input Constraints",
      "url": "https://arxiv.org/abs/2507.01426v2",
      "publishedAt": "2025-07-02T07:25:22Z",
      "summary": "In this paper, we present a prescribed performance control framework for trajectory tracking in Euler-Lagrange systems with unknown dynamics and prescribed input constraints. The proposed approach enforces hard funnel constraints, meaning that the prescribed performance bounds must not be violated during operation.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2502.07851v2",
      "title": "Fast and Near-Optimal Collision-Free Robot Scheduling On Paths",
      "url": "https://arxiv.org/abs/2502.07851v2",
      "publishedAt": "2025-02-11T11:14:07Z",
      "summary": "In this paper, we address the problem of scheduling a set of robots to complete tasks in a laboratory environment, modelled as a graph, while avoiding collisions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2410.05225v3",
      "title": "ETGL-DDPG: A Deep Deterministic Policy Gradient Algorithm for Sparse Reward Continuous Control",
      "url": "https://arxiv.org/abs/2410.05225v3",
      "publishedAt": "2024-10-07T17:31:52Z",
      "summary": "We consider deep deterministic policy gradient (DDPG) in the context of reinforcement learning with sparse rewards. To enhance exploration, we introduce a search procedure, \\emph{$ε{t}$-greedy}, which generates exploratory options for exploring less-visited states. We prove that search using $εt$-greedy has polynomial sample complexity under mild MDP assumptions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    }
  ]
}