{
  "generatedAt": "2026-02-14T18:07:47.955Z",
  "count": 89,
  "items": [
    {
      "id": "https://www.therobotreport.com/?p=586974",
      "title": "ServoBelt offers high-end performance for automotive gantry",
      "url": "https://www.therobotreport.com/servobelt-offers-high-end-performance-automotive-gantry/",
      "publishedAt": "Sat, 14 Feb 2026 13:30:59 +0000",
      "summary": "Bell-Everman says its ServoBelt technology provides a cost-effective alternative to oversized gantry systems without sacrificing industrial-grade performance. The post ServoBelt offers high-end performance for automotive gantry appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586981",
      "title": "Manifest 2026 recap",
      "url": "https://www.therobotreport.com/manifest-2026-recap/",
      "publishedAt": "Sat, 14 Feb 2026 00:21:08 +0000",
      "summary": "Editors Mike Oitzman and Gene Demaitre recap the latest robotics news and their recent trip to the Manifest supply chain trade show in Las Vegas. The post Manifest 2026 recap appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586983",
      "title": "Realbotix makes transition from novelty to embodied AI",
      "url": "https://www.therobotreport.com/realbotix-makes-transition-from-novelty-to-embodied-ai/",
      "publishedAt": "Fri, 13 Feb 2026 22:03:51 +0000",
      "summary": "Realbotix, which showed its humanoids at CES 2026, illustrates how technology can mature past adult entertainment, writes columnist Oliver Mitchell. The post Realbotix makes transition from novelty to embodied AI appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586970",
      "title": "Trener Robotics raises $32M for robot-agnostic skills platform",
      "url": "https://www.therobotreport.com/trener-robotics-raises-32m-for-robot-agnostic-skills-platform/",
      "publishedAt": "Fri, 13 Feb 2026 13:30:30 +0000",
      "summary": "Trener Robotics’ Acteris is a robot-agnostic skills platform that lets operators describe the tasks they want to automate in their own words. The post Trener Robotics raises $32M for robot-agnostic skills platform appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586965",
      "title": "PickNik Robotics to work with Motiv Space Systems on NASA ISAM mission",
      "url": "https://www.therobotreport.com/picknik-robotics-to-work-with-motiv-space-systems-on-nasa-isam-mission/",
      "publishedAt": "Thu, 12 Feb 2026 19:05:16 +0000",
      "summary": "For the mission, Motiv will be developing the robotic system while PickNik will provide robot motion planning and arm control software. The post PickNik Robotics to work with Motiv Space Systems on NASA ISAM mission appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12281v1",
      "title": "Scaling Verification Can Be More Effective than Scaling Policy Learning for Vision-Language-Action Alignment",
      "url": "https://arxiv.org/abs/2602.12281v1",
      "publishedAt": "2026-02-12T18:59:59Z",
      "summary": "The long-standing vision of general-purpose robots hinges on their ability to understand and act upon natural language instructions. Vision-Language-Action (VLA) models have made remarkable progress toward this goal, yet their generated actions can still misalign with the given instructions.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12246v1",
      "title": "6G Empowering Future Robotics: A Vision for Next-Generation Autonomous Systems",
      "url": "https://arxiv.org/abs/2602.12246v1",
      "publishedAt": "2026-02-12T18:31:24Z",
      "summary": "The convergence of robotics and next-generation communication is a critical driver of technological advancement. As the world transitions from 5G to 6G, the foundational capabilities of wireless networks are evolving to support increasingly complex and autonomous robotic systems. This paper examines the transformative impact of 6G on enhancing key robotics functionalities.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12244v1",
      "title": "Any House Any Task: Scalable Long-Horizon Planning for Abstract Human Tasks",
      "url": "https://arxiv.org/abs/2602.12244v1",
      "publishedAt": "2026-02-12T18:28:28Z",
      "summary": "Open world language conditioned task planning is crucial for robots operating in large-scale household environments. While many recent works attempt to address this problem using Large Language Models (LLMs) via prompting or training, a key challenge remains scalability. Performance often degrades rapidly with increasing environment size, plan length, instruction ambiguity, and constraint complexity.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12243v1",
      "title": "Federated Gaussian Process Learning via Pseudo-Representations for Large-Scale Multi-Robot Systems",
      "url": "https://arxiv.org/abs/2602.12243v1",
      "publishedAt": "2026-02-12T18:28:27Z",
      "summary": "Multi-robot systems require scalable and federated methods to model complex environments under computational and communication constraints. Gaussian Processes (GPs) offer robust probabilistic modeling, but suffer from cubic computational complexity, limiting their applicability in large-scale deployments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12215v1",
      "title": "LDA-1B: Scaling Latent Dynamics Action Model via Universal Embodied Data Ingestion",
      "url": "https://arxiv.org/abs/2602.12215v1",
      "publishedAt": "2026-02-12T17:53:51Z",
      "summary": "Recent robot foundation models largely rely on large-scale behavior cloning, which imitates expert actions but discards transferable dynamics knowledge embedded in heterogeneous embodied data. While the Unified World Model (UWM) formulation has the potential to leverage such diverse data, existing instantiations struggle to scale to foundation-level due to coarse data usage and fragmented datasets.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12199v1",
      "title": "Sub--Riemannian boundary value problems for Optimal Geometric Locomotion",
      "url": "https://arxiv.org/abs/2602.12199v1",
      "publishedAt": "2026-02-12T17:32:20Z",
      "summary": "We propose a geometric model for optimal shape-change-induced motions of slender locomotors, e.g., snakes slithering on sand. In these scenarios, the motion of a body in world coordinates is completely determined by the sequence of shapes it assumes. Specifically, we formulate Lagrangian least-dissipation principles as boundary value problems whose solutions are given by sub-Riemannian geodesics.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586968",
      "title": "Warehousing robot maker turns to lubrication-free motion plastics",
      "url": "https://www.therobotreport.com/warehousing-robot-maker-turns-to-lubrication-free-motion-plastics/",
      "publishedAt": "Thu, 12 Feb 2026 17:10:39 +0000",
      "summary": "Bastian Solutions needed rugged and reliable bearings for its warehousing robot to load trucks, so it turned to igus motion plastics. The post Warehousing robot maker turns to lubrication-free motion plastics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12159v1",
      "title": "3DGSNav: Enhancing Vision-Language Model Reasoning for Object Navigation via Active 3D Gaussian Splatting",
      "url": "https://arxiv.org/abs/2602.12159v1",
      "publishedAt": "2026-02-12T16:41:26Z",
      "summary": "Object navigation is a core capability of embodied intelligence, enabling an agent to locate target objects in unknown environments. Recent advances in vision-language models (VLMs) have facilitated zero-shot object navigation (ZSON).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12136v1",
      "title": "Embodied AI Agents for Team Collaboration in Co-located Blue-Collar Work",
      "url": "https://arxiv.org/abs/2602.12136v1",
      "publishedAt": "2026-02-12T16:22:18Z",
      "summary": "Blue-collar work is often highly collaborative, embodied, and situated in shared physical environments, yet most research on collaborative AI has focused on white-collar work. This position paper explores how the embodied nature of AI agents can support team collaboration and communication in co-located blue-collar workplaces.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12112v1",
      "title": "Few-Shot Design Optimization by Exploiting Auxiliary Information",
      "url": "https://arxiv.org/abs/2602.12112v1",
      "publishedAt": "2026-02-12T16:03:46Z",
      "summary": "Many real-world design problems involve optimizing an expensive black-box function $f(x)$, such as hardware design or drug discovery. Bayesian Optimization has emerged as a sample-efficient framework for this problem. However, the basic setting considered by these methods is simplified compared to real-world experimental setups, where experiments often generate a wealth of useful information.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.12099v1",
      "title": "GigaBrain-0.5M*: a VLA That Learns From World Model-Based Reinforcement Learning",
      "url": "https://arxiv.org/abs/2602.12099v1",
      "publishedAt": "2026-02-12T15:55:19Z",
      "summary": "Vision-language-action (VLA) models that directly predict multi-step action chunks from current observations face inherent limitations due to constrained scene understanding and weak future anticipation capabilities. In contrast, video world models pre-trained on web-scale video corpora exhibit robust spatiotemporal reasoning and accurate future prediction, making them a natural foundation for enhancing VLA learning.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12096v1",
      "title": "Multi Graph Search for High-Dimensional Robot Motion Planning",
      "url": "https://arxiv.org/abs/2602.12096v1",
      "publishedAt": "2026-02-12T15:50:15Z",
      "summary": "Efficient motion planning for high-dimensional robotic systems, such as manipulators and mobile manipulators, is critical for real-time operation and reliable deployment.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12095v1",
      "title": "Pack it in: Packing into Partially Filled Containers Through Contact",
      "url": "https://arxiv.org/abs/2602.12095v1",
      "publishedAt": "2026-02-12T15:47:04Z",
      "summary": "The automation of warehouse operations is crucial for improving productivity and reducing human exposure to hazardous environments. One operation frequently performed in warehouses is bin-packing where items need to be placed into containers, either for delivery to a customer, or for temporary storage in the warehouse.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.12074v1",
      "title": "RF-Modulated Adaptive Communication Improves Multi-Agent Robotic Exploration",
      "url": "https://arxiv.org/abs/2602.12074v1",
      "publishedAt": "2026-02-12T15:33:17Z",
      "summary": "Reliable coordination and efficient communication are critical challenges for multi-agent robotic exploration of environments where communication is limited.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.12065v1",
      "title": "Affordance-Graphed Task Worlds: Self-Evolving Task Generation for Scalable Embodied Learning",
      "url": "https://arxiv.org/abs/2602.12065v1",
      "publishedAt": "2026-02-12T15:23:45Z",
      "summary": "Training robotic policies directly in the real world is expensive and unscalable. Although generative simulation enables large-scale data synthesis, current approaches often fail to generate logically coherent long-horizon tasks and struggle with dynamic physical uncertainties due to open-loop execution.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Embodied AI"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12063v1",
      "title": "VLAW: Iterative Co-Improvement of Vision-Language-Action Policy and World Model",
      "url": "https://arxiv.org/abs/2602.12063v1",
      "publishedAt": "2026-02-12T15:21:47Z",
      "summary": "The goal of this paper is to improve the performance and reliability of vision-language-action (VLA) models through iterative online interaction. Since collecting policy rollouts in the real world is expensive, we investigate whether a learned simulator-specifically, an action-conditioned video generation model-can be used to generate additional rollout data.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12062v1",
      "title": "HoloBrain-0 Technical Report",
      "url": "https://arxiv.org/abs/2602.12062v1",
      "publishedAt": "2026-02-12T15:21:04Z",
      "summary": "In this work, we introduce HoloBrain-0, a comprehensive Vision-Language-Action (VLA) framework that bridges the gap between foundation model research and reliable real-world robot deployment.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12055v1",
      "title": "Multi UAVs Preflight Planning in a Shared and Dynamic Airspace",
      "url": "https://arxiv.org/abs/2602.12055v1",
      "publishedAt": "2026-02-12T15:18:46Z",
      "summary": "Preflight planning for large-scale Unmanned Aerial Vehicle (UAV) fleets in dynamic, shared airspace presents significant challenges, including temporal No-Fly Zones (NFZs), heterogeneous vehicle profiles, and strict delivery deadlines. While Multi-Agent Path Finding (MAPF) provides a formal framework, existing methods often lack the scalability and flexibility required for real-world Unmanned Traffic Management (UTM).",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12047v1",
      "title": "Safety Beyond the Training Data: Robust Out-of-Distribution MPC via Conformalized System Level Synthesis",
      "url": "https://arxiv.org/abs/2602.12047v1",
      "publishedAt": "2026-02-12T15:11:44Z",
      "summary": "We present a novel framework for robust out-of-distribution planning and control using conformal prediction (CP) and system level synthesis (SLS), addressing the challenge of ensuring safety and robustness when using learned dynamics models beyond the training data distribution. We first derive high-confidence model error bounds using weighted CP with a learned, state-control-dependent covariance model.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12032v1",
      "title": "When would Vision-Proprioception Policies Fail in Robotic Manipulation?",
      "url": "https://arxiv.org/abs/2602.12032v1",
      "publishedAt": "2026-02-12T15:00:48Z",
      "summary": "Proprioceptive information is critical for precise servo control by providing real-time robotic states. Its collaboration with vision is highly expected to enhance performances of the manipulation policy in complex tasks. However, recent studies have reported inconsistent observations on the generalization of vision-proprioception policies.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12024v1",
      "title": "Adaptive-Horizon Conflict-Based Search for Closed-Loop Multi-Agent Path Finding",
      "url": "https://arxiv.org/abs/2602.12024v1",
      "publishedAt": "2026-02-12T14:55:16Z",
      "summary": "MAPF is a core coordination problem for large robot fleets in automated warehouses and logistics. Existing approaches are typically either open-loop planners, which generate fixed trajectories and struggle to handle disturbances, or closed-loop heuristics without reliable performance guarantees, limiting their use in safety-critical deployments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.12012v1",
      "title": "Decentralized Multi-Robot Obstacle Detection and Tracking in a Maritime Scenario",
      "url": "https://arxiv.org/abs/2602.12012v1",
      "publishedAt": "2026-02-12T14:42:17Z",
      "summary": "Autonomous aerial-surface robot teams are promising for maritime monitoring. Robust deployment requires reliable perception over reflective water and scalable coordination under limited communication. We present a decentralized multi-robot framework for detecting and tracking floating containers using multiple UAVs cooperating with an autonomous surface vessel.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.11978v1",
      "title": "Accelerating Robotic Reinforcement Learning with Agent Guidance",
      "url": "https://arxiv.org/abs/2602.11978v1",
      "publishedAt": "2026-02-12T14:09:32Z",
      "summary": "Reinforcement Learning (RL) offers a powerful paradigm for autonomous robots to master generalist manipulation skills through trial-and-error. However, its real-world application is stifled by severe sample inefficiency. Recent Human-in-the-Loop (HIL) methods accelerate training by using human corrections, yet this approach faces a scalability barrier.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.11934v1",
      "title": "Robot-DIFT: Distilling Diffusion Features for Geometrically Consistent Visuomotor Control",
      "url": "https://arxiv.org/abs/2602.11934v1",
      "publishedAt": "2026-02-12T13:30:24Z",
      "summary": "We hypothesize that a key bottleneck in generalizable robot manipulation is not solely data scale or policy capacity, but a structural mismatch between current visual backbones and the physical requirements of closed-loop control.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.11929v1",
      "title": "General Humanoid Whole-Body Control via Pretraining and Fast Adaptation",
      "url": "https://arxiv.org/abs/2602.11929v1",
      "publishedAt": "2026-02-12T13:26:22Z",
      "summary": "Learning a general whole-body controller for humanoid robots remains challenging due to the diversity of motion distributions, the difficulty of fast adaptation, and the need for robust balance in high-dynamic scenarios. Existing approaches often require task-specific training or suffer from performance degradation when adapting to new motions.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.11890v1",
      "title": "Data-Driven Trajectory Imputation for Vessel Mobility Analysis",
      "url": "https://arxiv.org/abs/2602.11890v1",
      "publishedAt": "2026-02-12T12:40:27Z",
      "summary": "Modeling vessel activity at sea is critical for a wide range of applications, including route planning, transportation logistics, maritime safety, and environmental monitoring. Over the past two decades, the Automatic Identification System (AIS) has enabled real-time monitoring of hundreds of thousands of vessels, generating huge amounts of data daily.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.11885v1",
      "title": "Learning to Manipulate Anything: Revealing Data Scaling Laws in Bounding-Box Guided Policies",
      "url": "https://arxiv.org/abs/2602.11885v1",
      "publishedAt": "2026-02-12T12:34:56Z",
      "summary": "Diffusion-based policies show limited generalization in semantic manipulation, posing a key obstacle to the deployment of real-world robots. This limitation arises because relying solely on text instructions is inadequate to direct the policy's attention toward the target object in complex and dynamic environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2602.11882v1",
      "title": "Where Bits Matter in World Model Planning: A Paired Mixed-Bit Study for Efficient Spatial Reasoning",
      "url": "https://arxiv.org/abs/2602.11882v1",
      "publishedAt": "2026-02-12T12:32:51Z",
      "summary": "Efficient spatial reasoning requires world models that remain reliable under tight precision budgets. We study whether low-bit planning behavior is determined mostly by total bitwidth or by where bits are allocated across modules. Using DINO-WM on the Wall planning task, we run a paired-goal mixed-bit evaluation across uniform, mixed, asymmetric, and layerwise variants under two planner budgets.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Planning"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586961",
      "title": "Apptronik brings in another $520M to ramp up Apollo production",
      "url": "https://www.therobotreport.com/apptronik-brings-in-another-520m-to-ramp-up-apollo-production/",
      "publishedAt": "Wed, 11 Feb 2026 18:01:40 +0000",
      "summary": "Apptronik has raised a total of close to $1 billion as it continues developing the Apollo humanoid robot for industrial applications and more. The post Apptronik brings in another $520M to ramp up Apollo production appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3091866",
      "title": "Upside Robotics is reducing fertilizer use and waste in corn crops",
      "url": "https://techcrunch.com/2026/02/11/upside-robotics-is-reducing-fertilizer-use-and-waste-in-corn-crops/",
      "publishedAt": "Wed, 11 Feb 2026 16:00:00 +0000",
      "summary": "Upside Robotics builds autonomous solar-powered robots that can help farmers reduce their fertilizer use by 70%.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.10961v2",
      "title": "Stability Analysis of Geometric Control for a Canonical Class of Underactuated Aerial Vehicles with Spurious Forces",
      "url": "https://arxiv.org/abs/2602.10961v2",
      "publishedAt": "2026-02-11T15:51:21Z",
      "summary": "Standard geometric control relies on force-moment decoupling, an assumption that breaks down in many aerial platforms due to spurious forces naturally induced by control moments. While strategies for such coupled systems have been validated experimentally, a rigorous theoretical certification of their stability is currently missing.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://www.therobotreport.com/?p=586955",
      "title": "Symbotic acquires autonomous forklift maker Fox Robotics",
      "url": "https://www.therobotreport.com/symbotic-acquires-autonomous-forklift-maker-fox-robotics/",
      "publishedAt": "Tue, 10 Feb 2026 21:17:21 +0000",
      "summary": "Most of Fox Robotics' customers are not Symbotic customers, but it appears the two companies share one large customer. The post Symbotic acquires autonomous forklift maker Fox Robotics appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586953",
      "title": "Boston Dynamics CEO Robert Playter steps down",
      "url": "https://www.therobotreport.com/boston-dynamics-ceo-robert-playter-steps-down/",
      "publishedAt": "Tue, 10 Feb 2026 20:30:14 +0000",
      "summary": "Amanda McMaster, the company's CFO, will take over as interim CEO until Boston Dynamics' board of directors finds its next leader. The post Boston Dynamics CEO Robert Playter steps down appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586947",
      "title": "APEM launches Dual Icon series of LED indicators",
      "url": "https://www.therobotreport.com/apem-launches-dual-icon-series-of-led-indicators/",
      "publishedAt": "Tue, 10 Feb 2026 19:29:01 +0000",
      "summary": "APEM's Dual Icon indicators use green and red filters combined with vivid LED lighting to produce a 120° viewing angle. The post APEM launches Dual Icon series of LED indicators appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586949",
      "title": "Stryker introduces Mako Handheld Robotics with RPS launch",
      "url": "https://www.therobotreport.com/stryker-introduces-mako-handheld-robotics-with-rps-launch/",
      "publishedAt": "Tue, 10 Feb 2026 19:18:45 +0000",
      "summary": "New handheld robotic system combines Stryker’s proven Mako robotic technology with its power tool capabilities. The post Stryker introduces Mako Handheld Robotics with RPS launch appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586940",
      "title": "Lidar maker Ouster adds cameras with StereoLabs acquisition",
      "url": "https://www.therobotreport.com/lidar-maker-ouster-adds-cameras-with-stereolabs-acquisition/",
      "publishedAt": "Tue, 10 Feb 2026 17:19:02 +0000",
      "summary": "Ouster said the deal enables it to offer a unified sensing and perception platform that combines lidar, cameras, AI compute, sensor fusion and perception software. The post Lidar maker Ouster adds cameras with StereoLabs acquisition appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics",
        "Vision"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586916",
      "title": "High-sensitivity torque sensors offer force feedback for small-payload cobots",
      "url": "https://www.therobotreport.com/high-sensitivity-torque-sensors-offer-force-feedback-for-small-payload-cobots/",
      "publishedAt": "Tue, 10 Feb 2026 14:24:00 +0000",
      "summary": "The latest force torque sensors provide the levels of sensitivity and reliability needed for industrial cobot applications. The post High-sensitivity torque sensors offer force feedback for small-payload cobots appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586932",
      "title": "Destro AI launches Agentic AI Brain for human-robot collaboration",
      "url": "https://www.therobotreport.com/destro-ai-launches-agentic-ai-brain-human-robot-collaboration/",
      "publishedAt": "Tue, 10 Feb 2026 14:00:58 +0000",
      "summary": "Destro AI says its new Agentic AI Brain is hardware-agnostic and treats both people and robots as agents for unified, cloud-based management. The post Destro AI launches Agentic AI Brain for human-robot collaboration appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://www.therobotreport.com/?p=586933",
      "title": "11 reasons robots struggle to scale in high-mix manufacturing",
      "url": "https://www.therobotreport.com/11-reasons-robots-struggle-to-scale-in-high-mix-manufacturing/",
      "publishedAt": "Mon, 09 Feb 2026 18:44:44 +0000",
      "summary": "Few robotics technologies have been actually deployed in high-mix applications. Let's explore the reasons behind this slow transition. The post 11 reasons robots struggle to scale in high-mix manufacturing appeared first on The Robot Report .",
      "source": "The Robot Report",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.06643v2",
      "title": "Humanoid Manipulation Interface: Humanoid Whole-Body Manipulation from Robot-Free Demonstrations",
      "url": "https://arxiv.org/abs/2602.06643v2",
      "publishedAt": "2026-02-06T12:10:47Z",
      "summary": "Current approaches for humanoid whole-body manipulation, primarily relying on teleoperation or visual sim-to-real reinforcement learning, are hindered by hardware logistics and complex reward engineering. Consequently, demonstrated autonomous skills remain limited and are typically restricted to controlled environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "RL"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2602.01501v3",
      "title": "TreeLoc: 6-DoF LiDAR Global Localization in Forests via Inter-Tree Geometric Matching",
      "url": "https://arxiv.org/abs/2602.01501v3",
      "publishedAt": "2026-02-02T00:32:07Z",
      "summary": "Reliable localization is crucial for navigation in forests, where GPS is often degraded and LiDAR measurements are repetitive, occluded, and structurally complex. These conditions weaken the assumptions of traditional urban-centric localization methods, which assume that consistent features arise from unique structural patterns, necessitating forest-centric solutions to achieve robustness in these environments.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=89488",
      "title": "Into the Omniverse: Physical AI Open Models and Frameworks Advance Robots and Autonomous Systems",
      "url": "https://blogs.nvidia.com/blog/physical-ai-open-models-robot-autonomous-systems-omniverse/",
      "publishedAt": "Thu, 29 Jan 2026 17:00:21 +0000",
      "summary": "Open source has become essential for driving innovation in robotics and autonomy. By providing access to critical infrastructure — from simulation frameworks to AI models — NVIDIA is enabling collaborative development that accelerates the path to safer, more capable autonomous systems.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3083601",
      "title": "How YC-backed Bucket Robotics survived its first CES",
      "url": "https://techcrunch.com/2026/01/18/how-yc-backed-bucket-robotics-survived-its-first-ces/",
      "publishedAt": "Sun, 18 Jan 2026 16:10:00 +0000",
      "summary": "Now, the startup is turning its attention to building the business, fundraising, and striking commercial deals.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3082677",
      "title": "Oshen built the first ocean robot to collect data in a Category 5 hurricane",
      "url": "https://techcrunch.com/2026/01/17/oshen-built-the-first-ocean-robot-to-collect-data-in-a-category-5-hurricane/",
      "publishedAt": "Sat, 17 Jan 2026 16:00:00 +0000",
      "summary": "Oshen has signed contracts with multiple government agencies for its C-Star robots to collect ocean data autonomously.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88971",
      "title": "AI’s Next Revolution: Multiply Labs Is Scaling Robotics-Driven Cell Therapy Biomanufacturing Labs",
      "url": "https://blogs.nvidia.com/blog/multiply-labs-isaac-omniverse/",
      "publishedAt": "Mon, 12 Jan 2026 15:00:48 +0000",
      "summary": "Startup works with leading cell therapy companies to bring robotics manufacturing into the clean room, reducing costs by more than 70% while accelerating output compared with legacy systems.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_video&#038;p=3081489",
      "title": "Inside CES 2026&#8217;s “physical AI” takeover",
      "url": "https://techcrunch.com/video/inside-ces-2026s-physical-ai-takeover/",
      "publishedAt": "Fri, 09 Jan 2026 01:19:00 +0000",
      "summary": "After years of chatbots and image generators, AI is finally leaving the screen. At CES 2026, that shift became impossible to ignore.&#160; The annual tech showcase in Las Vegas was&#160;dominated by &#8220;physical AI&#8221;&#160;and robotics, from Boston Dynamic&#8217;s newly redesigned Atlas humanoid robot to AI-powered ice makers (yes, really). The companies in attendance clearly want consumers [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88856",
      "title": "Japan Science and Technology Agency Develops NVIDIA-Powered Moonshot Robot for Elderly Care",
      "url": "https://blogs.nvidia.com/blog/japan-science-technology-agency-develops-moonshot-robot/",
      "publishedAt": "Thu, 08 Jan 2026 16:00:29 +0000",
      "summary": "The next universal technology since the smartphone is on the horizon — and it may be a little less pocket friendly. The Moonshot research program, funded by the Japan Science and Technology Agency and accelerated by NVIDIA AI and robotics technologies, is working to create a world by 2050 where AI-powered, autonomously learning robots are Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88923",
      "title": "Steel, Sensors and Silicon: How Caterpillar Is Bringing Edge AI to the Jobsite",
      "url": "https://blogs.nvidia.com/blog/caterpillar-ces-2026/",
      "publishedAt": "Wed, 07 Jan 2026 17:15:15 +0000",
      "summary": "At CES, Caterpillar reveals how it’s integrating NVIDIA technologies, from NVIDIA Jetson Thor to speech models, to transform the world’s heavy industries.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88849",
      "title": "From Warehouse to Wallet: New State of AI in Retail and CPG Survey Uncovers How AI Is Rewiring Supply Chains and Customer Experiences",
      "url": "https://blogs.nvidia.com/blog/ai-in-retail-cpg-survey-2026/",
      "publishedAt": "Wed, 07 Jan 2026 14:00:06 +0000",
      "summary": "AI has transformed retail and consumer packaged goods (CPG) operations, enhancing customer analysis and segmentation to enable greater personalization for marketing and advertising, and boosting the speed and accuracy of demand forecasting for supply chains and logistics. Companies are also raising the bar for customer engagement through intelligent digital shopping assistants and catalog enrichment by Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88652",
      "title": "NVIDIA Unveils New Open Models, Data and Tools to Advance AI Across Every Industry",
      "url": "https://blogs.nvidia.com/blog/open-models-data-tools-accelerate-ai/",
      "publishedAt": "Mon, 05 Jan 2026 21:50:50 +0000",
      "summary": "Expanding the open model universe, NVIDIA today released new open models, data and tools to advance AI across every industry. These models — spanning the NVIDIA Nemotron family for agentic AI, the NVIDIA Cosmos platform for physical AI, the new NVIDIA Alpamayo family for autonomous vehicle development, NVIDIA Isaac GR00T for robotics and NVIDIA Clara Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3077498",
      "title": "Pickle Robot adds Tesla veteran as first CFO",
      "url": "https://techcrunch.com/2025/12/18/pickle-robot-adds-tesla-veteran-as-first-cfo/",
      "publishedAt": "Thu, 18 Dec 2025 20:01:46 +0000",
      "summary": "Jeff Evanson recently joined Pickle Robot as the company's first CFO as the startup has allegedly expanded its partnership with UPS.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88410",
      "title": "Into the Omniverse: OpenUSD and NVIDIA Halos Accelerate Safety for Robotaxis, Physical AI Systems",
      "url": "https://blogs.nvidia.com/blog/openusd-halos-safety-robotaxi-physical-ai/",
      "publishedAt": "Wed, 17 Dec 2025 17:00:49 +0000",
      "summary": "Physical AI is moving from research labs into the real world, powering intelligent robots and autonomous vehicles (AVs) — such as robotaxis — that must reliably sense, reason and act amid unpredictable conditions.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=88276",
      "title": "Cheers to AI: ADAM Robot Bartender Makes Drinks at Vegas Golden Knights Game",
      "url": "https://blogs.nvidia.com/blog/adam-robot-vegas-golden-knights-thor/",
      "publishedAt": "Fri, 12 Dec 2025 16:00:04 +0000",
      "summary": "In Las Vegas’s T-Mobile Arena, fans of the Golden Knights are getting more than just hockey — they’re getting a taste of the future. ADAM, a robot developed with NVIDIA Isaac libraries, is pouring drinks and turning heads in one of the NHL’s most exciting venues. ADAM, short for Automated Dual Arm Mixologist, was developed Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3075424",
      "title": "1X struck a deal to send its &#8216;home&#8217; humanoids to factories and warehouses",
      "url": "https://techcrunch.com/2025/12/11/1x-struck-a-deal-to-send-its-home-humanoids-to-factories-and-warehouses/",
      "publishedAt": "Thu, 11 Dec 2025 22:03:36 +0000",
      "summary": "Despite launching as a humanoid robot designed to help consumers around the house, 1X's Neo robots are heading to industrial use cases.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=88078",
      "title": "Robots’ Holiday Wishes Come True: NVIDIA Jetson Platform Offers High-Performance Edge AI at Festive Prices",
      "url": "https://blogs.nvidia.com/blog/jetson-edge-ai-holiday-2025/",
      "publishedAt": "Thu, 04 Dec 2025 16:00:07 +0000",
      "summary": "Editor’s note: This blog has been updated to showcase additional recent innovations tapping into the NVIDIA Jetson platform. Developers, researchers, hobbyists and students can take a byte out of holiday shopping this season as NVIDIA has unwrapped special discounts on the NVIDIA Jetson family of developer kits for edge AI and robotics — available through Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=87946",
      "title": "NVIDIA and AWS Expand Full-Stack Partnership, Providing the Secure, High-Performance Compute Platform Vital for Future Innovation",
      "url": "https://blogs.nvidia.com/blog/aws-partnership-expansion-reinvent/",
      "publishedAt": "Tue, 02 Dec 2025 16:00:27 +0000",
      "summary": "At AWS re:Invent, NVIDIA and Amazon Web Services expanded their strategic collaboration with new technology integrations across interconnect technology, cloud infrastructure, open models and physical AI. As part of this expansion, AWS will support NVIDIA NVLink Fusion — a platform for custom AI infrastructure — for deploying its custom-designed silicon, including next-generation Trainium4 chips for Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87911",
      "title": "At NeurIPS, NVIDIA Advances Open Model Development for Digital and Physical AI",
      "url": "https://blogs.nvidia.com/blog/neurips-open-source-digital-physical-ai/",
      "publishedAt": "Mon, 01 Dec 2025 17:00:48 +0000",
      "summary": "Researchers worldwide rely on open-source technologies as the foundation of their work. To equip the community with the latest advancements in digital and physical AI, NVIDIA is further expanding its collection of open AI models, datasets and tools — with potential applications in virtually every research field. At NeurIPS, one of the world’s top AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3069331",
      "title": "This Khosla-backed startup can track drones, trucks, and robotaxis, inch by inch",
      "url": "https://techcrunch.com/2025/11/20/this-khosla-based-startup-can-track-drones-trucks-and-robotaxis-inch-by-inch/",
      "publishedAt": "Thu, 20 Nov 2025 18:00:01 +0000",
      "summary": "Point One Navigation, now valued at $230 million, is building out well beyond automotive.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87636",
      "title": "Powering AI Superfactories, NVIDIA and Microsoft Integrate Latest Technologies for Inference, Cybersecurity, Physical AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-microsoft-ai-superfactories/",
      "publishedAt": "Tue, 18 Nov 2025 20:00:22 +0000",
      "summary": "Timed with the Microsoft Ignite conference running this week, NVIDIA is expanding its collaboration with Microsoft, including through the adoption of next-generation NVIDIA Spectrum-X Ethernet switches for the new Microsoft Fairwater AI superfactory, powered by the NVIDIA Blackwell platform. The collaboration brings new integrations across Microsoft 365 Copilot, as well as the public preview of Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=87325",
      "title": "Nemotron Labs: 3 Ways to Bring Agentic AI to Computer Vision Applications",
      "url": "https://blogs.nvidia.com/blog/ways-to-bring-agentic-ai-to-computer-vision-applications/",
      "publishedAt": "Thu, 13 Nov 2025 18:50:06 +0000",
      "summary": "Editor’s note: This post is part of the Nemotron Labs blog series, which explores how the latest open models, datasets and training techniques help businesses build specialized AI systems and applications on NVIDIA platforms. Each post highlights practical ways to use an open stack to deliver real value in production — from transparent research copilots Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Vision"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3066690",
      "title": "Why a researcher is building robots that look and act like bats",
      "url": "https://techcrunch.com/2025/11/12/why-a-researcher-is-building-robots-that-look-and-act-like-bats/",
      "publishedAt": "Wed, 12 Nov 2025 17:12:07 +0000",
      "summary": "These palm-sized robots use ultrasound signals to navigate harsh conditions in search and rescue missions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2511.08019v3",
      "title": "Model Predictive Control via Probabilistic Inference: A Tutorial and Survey",
      "url": "https://arxiv.org/abs/2511.08019v3",
      "publishedAt": "2025-11-11T09:21:27Z",
      "summary": "This paper presents a tutorial and survey on probabilistic inference-based model predictive control (PI-MPC) for robotics. PI-MPC reformulates finite-horizon optimal control as inference over an optimal control distribution expressed as a Boltzmann distribution weighted by a control prior, and generates actions through variational inference.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Planning"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3064348",
      "title": "AI researchers &#8217;embodied&#8217; an LLM into a robot – and it started channeling Robin Williams",
      "url": "https://techcrunch.com/2025/11/01/ai-researchers-embodied-an-llm-into-a-robot-and-it-started-channeling-robin-williams/",
      "publishedAt": "Sat, 01 Nov 2025 15:00:00 +0000",
      "summary": "AI researchers at Andon Labs embedded various LLMs in a vacuum robot to test how ready they were to be embodied. And hilarity ensued.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics",
        "Embodied AI",
        "LLM"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86672",
      "title": "Into the Omniverse: Open World Foundation Models Generate Synthetic Worlds for Physical AI Development",
      "url": "https://blogs.nvidia.com/blog/scaling-physical-ai-omniverse/",
      "publishedAt": "Wed, 29 Oct 2025 13:00:30 +0000",
      "summary": "Physical AI models — which power robots, autonomous vehicles and other intelligent machines — must be safe, generalized for dynamic scenarios and capable of perceiving, reasoning and operating in real time.",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86223",
      "title": "NVIDIA GTC Washington, DC: Live Updates on What’s Next in AI",
      "url": "https://blogs.nvidia.com/blog/nvidia-gtc-washington-dc-2025-news/",
      "publishedAt": "Tue, 28 Oct 2025 19:45:40 +0000",
      "summary": "Monday, Oct. 27, 12:30 p.m. ET How Medium-Sized Cities Are Tackling AI Readiness 🔗 A panel discussion today at GTC Washington, D.C., highlighted a public-private initiative to invigorate the economy of Rancho Cordova, California, with a focus on AI. To bolster innovation, the city is working with the Human Machine Collaboration Institute and NVIDIA on Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86513",
      "title": "Fueling Economic Development Across the US: How NVIDIA Is Empowering States, Municipalities and Universities to Drive Innovation",
      "url": "https://blogs.nvidia.com/blog/economic-development-us/",
      "publishedAt": "Tue, 28 Oct 2025 18:02:21 +0000",
      "summary": "To democratize access to AI technology nationwide, AI education and deployment can’t be limited to a few urban tech hubs — it must reach every community, university and state. That’s why NVIDIA is working with cities, states and educational institutions to embed AI education and innovation across the U.S., with the goal of helping the Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://blogs.nvidia.com/?p=86374",
      "title": "NVIDIA IGX Thor Robotics Processor Brings Real-Time Physical AI to the Industrial and Medical Edge",
      "url": "https://blogs.nvidia.com/blog/igx-thor-processor-physical-ai-industrial-medical-edge/",
      "publishedAt": "Tue, 28 Oct 2025 17:58:53 +0000",
      "summary": "AI is moving from the digital world into the physical one. Across factory floors and operating rooms, machines are evolving into collaborators that can see, sense and make decisions in real time. To accelerate this transformation, NVIDIA today unveiled NVIDIA IGX Thor, a powerful, industrial-grade platform built to bring real-time physical AI directly to the edge, Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86476",
      "title": "NVIDIA Launches Open Models and Data to Accelerate AI Innovation Across Language, Biology and Robotics",
      "url": "https://blogs.nvidia.com/blog/open-models-data-ai/",
      "publishedAt": "Tue, 28 Oct 2025 17:31:14 +0000",
      "summary": "Furthering its deep commitment to open source, NVIDIA is unveiling new open-source AI technologies for language, robotics and biology — contributing to an open ecosystem that broadens access to AI and fuels U.S. innovation. These open technologies will empower developers worldwide and strengthen economic growth through efficient reasoning, high-fidelity world generation and interactive physical AI Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://blogs.nvidia.com/?p=86265",
      "title": "NVIDIA Contributes to Open Frameworks for Next-Generation Robotics Development",
      "url": "https://blogs.nvidia.com/blog/roscon-2025-open-framework-robotics/",
      "publishedAt": "Mon, 27 Oct 2025 00:00:55 +0000",
      "summary": "This year’s ROSCon conference heads to Singapore, bringing together the global robotics developer community behind Robot Operating System (ROS) — the world’s most widely adopted open framework for building robots. At the conference, running through Wednesday, Oct. 29, NVIDIA announced collaborations with partners and the Open Source Robotics Alliance (OSRA), as well as new robotics Read Article",
      "source": "NVIDIA Blog: Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2510.22126v2",
      "title": "EasyUUV: An LLM-Enhanced Universal and Lightweight Sim-to-Real Reinforcement Learning Framework for UUV Attitude Control",
      "url": "https://arxiv.org/abs/2510.22126v2",
      "publishedAt": "2025-10-25T02:55:02Z",
      "summary": "Despite recent advances in Unmanned Underwater Vehicle (UUV) attitude control, existing methods still struggle with generalizability, robustness to real-world disturbances, and efficient deployment.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "RL"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3057128",
      "title": "Coco Robotics taps UCLA professor to lead new physical AI research lab",
      "url": "https://techcrunch.com/2025/10/14/coco-robotics-taps-ucla-professor-to-lead-new-physical-ai-research-lab/",
      "publishedAt": "Tue, 14 Oct 2025 15:51:10 +0000",
      "summary": "Coco Robotics is working toward automating its fleet of delivery robots using its millions of miles of collected data.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3056108",
      "title": "The world is just not quite ready for humanoids yet",
      "url": "https://techcrunch.com/2025/10/10/the-world-is-just-not-quite-ready-for-humanoids-yet/",
      "publishedAt": "Fri, 10 Oct 2025 13:15:00 +0000",
      "summary": "Despite the amount of money being injected into the industry, humanoids won't be able to learn dexterity -- or the fine motor movements with hands -- rendering them essentially useless.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3055392",
      "title": "SoftBank bulks up its robotics portfolio with ABB Group’s robotics unit",
      "url": "https://techcrunch.com/2025/10/08/softbank-bulks-up-its-robotics-portfolio-with-abb-groups-robotics-unit/",
      "publishedAt": "Wed, 08 Oct 2025 14:10:18 +0000",
      "summary": "SoftBank says this acquisition will help it dive deeper into robotics as it considers physical AI to be the next frontier.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3052476",
      "title": "Former OpenAI and DeepMind researchers raise whopping $300M seed to automate science",
      "url": "https://techcrunch.com/2025/09/30/former-openai-and-deepmind-researchers-raise-whopping-300m-seed-to-automate-science/",
      "publishedAt": "Tue, 30 Sep 2025 18:56:59 +0000",
      "summary": "Periodic Labs has raised from a tech industry who's who, including Andreessen Horowitz, Nvidia, Elad Gil, Jeff Dean, Eric Schmidt, and Jeff Bezos.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?post_type=tc_podcast&#038;p=3047793",
      "title": "Live demo fails, AI safety wins, and the golden age of robotics",
      "url": "https://techcrunch.com/podcast/live-demo-fails-ai-safety-wins-and-the-golden-age-of-robotics/",
      "publishedAt": "Fri, 19 Sep 2025 15:48:52 +0000",
      "summary": "This week on Equity, Anthony Ha, Kirsten Korosec, and Max Zeff unpack the biggest moves in AI, robotics, and regulation. Listen to the full episode to hear about: Equity will be back next week. Subscribe wherever you get your podcasts! Equity is TechCrunch’s flagship podcast, produced by Theresa Loconsolo, and posts every Wednesday and Friday. [&#8230;]",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3038948",
      "title": "Why Runway is eyeing the robotics industry for future revenue growth",
      "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
      "publishedAt": "Mon, 01 Sep 2025 15:00:00 +0000",
      "summary": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Autonomous Driving",
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3031231",
      "title": "Tesla is reportedly behind on its pledge to build 5,000 Optimus bots this year",
      "url": "https://techcrunch.com/2025/07/25/tesla-is-reportedly-behind-on-its-pledge-to-build-5000-optimus-bots-this-year/",
      "publishedAt": "Fri, 25 Jul 2025 14:14:19 +0000",
      "summary": "Tesla is behind on its goal to produce at least 5,000 Optimus humanoid robots by the end of 2025.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": []
    },
    {
      "id": "https://techcrunch.com/?p=3030126",
      "title": "How TRIC Robotics is reducing pesticide use on strawberries using UV light",
      "url": "https://techcrunch.com/2025/07/23/how-tric-robotics-is-reducing-pesticide-use-on-strawberries-using-uv-light/",
      "publishedAt": "Wed, 23 Jul 2025 14:00:00 +0000",
      "summary": "TRIC Robotics just raised a $5.5 million seed round for its tractor-sized robots that help eliminate bacteria and pests on strawberry plants.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3026176",
      "title": "Diligent Robotics hires two notable Cruise alumni to its leadership team",
      "url": "https://techcrunch.com/2025/07/10/diligent-robotics-adds-two-notable-cruise-alumni-to-its-leadership-team/",
      "publishedAt": "Thu, 10 Jul 2025 13:00:00 +0000",
      "summary": "Diligent Robotics hired Cruise's former chief operating officer and former head of AI and robotics into c-suite positions.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3025792",
      "title": "Hugging Face opens up orders for its Reachy Mini desktop robots",
      "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/",
      "publishedAt": "Wed, 09 Jul 2025 07:00:00 +0000",
      "summary": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "https://techcrunch.com/?p=3020586",
      "title": "SoftBank reportedly looking to launch a trillion-dollar AI and robotics industrial complex",
      "url": "https://techcrunch.com/2025/06/20/softbank-reportedly-looking-to-launch-a-trillion-dollar-ai-and-robotics-industrial-complex/",
      "publishedAt": "Fri, 20 Jun 2025 15:22:06 +0000",
      "summary": "The investing conglomerate is looking to team up with TSMC on the initiative as SoftBank continues to pour money into AI.",
      "source": "TechCrunch Robotics",
      "type": "news",
      "tags": [
        "Robotics"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2505.18382v4",
      "title": "One Demo Is All It Takes: Planning Domain Derivation with LLMs from A Single Demonstration",
      "url": "https://arxiv.org/abs/2505.18382v4",
      "publishedAt": "2025-05-23T21:17:10Z",
      "summary": "Pre-trained large language models (LLMs) show promise for robotic task planning but often struggle to guarantee correctness in long-horizon problems. Task and motion planning (TAMP) addresses this by grounding symbolic plans in low-level execution, yet it relies heavily on manually engineered planning domains.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "LLM",
        "Planning"
      ]
    },
    {
      "id": "http://arxiv.org/abs/2409.17395v2",
      "title": "An Anatomy-Aware Shared Control Approach for Assisted Teleoperation of Lung Ultrasound Examinations",
      "url": "https://arxiv.org/abs/2409.17395v2",
      "publishedAt": "2024-09-25T22:13:50Z",
      "summary": "Although fully autonomous systems still face challenges due to patients' anatomical variability, teleoperated systems appear to be more practical in current healthcare settings. This paper presents an anatomy-aware control framework for teleoperated lung ultrasound.",
      "source": "arXiv",
      "type": "paper",
      "tags": []
    },
    {
      "id": "http://arxiv.org/abs/2210.00379v8",
      "title": "NeRF: Neural Radiance Field in 3D Vision: A Comprehensive Review (Updated Post-Gaussian Splatting)",
      "url": "https://arxiv.org/abs/2210.00379v8",
      "publishedAt": "2022-10-01T21:35:11Z",
      "summary": "In March 2020, Neural Radiance Field (NeRF) revolutionized Computer Vision, allowing for implicit, neural network-based scene representation and novel view synthesis. NeRF models have found diverse applications in robotics, urban mapping, autonomous navigation, virtual reality/augmented reality, and more.",
      "source": "arXiv",
      "type": "paper",
      "tags": [
        "Robotics",
        "Vision",
        "Planning"
      ]
    }
  ]
}